{
    "sustainability-18-00017-v2_pdf": [
        "#\n\nsustainability\n\nMDPI\n\nSystematic Review\n\n# Greenwashing in Sustainability Reporting: A Systematic Literature Review of Strategic Typologies and Content-Analysis-Based Measurement Approaches\n\nAgnieszka Janik and Adam Ryszko\n\nFaculty of Organization and Management, Silesian University of Technology, 41-800 Zabrze, Poland; agnieszka.janik@polsl.pl\n\n* Correspondence: adam.ryszko@polsl.pl\n\n#",
        "Abstract\n\nThis paper presents a systematic literature review (SLR) of research on strategic positioning of companies and the measurement of greenwashing in sustainability reporting. Its main aim is to synthesize and organize the existing literature, identify key research gaps, and outline directions for future studies. Drawing on a rigorous content analysis of 88 studies, we delineate strategic typologies of greenwashing in sustainability reporting and examine content-analysis-based measurement approaches used to detect it. Our SLR shows that most strategic typologies draw on theories such as legitimacy theory, impression management theory, signaling theory, and stakeholder theory. Several studies adopt a four-quadrant matrix with varying conceptual dimensions, while others classify strategic responses to institutional pressures along a passive-active continuum. However, the evidence suggests that to assume that companies uniformly pursue sustainability reporting strategies is a major oversimplification. The findings also indicate that the literature proposes a variety of innovative, content-analysis-based approaches aimed at capturing divergences between communicative claims and organizational realities—most notably, discrepancies between disclosure and measurable performance, and between symbolic and substantive sustainability actions, as well as the identification of selective or manipulative communication practices that may signal greenwashing. Analytical techniques commonly focus on linguistic and visual cues in sustainability reports, including tone (sentiment and narrative framing), readability (both traditional readability indices and machine learning-based textual complexity measures), and visual content (selective emphasis, imagery framing, and graphic distortions). We also synthesize studies that document empirically verified instances of greenwashing and contrast them with research that, in our view, relies on overly simplified or untested assumptions. Based on this SLR, we identify central theoretical and methodological priorities for advancing the study of greenwashing in sustainability reporting and propose a research agenda to guide future research.\n\nKeywords: sustainability reporting; corporate greenwashing; greenwashing measurement; measurement approaches; strategic typologies; systematic literature review\n\n# 1.",
        "Introduction\n\nThe concept of greenwashing began to gain wider attention in the late 1990s, with scholarly and public interest in the issue continuing to grow over the following decades [1]. Although research on this phenomenon has expanded significantly, the concept still lacks a\n\nCheck for updates\n\nAcademic Editor: Silvia Angeloni\n\nReceived: 6 November 2025\n\nRevised: 4 December 2025\n\nAccepted: 12 December 2025\n\nPublished: 19 December 2025\n\nCopyright: © 2025 by the authors.\n\nLicensee MDPI, Basel, Switzerland.\n\nThis article is an open access article\n\ndistributed under the terms and\n\nconditions of the Creative Commons\n\nAttribution (CC BY) license.\n\nSustainability 2026, 18, 17\n\nhttps://doi.org/10.3390/su18010017\nsingle, universally accepted definition, and its interpretation remains open to debate [2]. It was originally applied to environmental issues and defined as “the intersection of two firm behaviors: poor environmental performance and positive communication about environmental performance” [3]. It was also referred to as “symbolic corporate environmentalism” [4]. Subsequently, the concept evolved into a broader interpretation, described as the “selective disclosure of positive information about a company's environmental or social performance without full disclosure of negative information on these dimensions, so as to create an overly positive corporate image” [5] or the “act of presenting a company's environmental and/or social performance in a misleading way” [6]. Following the triple-bottom-line approach to sustainability and the principles of environmental integrity, social equity, and economic prosperity, addressing environmental, social, and economic issues has become essential to discussions of greenwashing [2].\n\nGreenwashing has been analyzed from various perspectives, with the literature presenting different conceptualizations of its relationship to similar notions. Some authors interpret it as a form of decoupling [7], highlighting the discrepancy between dissemination of symbolic statements (“talk”) and actual actions (“walk”) [8]. Others view greenwashing as a concept that describes decoupling processes within the context of sustainability, treating greenwashing and decoupling as synonyms [9,10,11]. Yet, Siano et al. [12] distinguish between two primary types of greenwashing: decoupling and attention deflection. In this context, decoupling refers to the gap between disclosure and performance [13] or between policy statements and actual corporate commitment [14], as well as the disconnection between means and ends [15]. It also includes impression management practices that involve “empty green claims and policies” and “sin of fibbing”, in which companies make claims that are outright false [16]. Impression management encompasses emphasizing positive organizational outcomes (enhancement) or obfuscating negative organizational outcomes (concealment) [17].\n\nAttention deflection, as the act of concealing unethical business practices, encompasses various deceptive communication tactics, such as selective and inaccurate disclosure [5], including incomplete comparisons and vague or irrelevant statements [18]. It also involves misleading written texts and visual imagery [19] as well as unverifiable claims, such as implied superiority and the “sin of no proof”, where assertions lack substantiating evidence or accessible supporting information [20].\n\nGreenwashing involves both the overstatement of positive performance and the concealment of negative information [21,22]. It encompasses a broad range of practices commonly characterized by the dissemination of misleading information [23], including various forms of false claims rooted in hypocrisy and/or deception [24]. Some authors connect greenwashing with the obfuscation of negative sustainability information, suggesting that companies with inferior sustainability performance use complex, ambiguous language to produce intentionally opaque or confusing reports [25]. This means that greenwashing can be identified through linguistic patterns, which often rely on overly optimistic terms that emphasize positive aspects. Accordingly, the literature on greenwashing is closely related to research on selective disclosure, in which favorable information is emphasized while unfavorable details are minimized or omitted [26].\n\nIn this paper, we refer to greenwashing in sustainability reporting as the deliberate or unintended dissemination of misleading, incomplete, or overly favorable sustainability-related disclosures. It is manifested through the selective presentation of positive information, the concealment or obfuscation of negative performance, or the decoupling of reported claims from underlying organizational practices. This process constructs an unjustifiably positive impression of corporate sustainability by overstating positive actions and concealing negative ones.\nThe complex and often ambiguous nature of greenwashing presents substantial methodological challenges for researchers attempting to identify and measure it. At the same time, these challenges offer valuable opportunities for future inquiry [27]. However, there remains a limited understanding regarding the strategic typologies of greenwashing in sustainability reporting and the approaches used to measure it, including their operationalization, methodologies, and data sources applied in this field [28]. In particular, approaches based on content analysis are especially valuable and offer significant conceptual and empirical insights, given that much of the existing research on greenwashing relies on indicators derived from secondary sources such as dedicated databases and specific ratings, which are not always transparent, are often binary, and may be arbitrary or highly autocorrelated. In fact, using composite ESG indicators derived from secondary sources typically provides only aggregated scores, obscuring which aspect of greenwashing is measured, reducing comparability across heterogeneous providers, and limiting replicability where access to commercial ESG databases is restricted [29,30,31].\n\nGrowing scholarly interest in greenwashing has resulted in the publication of several systematic literature reviews [32,33,34,35,36,37,38,39] and bibliometric analyses that characterize the structure and trends in this scientific field [40,41,42,43]. Nonetheless, systematic literature reviews focusing specifically on the measurement of greenwashing [32] and greenwashing in sustainability reporting [44,45] remain scarce. This scarcity is particularly evident in relation to strategic typologies of greenwashing in sustainability reporting and to measurement approaches grounded in content-analysis studies.\n\nGiven these challenges and the rapidly expanding research on greenwashing in sustainability reporting, it is crucial to build on existing analyses to address persistent gaps and explore under-researched areas.\n\nThe main aim of this paper, therefore, is to systematically organize and synthesize the current literature, identify key research gaps, and outline directions for future studies in this field. We offer, to the best of our knowledge, one of the most comprehensive syntheses to date of strategic typologies of greenwashing in sustainability reporting and provide an integrated, conceptually grounded overview of existing approaches and analytical techniques used to measure and detect greenwashing through content analysis. In particular, our systematic literature review aims to address the following research questions, which have not been sufficiently explored in existing research:What strategic typologies of greenwashing in sustainability reporting have been identified in the literature?What content analysis--based measurement approaches are used to detect greenwashing in sustainability reporting?\n\nThe remainder of the paper is organized as follows. Section 2 details the research methodology. In Section 3, the results are presented and discussed. Section 4 identifies areas for future research and Section 5 provides concluding remarks and acknowledges the study's limitations.\n\n## 2.",
        "Materials and Methods\n\nWe conducted a systematic literature review (SLR) to address the research questions outlined in the introduction. As a rigorous and structured research method, an SLR facilitates a comprehensive examination of scholarly works within a specific research domain. This approach enables the mapping and synthesis of existing knowledge while providing insight into the interconnections among studies. Furthermore, it supports the identification, classification, and critical evaluation of the current body of literature, thereby establishing a foundation for recognizing research gaps and proposing future research directions [28,35,46,47].\nThe SLR presented in this study was conducted in accordance with the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA 2020) guidelines [48]. The review utilized the Scopus and Web of Science (WoS) Core Collection databases, selected for their reliability, relevance, and frequent use in systematic reviews [35,49]. In addition, these databases are the most widely used citation indexes in the world, and, consequently, most bibliometric and scientometric tools are based on them [50,51].\n\nTo improve methodological robustness, the selection of search terms was informed by a comprehensive review of previous SLRs and bibliometric analyses on greenwashing [28,35,36,37,39], sustainability reporting [52,53,54,55], and research integrating both topics [45]. To ensure comprehensive coverage of the research field, a thorough search was conducted using keywords that combined terms related to greenwashing and sustainability reporting.\n\nFirst, we created a list of terms describing greenwashing activities, which included the following keywords: “greenwash”, “green wash”, “green-wash*”, “decoupling”, “cheating”, “obfuscation”, and “deceptive”.\n\nSecond, given the diverse terminology used in extensive sustainability reporting research, a detailed search was conducted using keywords such as “sustainability report*/disclosure”, “sustainable development report*/disclosure”, “corporate social responsibility report*/disclosure”, “CSR report*/disclosure”, “responsib* report*/disclosure”, “ESG report*/disclosure”, “corporate citizenship report*/disclosure”, “triple bottom line report*/disclosure”, “TBL report*/disclosure”, “GRI report*/disclosure”, “Global Reporting Initiative report*/disclosure”, “sustainable development goal* report*/disclosure”, “SDG* report*/disclosure”, “integr* report*/disclosure”, “non-financ* report*/disclosure”, “environm* report*/disclosure”, “green report*/disclosure”, “GHG report*/disclosure”, “greenhouse gas report*/disclosure”, “carbon report*/disclosure”, and “social report*/disclosure”.\n\nThe list of query words and the combined query string used in this study are provided in Table A1 and Table A2 in the Appendix A.\n\nNext, we defined the inclusion and exclusion criteria for the review (Table A3 in the Appendix A). A study was considered eligible if the publication explicitly addressed the phenomenon of greenwashing in the context of sustainability reporting as a primary research topic. In addition, the study had to discuss greenwashing strategies or methods for measuring greenwashing that were grounded in content analysis of sustainability reporting. We also specified that each study must operationalize at least one dimension of greenwashing through content analysis of sustainability reports or other corporate disclosures containing ESG-related information.\n\nFor the exclusion criteria, we omitted publications not written in English, reflecting the dominance of English in scientific communication [56] and reducing language and translation bias [28,57]. We also excluded books, book chapters, editorial materials, meeting abstracts, and data papers, as these document types typically do not undergo a rigorous peer-review process that ensures the reliability and credibility of empirical findings [58]. This approach is standard in many SLRs [28,49]. A complete list of inclusion and exclusion criteria is provided in Table A3 in the Appendix A.\n\nThe search was conducted on 17 February 2025, utilizing the query string detailed in Table A2 in the Appendix A. After applying the initial exclusion criteria outlined in phase 1 (document type and language), 249 publications were identified in Scopus and 199 in WoS, resulting in a combined total of 448 records. Following the removal of 174 duplicate records from the two databases, the final dataset consisted of 274 unique publications. To organize key information throughout the process and to facilitate the identification and elimination of duplicates, we used a Microsoft Excel spreadsheet.\n\nIn the subsequent screening stage, the titles, abstracts, and keywords of the 274 publications were reviewed by two researchers (the co-authors) to assess their relevance to the\nstudy's objectives and determine eligibility for further analysis and data extraction. Each researcher independently screened all 274 publications to evaluate whether greenwashing in the context of sustainability reporting constituted the primary focus of the article. They also assessed whether the study involved an empirical examination of greenwashing in corporate reporting in line with the predefined scope of the review. Based on these criteria, each publication was classified as either “include” or “exclude.” In cases where a researcher—after reviewing the title, keywords, and abstract—was uncertain about whether a publication met the inclusion criteria, it was conservatively classified as “include” and was retained for full-text assessment in the next stage. To evaluate inter-rater (inter-coder) reliability for the binary inclusion/exclusion decision, the reviewers' assessments were compared and Cohen's kappa coefficient was calculated. Cohen's kappa coefficient was high (κ = 0.84; 95% CI: 0.78--0.91), indicating strong agreement between the two reviewers [59,60]. In cases where discrepancies between the researchers' decisions occurred, the publication was retained for full-text review in the next stage. As a result of this phase, 182 publications were retained for the research sample, while 92 were excluded as not relevant to the review's objectives. Full texts were subsequently retrieved for the 182 included studies. Only 4 publications could not be obtained. Additionally, 21 publications were identified through the snowballing method.\n\nIn the next stage, 178 publications identified through database searches and 21 additional publications identified via snowball sampling were subjected to in-depth full-text analysis. The same two researchers independently reviewed the full texts, applying inclusion criteria derived directly from the research questions: (1) the article discussed greenwashing strategies in the context of sustainability reporting as a central topic, or (2) the study presented and empirically applied at least one content-analysis-based approach to measuring greenwashing. Publications were excluded if greenwashing strategies or measurement approaches were addressed only tangentially, if no methods or approaches based on content analysis of sustainability reports or other ESG-related disclosures were presented or applied, or if all dimensions of greenwashing were operationalized exclusively through external ESG scores from global financial or non-financial data vendors. Inter-coder decisions were again compared, and Cohen's kappa was recalculated. Agreement for full-text eligibility reached 88% (95% CI: 0.81--0.95), indicating an almost perfect level of agreement [59,60]. In cases of disagreement, both researchers re-examined the publication, discussed their assessments, and reached a joint decision. Following this process, 88 publications were retained for further analysis (76 identified through database searches and 12 identified via snowball sampling).\n\nTo provide a clearer understanding of the process of searching and including publications in this review, the PRISMA 2020 flow diagram is presented in Figure 1.\n\nIn the final step of the SLR, a thematic content analysis was conducted to extract and synthesize data relevant to the research questions. A narrative synthesis approach was applied, combining systematic textual summarization with interpretive analysis of the findings, as appropriate given the objectives of this review [61,62]. Two researchers independently reviewed and coded the full texts of all publications to ensure the validity and reliability of the findings. A combined deductive--inductive coding strategy was used. At the deductive level, the coding framework was structured around two main thematic groups of studies, corresponding to the research questions: (1) articles addressing strategic typologies of greenwashing in sustainability reporting and (2) articles presenting and applying content-analysis-based approaches and analytical techniques for measuring greenwashing.\n\nWithin each thematic group, additional codes were developed inductively to capture recurring concepts and patterns emerging from the material. For studies classified in the first group (strategic typologies), we coded the following elements: authorship,\nSustainability 2026, 18, 17\n\nthe theoretical framework(s) used, research sample characteristics, and the characteristics of strategic approaches. For studies classified in the second group (measurement approaches), we coded the following elements: authorship, the measurement approach or analytical technique used, research sample characteristics, the type of data, the method of data acquisition, and the sustainability focus of the measurement (environmental, social, and/or governance).\n\n![img-0.jpeg](img-0.jpeg)\nFigure 1. PRISMA 2020 flow diagram for SLR of research on greenwashing in sustainability reporting. Source: Authors' elaboration based on [48].\n\nAll codes were documented in a shared Excel spreadsheet, which was used to organize, structure, and synthesize the extracted information and to compile Tables A4 and A5 in the Appendix A, providing a structured overview of the coded variables. Discrepancies\n\nhttps://doi.org/10.3390/su18010017\nin coding between the two researchers were resolved through discussion, and any agreed refinements of the coding scheme were applied consistently across all publications.\n\nFigure 2 presents the quantitative descriptive characteristics of the analyzed publications, while the following section reports the results of the qualitative content analysis for the two thematic groups. Detailed characteristics of the studies included in the SLR are provided in Table A4 and Table A5 in the Appendix A. It should be noted that some publications addressed both thematic areas (i.e. they proposed a strategic typology and, at the same time, developed or applied a content-analysis-based measurement approach).\n\nIn addition, to evaluate the methodological quality and transparency of the review process, the PRISMA 2020 checklist was completed, and compliance with its 27 reporting items was verified (Table S1 in the Supplementary Material).\n\n## 3.",
        "Results and Discussion\n\nThis section presents the main findings of the SLR on greenwashing in sustainability reporting. It synthesizes key strategic typologies, content-analysis--based measurement approaches, and analytical techniques used to identify greenwashing. By integrating theoretical, methodological, and empirical insights, the section elucidates how greenwashing has been conceptualized, operationalized, and evidenced across the extant literature.\n\n### 3.1. Strategic Typologies of Greenwashing in Sustainability Reporting\n\nResearch on strategic typologies of greenwashing in sustainability reporting primarily draws on legitimacy theory, impression management theory, signaling theory, and stakeholder theory.\n\nMost existing typologies are structured around a four-quadrant matrix but differ in the dimensions considered. Amores-Salvadó et al. [63] developed a model of four distinct strategic positions by comparing environmental performance and disclosure relative to industry averages. They identify two coherent approaches—green leaders and blackbirds—and two incoherent ones: green quiets (representing brownwashing) and green parrots (indicative of greenwashing). Kurpierz and Smith [64] refined Delmas and Burbano's [3] greenwashing typology by focusing on the truthfulness of claims (true/false) and their consequences (harm/no harm), thereby deconstructing greenwashing into a harm/no-harm dichotomy that differentiates between fraudulent practices and “cheap talk.” Cooper and Wang [65] analyzed the relationship between reported policy and activities addressing refugee needs. They categorized corporations into four types—reactionary,\nrecurring, relevant, and revelatory—based on the consistency of refugee programming over time and the degree of alignment between programs, policies, and impacts.\n\nIn another approach, strategic responses to institutional influences in sustainability reporting have been classified along a continuum from passive to active. Acquiescence represents the most passive strategy, manipulation the most active, while compromise, avoidance, and defiance fall in between [66].\n\nVarious typologies are derived from impression management theory. Talbot and Barbat [67] identified four impression management strategies in mining companies' CSR reports aimed at neutralizing and obscuring negative information on water performance. These include two data manipulation strategies—strategic omission and obfuscation—used to conceal noncompliance and poor performance, and two defensive strategies—minimizing environmental impact and relativizing poor environmental performance—employed to legitimize negative aspects. Leung and Snell [68] found that gambling companies use five camouflaging-based disclosure strategies—zero disclosure, curtailment, disclamation, defensive façades, and assertive façades—involving impression management to selectively maintain moral legitimacy amid shifting institutional expectations. Drawing on an analysis of communication strategies employed by Spanish listed companies regarding the SDGs, García-Sánchez et al. [69] revealed the use of legitimization strategy alongside proactive and defensive impression management approaches. The proactive approach focused on congratulation, self-promotion, and organizational promotion, while the defensive approach addressed negative situations through excuses, justifications, and apologies.\n\nIn the context of signaling theory and legitimization strategies, Hahn and Lülfs [70], drawing on the concepts of symbolic and substantive management of legitimacy, identified six specific strategies for disclosing negative aspects in sustainability reports: marginalization, abstraction, indication of facts, rationalization (instrumental and theoretical), authorization, and corrective action (type 1 and type 2). Saber and Weber [71] subsequently applied the same framework and typology. Yuan et al. [72] identified three distinct greenwashing strategies: exaggerating, referring to the gap between actual performance and disclosure; distracting, highlighting the gap between strengths and concerns; and window-dressing, addressing the gap between materiality and immateriality. Leung and Snell [73] further revealed that companies in controversial industries, such as gambling, often engage in symbolic manipulation rather than substantive CSR, aiming to alter perceptions of corporate identity by emphasizing pragmatic legitimacy, diverting attention from moral legitimacy issues, and manipulating cognitive symbols. Finally, Martínez-Ferrero et al. [74] found that companies with superior CSR performance tend to use high-quality CSR reporting to highlight achievements (enhancement strategy), offering more comparable and reliable information. In contrast, companies with poorer CSR performance often employ low-quality reporting to obscure actual performance (obfuscation strategy), providing information that is less balanced, accurate, and clear.\n\nWhile some researchers emphasize the exaggerated optimism in sustainability communications, others focus on the defensive strategies employed by companies. Laskin and Mikhailovna Nesova [26] demonstrated that sustainability reports are characterized by pronounced optimism, as they employ a higher frequency of positively charged linguistic elements—such as praise, satisfaction, and inspiration—while reducing the use of negatively charged expressions such as blame, hardship, and denial. Megura and Gunderson [75] identified subtle forms of climate change denial in the sustainability reports of fossil fuel companies, manifested as ideological denialism, greenwashing, and reification. Moreover, they observed various forms of greenwashing used to manipulate stakeholder perceptions within climate-related narratives, including techno-optimism, compliance,\ncountermeasures, and omission. Laufer [76] argued that companies use defensive strategies to protect themselves from liability, both internally and externally, with greenwashing relying on three key elements of deception: confusion, fronting, and posturing. Companies sometimes engage in strategic silence, with sustainability reports omitting concrete strategies for managing or curbing overproduction—a form of vagueness recognized as a signal of greenwashing [77]. Research by Roszkowska-Menkes et al. [9] identified the selective disclosure of negative events in sustainability reporting, manifested in three forms: vague disclosure, avoidance, and hypocrisy. In addition, Gentile and Gupta [78] identified several strategies adopted by leading global fossil fuel companies, including necessitarianism; greenwashing, manifested through claims of sustainability, strategic wording, overstated commitments, half-truths, the use of ‘net-zero' as a marketing label, and avoidance of critical issues (‘the elephant in the room'); strategic blame placement; and techno-optimism.\n\nConsidering how visual elements can be leveraged to influence CSR reports, Friedel [79] emphasized the strategic use of images and text and their impact on the perceived objectivity and construction of truth, highlighting how corporate myths are created and maintained to enhance organizational legitimacy. Additionally, Cho et al. [80] and Cüre et al. [81] investigated corporate manipulation of graphs in sustainability reporting and identified two impression management strategies—enhancement and obfuscation—evidenced by the selective presentation of graphical data emphasizing favorable trends and the inclusion of material distortions within the graphs.\n\nResearch shows that to assume that companies adopt uniform sustainability reporting strategies is a significant oversimplification. Moreover, ESG practices are driven by diverse motivations, including strategic, altruistic, and greenwashing-related incentives [82]. Schons and Steinmeier [10] argue that companies can adopt strategies that combine symbolic and substantive CSR actions. This means that some of them may choose not to engage in CSR at all—either symbolically or substantively—and then they are referred to as Neglectors. Other companies may decide to focus primarily on symbolic actions (Greenwashers), who follow a “mere talk” strategy, or on substantive actions (Silent Saints), who adopt a “mere walk” strategy. Finally, some companies may demonstrate high levels of both symbolic and substantive engagement, acting as Balanced Engagers who “walk the talk”. Siano et al. [12] argued that the simple distinction between talk and action is insufficient. Following the Volkswagen emissions scandal, they expanded the greenwashing taxonomy—originally encompassing decoupling and attention deflection—by identifying a new form of irresponsible behavior, namely “deceptive manipulation,” in which sustainability communication is deliberately used to manipulate actual business practices. Furthermore, Cho et al. [83] argued that more diverse and nuanced theoretical perspectives are needed to understand sustainability reporting, as conflicting societal and institutional pressures can force companies to engage in organizational hypocrisy by creating and maintaining discrepant façades, such as rational, progressive, and reputational.\n\nConsidering research on strategic typologies of greenwashing in sustainability reporting, most studies in this domain can be viewed as extending or complementing one another rather than offering contradictory insights. Apparent inconsistencies typically stem from scholars examining different dimensions of greenwashing—for instance, exaggerated optimism versus subtle forms of denial, or text-based versus visual communication strategies. Moreover, the literature has evolved from simple 2 × 2 typologies toward more sophisticated frameworks that either position strategic responses to institutional pressures along a passive--active continuum or conceptualize varying forms and degrees of obfuscation or deception.\nSustainability 2026, 18, 17\n\nTable 1 summarizes the strategic approaches and conceptual positions of greenwashing identified in sustainability reporting. A detailed description of the underlying studies is provided in Table A4 in the Appendix A.\n\nTable 1. Overview of Strategic Typologies of Greenwashing in Sustainability Reporting.\n\n|  Strategic Approaches and Positions of Greenwashing in Sustainability Reporting | Authors  |\n| --- | --- |\n|  ·Green leadership |   |\n|  ·Green quiets | Amores-Salvadó et al. [63]  |\n|  ·Green parrots  |   |\n|  ·Blackbirds  |   |\n|  ·Enhancement | Cho et al. [80]; Cure et al. [81];  |\n|  ·Obfuscation | Martínez-Ferrero et al. [74]  |\n|  ·Rational façade |   |\n|  ·Progressive façade | Cho et al. [83]  |\n|  ·Reputation façade |   |\n|  ·Reactionary |   |\n|  ·Recurring | Cooper and Wang [65]  |\n|  ·Relevant  |   |\n|  ·Revelatory  |   |\n|  ·Legitimization strategy |   |\n|  ·Proactive impression management strategy | García-Sánchez et al. [69]  |\n|  ·Defensive impression management strategy |   |\n|  ·Necessitarianism |   |\n|  ·Greenwashing (claiming sustainability, strategic word use, overstating commitment, half-truths, “net-zero,” avoiding the “elephant in the room”) | Gentile and Gupta [78]  |\n|  ·Strategic blame placement |   |\n|  ·Techno-optimism |   |\n|  ·Marginalization |   |\n|  ·Abstraction |   |\n|  ·Indicating facts | Hahn and Lülfs [70];  |\n|  ·Rationalization (instrumental and theoretical) | Saber and Weber [71]  |\n|  ·Authorization |   |\n|  ·Corrective action (type 1 and type 2) |   |\n|  ·Strategic silence on deadstock/overstock | Hejlova et al. [77]  |\n|  ·Acquiescence |   |\n|  ·Compromise |   |\n|  ·Avoidance | Khan et al. [66]  |\n|  ·Defiance |   |\n|  ·Manipulation |   |\n|  ·Fraudulent |   |\n|  ·“Cheap talk” | Kurpierz and Smith [64]  |\n|  ·Responsible |   |\n|  ·Vocal green |   |\n|  ·Positively charged linguistic strategies (praise, satisfaction, inspiration) |   |\n|  ·Negatively charged linguistic strategies (blame, hardship, denial) | Laskin and Mikhailovna Nesova [26]  |\n|  ·Confusion |   |\n|  ·Fronting | Laufer [76]  |\n|  ·Posturing |   |\n|  ·Pragmatic legitimacy strategy |   |\n|  ·Moral legitimacy strategy | Leung and Snell [73]  |\n|  ·Cognitive legitimacy strategy |   |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable 1. Cont.\n\n|  Strategic Approaches and Positions of Greenwashing in Sustainability Reporting | Authors  |\n| --- | --- |\n|  Zero disclosure strategy |   |\n|  Curtailment strategy |   |\n|  Disclamation strategy (type 1 and type 2) | Leung and Snell [68]  |\n|  Defensive façade strategy |   |\n|  Assertive façade strategy |   |\n|  Techno-optimism |   |\n|  Compliance | Megura and Gunderson [75]  |\n|  Countermeasures |   |\n|  Omissions (risk minimization, possibility blindness) |   |\n|  Strategic ESG motivation |   |\n|  Altruistic ESG motivation | Nguyen et al. [82]  |\n|  Greenwashing ESG motivation |   |\n|  Comprehensive disclosure of negative events |   |\n|  Selective disclosure (vague disclosure, avoidance and hypocrisy) | Roszkowska-Menkes et al. [9]  |\n|  Neglectors |   |\n|  Greenwashers (\"mere talk\" strategy) |   |\n|  Silent Saints (\"mere walk\" strategy) | Schons and Steinmeier [10]  |\n|  Balanced Engagers (\"walk the talk\" strategy) |   |\n|  Decoupling |   |\n|  Attention deflection | Siano et al. [12]  |\n|  Deceptive manipulation |   |\n|  Strategic omission |   |\n|  Obfuscation | Talbot and Barbat [67]  |\n|  Minimizing the environmental impact |   |\n|  Relativizing poor performance |   |\n|  Exaggerating |   |\n|  Distracting | Yuan et al. [72]  |\n|  Window-dressing |   |\n\n# 3.2. Approaches to Measuring Greenwashing in Sustainability Reporting Using Content Analysis 3.2.1. Disclosure-Performance Gap Approach\n\nOne of the main approaches used to measure greenwashing in sustainability reporting focuses on the discrepancy between sustainability disclosure (D) and actual sustainability performance (P). Within this framework, researchers quantify ESG disclosure (i.e., what companies communicate about their sustainability actions) separately from ESG performance (i.e., what companies actually achieve). Greenwashing is thus conceptualized as the difference, imbalance, or misalignment between these two constructs. This approach builds on the \"talk-walk gap\" perspective, which assumes that companies may deliberately overstate their sustainability commitments when actual performance fails to support the communicated narrative.\n\nIn accordance with the inclusion criteria adopted in this review, the analyzed sample consists exclusively of studies in which at least one component of greenwashing measurement—disclosure and/or performance—is derived from content analysis of sustainability-related reports. While content analysis is most frequently applied to capture the scope and characteristics of sustainability disclosure [1,11,23,84-94], the sample also includes studies in which both disclosure and performance measures are extracted from sustainability report content and subsequently coded using predefined analytical schemes [95-99].\n\nVarious methods have been employed to quantify sustainability disclosure. The most prevalent approach involves counting the frequency of environmental (E), social (S), and governance (G) keywords and normalizing these counts by the total word count of sustainability reports [23,84,88]. Some studies further refined this approach by weighting ESG terminology according to its contextual relevance or importance [86,97-99], or by assigning differentiated weights to monetary, quantitative, and purely narrative statements\n\nhttps://doi.org/10.3390/su18010017\nto assess disclosure precision, with financial data considered the most credible form of evidence [1]. Some studies have used advanced natural language processing techniques to quantify ESG disclosures, combining content extraction with sentiment analysis [87,91,92,93,94].\n\nBeyond quantitative text metrics or sentiment indicators, several studies operationalized disclosure through checklist-based assessments, identifying the presence or absence of specific sustainability elements, typically coded in binary form [11,85,89,90,95,96]. In addition, environmental disclosure has also been quantified using self-reported environmental data submitted to external registries, treating reported quantities as indicators of environmental transparency [7,100].\n\nIn the reviewed studies, sustainability performance was most frequently quantified using external ESG scores provided by established global financial and non-financial data vendors, including Bloomberg [1,85,91], Refinitiv (now LSEG Data) [23], MSCI KLD STAT [11,93], CNRDS [88,92], HEXUN-RKS [90,94] and KOSPI200 [86]. Lagasio [87] also employed a normalized ESG score to assess greenwashing, although the data source for this metric was not explicitly specified. In several studies, environmental performance indicators were obtained directly from external operational data registries, most commonly from greenhouse gas (GHG) emissions reported to regulatory authorities and environmental agencies [7,89,100].\n\nIn the remaining group of studies, ESG performance was derived through content analysis of sustainability reports. These studies constructed checklist-based assessments of indicators aligned with the Global Reporting Initiative (GRI) framework or specific ESG actions. Quantitatively verified practices were distinguished from qualitative descriptions, with greater weight assigned to evidence supported by measurable or verifiable data [84,95,96,97,98,99].\n\nAn overview of methods used to operationalize ESG disclosures and performances is presented in Table 2.\n\nIn the analyzed studies, greenwashing is primarily conceptualized as the discrepancy between companies' communicated sustainability claims and their actual sustainability performance. Accordingly, empirical measurement typically relies on discrepancy-based indicators, expressed either as the difference between ESG disclosure levels and ESG performance levels [1,88,90] or as the ratio of disclosed ESG items to implemented sustainability actions [23].\n\nMore advanced studies develop customized indicators that integrate cognitive and linguistic dimensions of sustainability communication. For instance, Kim et al. [86] define greenwashing as the difference between text-weighted ESG disclosure scores—which capture the depth and materiality of sustainability language—and ESG performance. Kim and Lyon [7] measure greenwashing as the deviation between declared and actual emission reductions, normalized by declared reduction levels to control for firm-size effects. Similarly, Lagasio [87] constructs an “ESG-washing” metric by subtracting standardized sustainability performance scores from sentiment-based ESG disclosure indices. Lee and Raschke [23] compute the ratio of textual ESG performance communication to standardized Refinitiv ESG scores to capture the communicative exaggeration of performance. Li et al. [96] likewise calculate greenwashing as the discrepancy between standardized indices of green communication (GCI) and green practices (GPI), reflecting overstated communication relative to actual initiatives. Finally, Zhou and Chen [97] and Zhou et al. [98,99] operationalize greenwashing as the standardized disparity between weighted textual disclosure indices and quantified environmental performance indicators, offering a multidimensional representation of disclosure--performance misalignment.\nSustainability 2026, 18, 17\n\nTable 2. Methods for Operationalizing Greenwashing in Sustainability Reporting through the Disclosure-Performance Gap.\n\n|   | Type of Method | Author  |\n| --- | --- | --- |\n|  Methods used to operationalize sustainability disclosure | Checklist-based score of environmental/sustainability disclosure | Cormier and Gomez-Gutierrez [85]; Du et al. [95]; Li et al. [96]; Tashman et al. [11]; Wedari et al. [89]; Zahid et al. [90]  |\n|   |  Keyword-frequency-based disclosure measurement | Coen et al. [84]; Lee and Raschke [23]; Song and Chen [88]  |\n|   |  Weighted textual precision scoring (quality-weighted disclosure) | Kim et al. [86]; Ruiz-Blanco et al. [1]; Zhou and Chen [97]; Zhou et al. [98]; Zhou et al. [99]  |\n|   |  Sentiment-based disclosure measurement using NLP | Chen and Ma [91]; Chen et al. [92]; Lagasio [87]; Sauerwald and Su [93]; Zhang [94]  |\n|   |  Externally reported environmental disclosure indicators | Kim and Lyon [7]; Kim and Lyon [100]  |\n|  Methods used to operationalize sustainability performance | External ESG ratings/sustainability scores | Chen and Ma [91]; Chen et al. [92]; Cormier and Gomez-Gutierrez [85]; Kim et al. [86]; Lee and Raschke [23]; Lagasio [87]; Ruiz-Blanco et al. [1]; Sauerwald and Su [93]; Song and Chen [88]; Tashman et al. [11]; Zahid et al. [90]; Zhang [94]  |\n|   |  Environmental performance indicators derived from external databases | Coen et al. [84]; Kim and Lyon [7]; Kim and Lyon [100]; Wedari et al. [89]  |\n|   |  Checklist-based scoring of environmental/sustainability performance evidence | Du et al. [95]; Li et al. [96]; Zhou and Chen [97]; Zhou et al. [98]; Zhou et al. [99]  |\n\nIn summary, methods for measuring greenwashing through content analysis of sustainability disclosures and performance consistently draw on the notion of the \"talk-walk gap,\" but operationalize it in different ways, thus yielding different analytical insights. Checklist-based indices provide transparency and close alignment with reporting standards but are highly labor-intensive and limited in scalability. Keyword-frequency approaches offer strong scalability but primarily measure the volume of ESG communication, which can lead to inflated perceptions of disclosure quality. More advanced approaches—such as quality-weighted metrics, sentiment analysis, and broader NLP techniques—more effectively capture discrepancies between communication and actual performance, but they require specialized tools and expertise, and their outputs may diverge from those produced by simpler measures. On the performance side, ESG ratings, hard ESG indicators, and checklist-based indices capture distinct facets of sustainability, resulting in varying assessments of the same companies. ESG ratings face additional challenges due to methodological opacity, dependence on corporate disclosures, and inconsistency across providers. Overall, the evidence suggests that disclosure and performance measures should be viewed as complementary: differences between them reflect the multidimensional nature of greenwashing rather than measurement error.\n\n# 3.2.2. Symbolic and Substantive Disclosure Approach\n\nThe second methodological approach conceptualizes greenwashing as the distinction between symbolic and substantive sustainability disclosures, determined by the credibility, specificity, and verifiability of the information provided. Within this framework, it is assumed that companies may use sustainability rhetoric as a means of gaining legitimacy by emphasizing broad commitments or aspirational claims that are not substantiated by verifiable actions, measurable outcomes, or tangible resource allocations. Consequently,\n\nhttps://doi.org/10.3390/su18010017\ncontent analysis of sustainability reports is used to identify the nature of corporate sustainability activities, classify them as symbolic or substantive, and assess the potential imbalance between these two dimensions in sustainability reporting. From this perspective, greenwashing is operationalized as a predominance of symbolic content over substantive information [101,102,103]. However, it should be emphasized that symbolic communication should not, in all contexts, be treated as synonymous with greenwashing. It constitutes greenwashing only when it systematically substitutes for or obscures substantive information, rather than when it coexists with reliable, performance-based disclosure [6,30,103,104].\n\nSymbolic actions (often referred to as green talk) occur when a company makes claims or discloses information about social or environmental initiatives that are not actually implemented in practice [24]. Such symbolic disclosures tend to be broad, predominantly positive, and typically lack measurable evidence or verifiable outcomes. In contrast, substantive actions (green walk) refer to disclosures describing initiatives that have been materially implemented and have produced tangible, verifiable impacts. In other words, whenever a company provides detailed and evidence-based information about a specific action, or when the accuracy of its claims can be verified, the disclosure is considered substantive [24].\n\nAlthough the symbolic--substantive distinction is the most widely used conceptualization in the literature, several authors employ alternative terminology to describe comparable phenomena. For example, Khan et al. [104] differentiate between cosmetic and organic efforts, where cosmetic efforts rely on rhetorical strategies and attention-grabbing narratives that superficially frame positive environmental performance, whereas organic actions reflect credible and meaningful initiatives supported by concrete evidence. Xing et al. [102] distinguish between soft and hard sustainability disclosures, with soft disclosures referring to claims without strong objective evidence, typically compiled by companies themselves, and hard disclosures based on quantitative data that can be verified by other institutions. Despite the different terminology, these studies share a common assumption: symbolic communication reflects declarative or aspirational expressions of commitment, while substantive actions provide verifiable evidence of actual progress towards sustainability.\n\nOur SLR revealed that most authors applied checklist-based classification schemes to distinguish between symbolic and substantive sustainability actions. This method relies on predefined lists of sustainability-related issues or actions, where each disclosed item is coded as symbolic or substantive depending on its level of detail, quantification, and verifiability. For example, Xing et al. [102] developed a checklist consisting of 16 soft and 79 hard disclosure items, representing narrative versus evidence-based information. Khan et al. [104] constructed a checklist of 14 items assessing the reliability (organic actions) and relevance (cosmetic actions) of information presented in sustainability reports. Li et al. [101] identified 8 elements characterizing symbolic actions and 6 describing substantive ones. Van der Ploeg and Vanclay [6] employed a ten-question checklist to assess whether reports provided balanced information, including negative environmental impacts, arguing that a high proportion of descriptive over data-supported disclosures indicates potential symbolic legitimation strategies. Zhang et al. [105] proposed a checklist of 19 environmental disclosure items, specifying criteria for classifying each disclosure or corporate activity as symbolic or substantive. Subsequently, Zhang et al. [106] expanded this framework to 22 indicators, while Zhang et al. [107] further incorporated additional evidence such as certifications and quantified environmental achievements. Similarly, Xu et al. [103] applied a 17-item checklist addressing the readability, reliability, and completeness of sustainability disclosures, defining explicit criteria for categorizing statements as symbolic or substantive.\n\nA slightly different approach to classifying corporate sustainability actions as symbolic or substantive was proposed by Costa et al. [108]. The authors employed the Global\nSustainability 2026, 18, 17\n\nReporting Initiative (GRI) framework to identify and categorize disclosure indicators. Based on these standards, they developed a checklist of GRI indicators and subsequently evaluated each disclosure item in sustainability reports to determine whether it was presented in a narrative (symbolic) form or as verifiable quantitative or performance-based (substantive) information.\n\nIn several studies, a linguistic-textual classification was applied to distinguish between symbolic and substantive sustainability actions. For example, Khalil and O'Sullivan [24] differentiated between the two by examining the linguistic structure of ESG narratives, including the number of sentences and words related to environmental and social topics, under the assumption that a higher proportion of symbolic expressions indicates a greater likelihood of greenwashing. Similarly, Huq and Carling [30] utilized natural language processing (NLP) techniques to quantify the number of substantive greenhouse gas (GHG) disclosures included in sustainability reports, interpreting a low proportion of evidence-based statements as indicative of symbolic reporting and potential greenwashing.\n\nAn overview of methods used for operationalizing greenwashing in sustainability reporting based on symbolic and substantive dimensions is presented in Table 3.\n\nTable 3. Methods for Operationalizing Greenwashing in Sustainability Reporting Based on Symbolic and Substantive Dimensions.\n\n|  Type of Method | Author  |\n| --- | --- |\n|  Checklist-based manual classification | Khan et al. [104]; Li et al. [101]; Van der Ploeg and Vanclay [6]; Xing et al. [102]; Xu et al. [103]; Zhang et al. [105]; Zhang et al. [106]; Zhang et al. [107]  |\n|  GRI-indicator-based classification | Costa et al. [108]  |\n|  Linguistic-textual classification | Huq and Carling [30]; Khalil and O'sullivan [24]  |\n\nOur analysis indicates that, within this group of studies, greenwashing was most frequently quantified as the discrepancy between symbolic and substantive sustainability disclosures [101,102,105,108] or as the ratio of symbolic to substantive elements in sustainability reporting [103,106,107]. Some researchers examined this phenomenon indirectly through disclosure quality indicators, where a greater emphasis on relevance (cosmetic efforts) relative to reliability (organic efforts) was interpreted as indicative of symbolic reporting and potential greenwashing [104]. Other studies identified greenwashing through the dominance of symbolic disclosures over substantive ones [24,30], or by observing a prevalence of declarative statements (symbolic actions) over verifiable data (substantive actions) [6]. Collectively, these findings suggest that symbolic sustainability communication not supported by verifiable progress may serve as a deliberate impression management strategy, representing greenwashing in corporate sustainability reporting.\n\nAlthough all methods aim to detect the gap between symbolic and substantive disclosures, they operationalize this gap differently. Manual approaches provide detailed, context-sensitive assessments but are highly time- and resource-intensive. Automated methods (e.g., NLP, text mining) enable large-scale analysis and efficient analysis but may overlook subtle linguistic and contextual nuances. These approaches are therefore best seen as complementary: manual coding can be used to train and validate automated tools, thereby combining interpretive accuracy with computational scale. The optimal method ultimately depends on research objectives and resource constraints—automated techniques are well suited for large cross-sectional studies, whereas manual checklists are preferable for in-depth analyses of individual reports or small samples.\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\n# 3.2.3. Selective and Manipulative Disclosure Approach\n\nA third approach to measuring greenwashing in sustainability reporting focuses on how companies present ESG-related information. Within this research stream, greenwashing is operationalized through the detection of selective disclosures and expressive manipulation of the content of sustainability reports. Selective disclosure is defined as a company intentionally emphasizing positive ESG achievements while omitting or downplaying negative aspects of its operations [109-114]. Expressive manipulation, on the other hand, involves using a promotional tone, emotional language, or biased narrative to influence stakeholder perceptions and create a favorable, yet potentially misleading, impression of the company's actual ESG activities and performance [111,112].\n\nOur SLR revealed that selective disclosure and expressive manipulation were most commonly identified using checklist-based manual coding, in which ESG topics were classified as disclosed or omitted and further distinguished as symbolic or substantive. In these studies, selective disclosure was typically measured as the proportion of omitted ESG items relative to the total number of expected disclosures, while expressive manipulation was quantified as the ratio of symbolically disclosed items to all disclosed items [106,107] or as the ratio of symbolic to substantive disclosure elements [115]. The overall greenwashing level was often computed as the geometric mean of the selective disclosure and expressive manipulation levels [115-117].\n\nOther researchers applied rubric-based coding frameworks, using author-designed diagnostic questions [109] or custom indicators [118] specifically developed to detect narrative exaggeration, unverifiable claims, and selective omission of sustainability information.\n\nAnother method for detecting greenwashing applies GRI-indicator-based manual coding, in which disclosures are classified as \"good news,\" \"neutral news,\" or \"bad news,\" and companies are subsequently evaluated on whether they systematically downplay or omit unfavorable information while emphasizing positive disclosures [110].\n\nSelective disclosure and expressive manipulation have also been examined using linguistic-textual methods. These methods relied on keyword frequency analysis and sentiment analysis to detect inflated positive language and patterns of symbolic communication [112,113]. They also combined lexicon-based techniques with stylistic and syntactic coding to capture narrative tone and discursive bias [111]. Finally, Yu et al. [114] applied a computational similarity-based method, demonstrating that templated sustainability statements with high textual similarity scores indicate generic and repetitive disclosure practices intended to obscure substantive performance.\n\nAn overview of methods used for operationalizing greenwashing in sustainability reporting based on selective and manipulative disclosure is presented in Table 4.\n\nTable 4. Methods for Operationalizing Greenwashing in Sustainability Reporting based on Selective and Manipulative Disclosure.\n\n|  Type of Method | Author  |\n| --- | --- |\n|  Checklist-based manual coding | Cao et al. [116]; Huang et al. [115]; Huang et al. [117]  |\n|  Custom rubric-based manual coding | Makrenko et al. [118]; Pimonenko et al. [109]  |\n|  GRI-indicator-based manual coding | Zharfpeykan [110]  |\n|  Linguistic-textual coding | Fiandrino et al. [111]; Gorovaia and Makrominas [113]; Yu et al. [114]; Zhu et al. [112]  |\n\nIn summary, selective and manipulative measurement approaches share a common conceptualization of greenwashing—emphasizing positive information while omitting negative information—but differ in how they quantify the phenomenon and in their sensitivity to detecting it. Checklist-based methods offer transparent assessments of selective\n\nhttps://doi.org/10.3390/su18010017\ndisclosure and symbolic claims but are difficult to scale. Linguistic and NLP-based methods capture rhetorical cues such as tone, readability, and narrative patterns, though their accuracy depends on model quality and may produce results that diverge from checklist-based evaluations. Consequently, the literature increasingly views these methods as complementary: measuring both what is disclosed and how it is disclosed provides distinct yet mutually reinforcing insights into the multidimensional nature of greenwashing.\n\n### 3.3. Analytical Techniques for Detecting Greenwashing in Sustainability Reporting Using Content Analysis\n\n### 3.3.1. Detecting Greenwashing in Sustainability Reporting Through Tone Analysis\n\nAn expanding line of research examines how the tone of sustainability reporting—captured through linguistic and sentiment cues—functions as a proxy for detecting greenwashing.\n\nBased on Diction 6.0, Fisher et al. [119] analyzed six forms of tone—positivity, activity, optimism, certainty, realism, and commonality—as potential measures of obfuscation in corporate narratives. However, they found no evidence that tone was used for obfuscation; instead, they observed the opposite effect. In contrast, Esterhuyse and du Toit [120] examined narrative tones (certainty, optimism, activity, realism, and commonality) in large multinationals' human rights disclosures using Diction 7.1.3. They found that low-disclosure companies disproportionately relied on an optimistic tone—particularly using terms denoting satisfaction and inspiration—thereby signaling assertive impression management strategies. Drawing on the AFINN dictionary for word-level sentiment classification, García-Sánchez [69] also identified the use of impression-management practices in sustainability communication strategies.\n\nAdopting a slightly different approach, Zharfpeykan [110] assessed Australian companies' environmental and social disclosures, ranging from omission to fully quantified reporting of positive, negative, or neutral news, including violation-versus non-violation-related information. The study found that companies tended either to report representatively (balancing favorable and unfavorable items) or to engage in greenwashing by downplaying high-impact negatives while emphasizing less relevant positives. Using standard natural-language processing techniques, Gorovaia and Makrominas [113] applied supervised sentiment analysis (positive/neutral/negative) to examine how a CSR report's environmental score—defined as a text-based measure of environmental emphasis—relates to positivity metrics, thereby evaluating two greenwashing mechanisms: decoupling and attention deflection. Martínez-Ferrero et al. [74] further demonstrated that companies with the worst CSR performance, when using an obfuscation-based disclosure strategy, provide less balanced reports that emphasize overly optimistic content. In addition, Conrad and Holtbrügge [121] showed that decoupling companies use fewer emotional",
        "references, more self-references, and fewer mentions of risk and anxiety, while relying more heavily on masculine-coded language.\n\nSome studies restrict their analysis to counts of positive and negative words, thereby suggesting that an overly optimistic tone may indicate greenwashing [122]. Building on Huang et al. [123], Hamza and Jarboui [124] employed a more elaborate method, assessing tone management in French companies' sustainability reports by counting positive and negative terms using the French version of Linguistic Inquiry and Word Count dictionary. They decomposed tone into a normal component, reflecting neutral descriptions, and an abnormal component, indicating the strategic use of tone management to inform or mislead stakeholders. Liao et al. [125] adopted a similar approach, analyzing the net positive tone of ESG reports (based on positive and negative dictionary of Tsinghua University) by Chinese listed companies and arguing that companies that “talk more and work less” engage in tone management—i.e. greenwashing. Liang and Wu [126] also applied this approach, using the “Bag of Words” method and textual analysis of CSR reports from Chinese listed\ncompanies, and suggested that companies may engage in greenwashing through the use of an abnormally positive tone in their CSR disclosures.\n\nAn alternative approach was proposed by Chen and Ma [91], who used the Term Frequency--Inverse Document Frequency algorithm and derived an “ESG greenwashing tone” from the frequencies of positive and negative emotion words and assessed greenwashing as the discrepancy between that tone and the firms' ESG performance. Chen et al. [92] similarly computed decoupling as the difference between an ESG report's optimistic tone—estimated using the Loughran--McDonald lexicon—and actual ESG performance, with both quantities standardized to z-scores, such that larger values indicate greater decoupling. A similar approach was employed by Sauerwald and Su [93] and Zhang [94], who linked the optimistic tone of CSR-reports to corporate social performance; however, Zhang [94] cautioned that relying on the tone--performance gap as a proxy for CSR decoupling has notable limitations.\n\n### 3.3.2. Detecting Greenwashing in Sustainability Reporting Through Readability Analysis\n\nReadability analysis of sustainability reporting aids in detecting greenwashing by examining sentence length, word complexity, jargon use, and overall clarity, which may reveal when complex or technical wording is strategically employed to obscure weak CSR performance. Some studies treat greenwashing and report readability as distinct constructs yet find a significant negative association, indicating that lower readability corresponds to higher levels of greenwashing [127]. However, several studies directly infer greenwashing and obfuscation from the readability metrics in sustainability reports.\n\nLiao et al. [125] suggested that companies engage in greenwashing of ESG reports by “talking more and doing less,” as evidenced by textual analysis of ESG-related word frequencies relative to overall report length (based on Loughran--McDonald's word list). A study by Esterhuyse and du Toit [120] revealed that low-disclosure companies engaged in obfuscation by reducing report readability, as measured by the Flesch Reading Ease Index, which accounts for average sentence length and syllables per word. Using the same index and based on the Textstat library, Gorovaia and Makrominas [113] quantified the readability of CSR reports and interacted it with the environmental score to examine greenwashing mechanisms. In turn, Fabrizio and Kim [128] analyzed voluntary responses to CDP's Climate Change Survey to investigate linguistic obfuscation in environmental disclosures, using the Lingua::EN::Fathom package in Perl and the Gunning Fog Index to measure text complexity based on syllables per word and words per sentence. Martínez-Ferrero et al. [74] showed that companies with poor CSR performance employ obfuscation strategies by producing longer, less readable reports containing less accurate and transparent information. They assessed report accuracy and clarity using metrics such as the total number of pages and words, the ratio of numerical characters to total characters and words, and highlighted that “soft” information (text) is more cognitively demanding to process than “hard” information (numbers).\n\nSome studies use multiple metrics to assess the readability of sustainability reports. For example, Fisher et al. [119] analyzed corporate accountability disclosures using Flesch Reading Ease as the primary index, complemented by the Flesch--Kincaid, SMOG, and Gunning Fog. Similarly, Nazari et al. [129] applied a comprehensive set of readability and disclosure-size measures—Flesch Reading Ease, Flesch--Kincaid Grade Level, Gunning Fog, Coleman--Liau, SMOG, and the Automated Readability Index—and found that shorter, less readable CSR disclosures were associated with poorer CSR performance, thereby suggesting the presence of greenwashing. Nilipour et al. [130] found that longer sustainability reports tend to have lower readability scores. Drawing on the ReadablePro online readability tool and using five readability indices (Flesch-Kincaid, Gunning Fog, Coleman-Liau,\nSMOG, and Automated Readability Index), they suggested that information overload and reduced readability may serve to obfuscate negative information. Wang et al. [25] suggested that companies with poor CSR performance may engage in greenwashing by employing complex language to produce vague reports, thereby minimizing the risk of adverse stakeholder reactions. To assess the readability of CSR reports, they applied three indices--Fog, Flesch, and Kincaid--to evaluate the overall difficulty of comprehension.\n\nIn a slightly different approach, Conrad and Holtbrügge [121] used Linguistic Inquiry and Word Count software (LIWC2015) to analyze morphology, syntax, semantics, and pragmatics in sustainability reports, finding that decoupling companies employ less cognitively complex language and exhibit lower linguistic sophistication. Using the same software, Corciolani et al. [131] measured analytical and authentic language in CSR reports and showed that greater involvement in corporate social irresponsibility is associated with more narrative (as opposed to analytical) and more deceptive (as opposed to authentic) language.\n\nIt should also be noted that, using machine learning and text analysis, Pan et al. [132] identified an inverted U-shaped relationship between environmental performance feedback and the readability of CSR reports among Chinese SMEs. In this case, readability was operationalized using a word2vec CBOW model trained on CSR reports to predict target words from their surrounding context.\n\n### 3.3.3. Detecting Greenwashing Through Visual Imagery Analysis\n\nConsidering how visual elements can be leveraged to influence sustainability reporting, Friedel [79]—in one of the first studies in this field—argued that the strategic use of imagery in CSR reports, such as depictions of Indigenous bodies and landscapes, was designed to alleviate public concerns about the environmental impacts of fossil fuel production and may represent a distinct form of greenwashing. Hrasky [133] examined the number, size, and types of graphs and photographs related to the three dimensions of sustainability—economic, social, and environmental. The analysis revealed that sustainability-oriented companies used fewer photographs and relied more on quantitative data presented in graphical form within sustainability reports to highlight measurable impacts. In contrast, less sustainable companies pursued symbolic legitimacy, using imagery lacking concrete action as a greenwashing tool in sustainability communication with stakeholders. Cho et al. [80] identified the enhancement strategy by examining whether a significantly larger proportion of graphed items in sustainability reports displayed favorable trends. Additionally, they assessed obfuscation by identifying graphical distortions that presented favorable information, thereby serving as tools for impression management. A similar approach was adopted by Cüre et al. [81] to identify enhancement and obfuscation as impression-management strategies, analyzing graphs with both favorable and unfavorable trends and detecting visual distortions used to manipulate perception.\n\n### 3.3.4. Evidence of Real Greenwashing\n\nWhile the existing greenwashing literature predominantly addresses alleged or theoretical cases, only a small subset examines instances that have been empirically verified.\n\nExamining the Deepwater Horizon oil spill, Mobus [134] analyzed BP's pre-crisis CSR disclosures on environmental and safety performance, thematic trends in newspaper coverage during the crisis, and post-crisis findings on contributing conditions, thereby demonstrating the risks of relying on self-reported sources that provide strong incentives to emphasize favorable information while omitting adverse details. Du [135] used the Greenwashing Identification Committee's list—published by South Weekend, one of China's most influential newspapers—to detect greenwashing, thereby demonstrating that this list can serve as an empirical verification tool for confirmed cases. Using content analysis and\ncomparative evaluation of CSR reports against external data on Foxconn, Noronha and Wang [13] identified a disclosure--performance gap attributed to greenwashing. This gap stemmed from selectively highlighting positive aspects while omitting negative social performance details, particularly in cases involving incomplete disclosure and non-compliance with reporting guidelines. Analyzing the Volkswagen emissions scandal, Siano et al. [12] compared the Volkswagen Group's CSR reports with media coverage exposing the “Dieselgate” controversy—representing the public revelation of greenwashing—and identified false claims and deliberate manipulation within these reports. Contreras-Pacheco and Claasen [136] identified clear signals of fuzzy reporting as a form of greenwashing. They examined the environmental disaster through events before, during, and following the incident, focusing on the company's disclosure practices, and found that the firm adapted its narrative over time to align with changing stakeholder expectations. In a related vein, Roszkowska-Menkes et al. [9] identified forms of selective disclosure by analyzing companies involved in severe controversies and assessing whether, and to what extent, these controversies and their associated negative events were reported in sustainability disclosures. Corciolani et al. [131], analyzing evidence of negative impacts on human rights, demonstrated how the language of CSR reports can be strategically used to offset companies' involvement in corporate social irresponsibility (CSIR). Finally, Gorovaia and Makrominas [113] analyzed how penalized environmental violations influence CSR report readability and sentiment, observing that violating companies tend to adopt a more assertive and overly positive tone while disclosing larger volumes of environmental information—resulting in reports that are more extensive yet less readable.\n\n### 3.3.5. Oversimplified Assumptions of Greenwashing in Sustainability Reporting\n\nIn our opinion, some studies are built on assumptions that oversimplify the detection of greenwashing in sustainability reporting.\n\nSome scholars assume that merely issuing CSR reports by companies with poor corporate social performance—or exhibiting a low degree of conformity with the GRI Sustainability Framework and Standards—constitutes evidence of greenwashing, consistent with a symbolic management approach [137]. In this context, Karaman et al. [138] argued that the presence of greenwashing tendencies in the energy sector could be dismissed, as companies with superior CSR performance were more likely to issue CSR reports. Similarly, Koseoglu et al. [139] found that high-performing companies in the hospitality and tourism industry were more likely to publish CSR reports, adopt the GRI framework, and obtain external assurance—thereby providing grounds for rejecting the greenwashing hypothesis in that sector. Mahoney et al. [140] posited—consistent with a signaling theory perspective—that stronger CSR performers issue reports to signal genuine commitment to sustainability, whereas weaker performers use them to project an image of responsibility despite poorer records, thereby engaging in greenwashing. However, it should be noted that none of these three studies employed content-analysis-based methods, which limits their ability to directly assess communicative or linguistic indicators of greenwashing.\n\nTaking into account other studies that, in our view, also oversimplify greenwashing detection in sustainability reporting, Lewis [141] argued that multinational corporations may be accused of greenwashing if they either omit any discussion of their supply chain's environmental impact or report on it only at the level of values and goals, without providing substantive or verifiable details. Additionally, drawing on an assessment of the quality of sustainability disclosures among Australian companies, Zharfpeykan and Akroyd [142] argued that companies tend to adopt greenwashing strategies when the quality of disclosures on material issues either declines or fluctuates—patterns suggesting attempts to obscure weak social and/or environmental performance.\n4.",
        "Directions for Future Research\n\nOur SLR reveals significant research gaps and unresolved questions that can guide future investigations. While previous studies have provided valuable insights, several areas remain underexplored and warrant more rigorous scholarly attention.\n\nOverall, adopting a mixed-methods approach that integrates qualitative and quantitative techniques is crucial. It enhances methodological rigor, captures the multifaceted nature of greenwashing analysis, and addresses the lack of qualitative depth inherent in purely quantitative designs.\n\nThe analyzed studies indicate that companies may adopt diverse—and often mixed—greenwashing strategies in sustainability reporting, ranging from purely symbolic to substantive actions, or combinations of both. However, existing research frequently over-simplifies these practices, limiting our understanding of how greenwashing manifests across different strategic approaches [10]. Future studies should address this gap by systematically aligning narrative disclosures with verified performance metrics using supervised machine-learning methods, and by employing longitudinal or case-based designs to trace strategic combinations, shifts, and manipulative practices over time. Despite substantial progress in conceptualizing strategic typologies of greenwashing—ranging from distinctions between symbolic and substantive legitimacy management [70] to impression-management frameworks such as enhancement and obfuscation [80,81] or deceptive manipulation [12]—the literature continues to focus predominantly on observable communications and reporting artifacts. It pays less attention to internal organizational processes that generate them. Much of the current understanding derives from textual, visual, or case-based inferences [26,67,74], making it difficult to link specific communicative approaches to concrete decision-making rules within companies. Future research should therefore combine primary data, governance documents, and assurance workpapers to trace how corporate “talk” is generated, by whom, and for what purposes. It should also aim to develop validated tactic-to-signal dictionaries that connect internal routines with external reporting outcomes. Another notable gap concerns the under-measurement of silence. While existing typologies richly describe what companies disclose—for example, camouflaging strategies in controversial industries [68,73]—they are less effective at identifying greenhushing, or strategic nondisclosure, which often escapes text-based analyses. Studies documenting defensive legitimation and denial frames [75,76] suggest that the boundary between selective speech and deliberate silence is blurred; yet, systematic measures of omission remain scarce. Future research should therefore model disclosure decisions at the margin—examining what is omitted and why—by combining anonymous managerial surveys with gap analyses between internal practices and external reporting. Existing research predominantly focuses on listed companies in developed markets, often within single industries or national contexts [67,68,73], whereas evidence on small and medium-sized enterprises (SMEs) and companies in emerging economies remains limited. Strategic frameworks explicitly distinguish between “talk” and “walk” [10] or classify disclosure--performance consistency [63,64,65], highlighting substantial heterogeneity across organizational and institutional contexts. Comparative research designs should therefore investigate how specific constraints—such as reporting costs, liability risk, and supply-chain opacity—influence the selection of disclosure tactics, particularly in sectors where hidden trade-offs are most prevalent. In addition, causal evidence regarding the mechanisms that effectively curb greenwashing remains limited. The existing literature often posits that assurance or regulatory pressure can discipline reporting practices [72]; however, robust empirical tests—particularly those distinguishing between limited and reasonable assurance, or between in-scope and out-of-scope emissions—remain scarce. This includes investigating how greenwashing practices and stakeholder perceptions evolve over time\nand across regulatory contexts. The field would benefit from applying quasi-experimental designs such as difference-in-differences or interrupted time-series approaches, leveraging changes in assurance coverage or regulatory adoption. These should be combined with hybrid human--large language model (LLM) coding frameworks capable of capturing both linguistic and visual dimensions of disclosure tactics. The growing use of LLM-assisted writing introduces both risks and opportunities. Generative tools may homogenize tone, amplify optimism bias in corporate sustainability discourse [26], and reinforce identity-management effects [73]. Conversely, when coupled with transparent codebooks, human adjudication, and validation against objective outcomes, these tools can also enhance the detection of greenwashing. Advancing from proxy-based measures to ground-truth evidence will require the creation of labeled repositories containing report excerpts, graphics, and internal artifacts. Such datasets would enable predictive tests linking specific reporting approaches to subsequent organizational or environmental outcomes.\n\nRecent studies increasingly measure greenwashing through content analysis by examining discrepancies between corporate sustainability disclosures and actual ESG performance. However, empirical evidence indicates that estimates of greenwashing vary substantially depending on the data source used for performance evaluation and the assumed time lag between disclosure and realized outcomes [84,89]. Future research should employ distributed lag models and integrate multiple independent sources of ESG performance data to enhance the reliability and validity of greenwashing assessments. Moreover, existing research has predominantly focused on the environmental pillar, providing limited insight into greenwashing within the social and governance dimensions. It is therefore essential to examine the consistency of disclosure--performance gaps across all ESG pillars and to explore contextual moderators that may influence such decoupling [1,88]. Another promising but underexplored avenue concerns the regulatory effectiveness and auditability of disclosure--performance gap metrics [87]. Future research should investigate whether the introduction or strengthening of disclosure obligations reduces these gaps and which ESG components are most responsive. Moreover, many studies rely on unvalidated coding schemes or subjective classifications methods, raising concerns regarding the construct validity and replicability of greenwashing indicators derived from content analysis. More systematic validation procedures, coupled with the increased application of natural language processing and AI-based techniques, are needed to improve the methodological rigor of future analyses [86,95].\n\nThe symbolic--substantive approach to measure greenwashing also faces several limitations that warrant further research. One major challenge concerns the lack of consistency in how symbolic and substantive disclosures are operationalized. Existing studies employ divergent classification rules, which may yield inconsistent",
        "conclusions depending on the coding schemes, linguistic contexts, and sectoral characteristics applied [6,24]. Future research should prioritize the development of unified coding frameworks, assess their cross-contextual stability, and validate them across multilingual corpora and industry segments using measurement-invariance techniques.\n\nAnother underexplored area involves the role of stakeholder perceptions in mediating the classification of symbolic versus substantive ESG claims. Current studies often assume homogeneous interpretive frameworks, overlooking how investors, NGOs, regulators, or consumers may differentially interpret identical disclosures [103,107]. Behavioral experiments and stakeholder-centered conjoint analyses could provide valuable insights into these perception gaps. Institutional and internationalization dynamics also warrant deeper examination. Current research provides limited evidence on how a company's degree of internationalization and institutional context influence the symbolic or substantive nature of ESG communication [101,104]. Future research could explore how external pressure and\nlegitimacy demands jointly shape disclosure behavior. Moreover, most current analyses focus on isolated narrative fragments—such as specific phrases or report sections—rather than evaluating the broader alignment between the company's overall discourse and verified ESG outcomes. This narrow focus constrains the ability to detect symbolic decoupling at scale. Future research should adopt more comprehensive, firm-level approaches that link entire report contents to quantifiable performance indicators [102,108]. Digital transparency tools and emerging technological systems also merit greater attention. While some recent studies acknowledge the growing adoption of digital reporting mechanisms, empirical evidence on their impact remains scarce [30,107]. Future research could examine whether tools such as real-time ESG dashboards, structured data reporting, and algorithmic monitoring reduce company' capacity to engage in symbolic disclosure.\n\nDetecting greenwashing through selective disclosure and narrative manipulation likewise represents a rapidly developing research area. Yet, a key limitation lies in the absence of standardized procedures for identifying and classifying such practices across industries, languages, and coding systems. Current studies often rely on heterogeneous textual metrics without confirming measurement invariance, which undermines comparability and replicability [111,116,118]. Future research should aim to establish unified codebooks and multilingual natural language processing (NLP) pipelines, complemented by manual validation of sampled text segments to ensure methodological robustness. The role of institutional investors in shaping information opacity also remains underexplored. Although prior studies have pointed to the potential emergence of “disclosure fog” in ESG communication, few have empirically examined whether institutional ownership correlates with hedging language, lexical dilution, or selective ESG narrative construction [107,112]. A promising avenue for future research involves exploring whether and how companies imitate competitors' selective disclosure strategies. Textual similarity measures could help detect industry-specific patterns of imitation—such as linguistic convergence in phrasing, tone, or narrative structure [114,117]. Additionally, further investigation is needed into the strategic manipulation of ESG topic emphasis, wherein companies may disproportionately highlight less material or less scrutinized themes. Empirical evidence remains limited regarding whether such shifts in topic salience reflect deliberate narrative avoidance [109,115]. Future studies should apply systematic text-analytic approaches to detect and evaluate the prevalence and implications of these distortive practices in sustainability reporting.\n\nResearch suggests that, while tone analysis in sustainability reporting can be used to detect potential greenwashing, its conceptualization and operationalization remain insufficiently developed. Many studies rely on generic sentiment dictionaries or document-level scores, which risk conflating genuine optimism with impression management, thereby highlighting the need for more nuanced, domain-specific measures [74,119,124]. A key priority should therefore be domain adaptation: specifically, the development of ESG-specific lexicons and fine-tuned models that capture sectoral jargon, regulatory terminology, and claim types, while differentiating genuinely informative positive language from rhetorical attempts at attention deflection. In addition, reporting tactics tend to be localized rather than distributed across an entire document. Positive tone frequently clusters in CEO letters, highlights, or specific KPI sections, whereas negative information is often abstracted, minimized, or relegated to footnotes. These patterns underscore the importance of section- or span-level analyses linked to verifiable performance metrics [70,120]. Current research on tone remains largely monomodal, focusing exclusively on textual content while neglecting images, charts, and other visual or structural cues that can also signal greenwashing. This calls for moving beyond text-only measures toward integrated, multimodal approaches that combine tone, readability, visual analysis, and claim verification. Future studies should therefore tailor sentiment measures to sustainability-specific language, link\ndetected tone distortions to material outcomes, connect tone analysis to KPI-related sections, and validate indicators against real-world evidence—such as verified violations or regulatory actions. Expanding and replicating such analyses across languages, sectors, and time periods will further strengthen the robustness, comparability, and generalizability of findings [74,110,120].\n\nConsidering readability analysis as a tool to detect greenwashing in sustainability reporting, it is important to note that standard readability formulas are widely applied but often insufficiently calibrated to the linguistic and conceptual characteristics of ESG disclosures. Low readability may simply reflect the inclusion of necessary technical details rather than an attempt to confuse, while the excessive use of specialized jargon can sometimes be employed to obscure information [74,127,129,130]. Accordingly, readability metrics should be paired with domain-specific indicators—such as levels of specificity, baseline reporting, scope coverage, and verifiability—to better distinguish legitimate complexity from manipulative practices. Document-level readability averages can conceal localized tactics, as clusters of complexity often appear in particular sections—such as CEO letters, KPI or incident notes, and footnotes—precisely where decoupling or attention deflection is most likely to occur. Readability analysis therefore requires section- or span-level granularity linked to the KPIs discussed, in order to differentiate “accessible language on successes” from “opaque language on shortcomings.” While many studies relate readability to performance or disclosure style, fewer examine whether readability-based warning signals correspond to verified outcomes such as regulatory violations, enforcement actions, or financial restatements. Future research should leverage pre/post-event trajectories and matched control designs to test whether scrutiny actually disciplines corporate language or merely encourages greenhushing. Studies examining the readability of sustainability reporting frequently face methodological limitations, including a predominant focus on single-country or single-sector samples, reliance on voluntary disclosures, and susceptibility to coder subjectivity. These challenges highlight the need for cross-lingual, multi-year, and multi-industry datasets, transparent codebooks, and human-in-the-loop processes. It is also evident that readability interacts dynamically with tone, as well as with graphical and formatting choices, underscoring the need to develop multimodal analytical pipelines that integrate textual, visual, and claim-verification components [74,113,119].\n\nEmpirical evidence indicates that greenwashing frequently manifests in visual form. Companies can amplify positive outcomes and mute negative ones through the strategic design of charts, layouts, and imagery [80,81]. Yet empirical research often continues to treat visuals as illustrative artifacts rather than as measurable evidence, typically relying on small samples or broad impression-management categorizations [79]. Future studies should therefore advance chart-forensic methodologies that translate potentially misleading design choices into reproducible, quantifiable features and link these visual features to material KPIs (e.g. emissions, water use, accidents) and to verified outcomes such as violations, restatements, or enforcement actions [133]. At present, the available evidence still depends heavily on manual coding and limited samples, with no standardized chart-forensics feature set (e.g. baseline height, axis truncation, unit swaps, selective time windows, and 3D exaggeration). Visuals are also rarely connected to specific KPIs or materiality dimensions, even though greenwashing is often localized—appearing as a flattering chart in highlights, a footnoted base-year reset, or imagery that diverts attention. In addition, theoretical anchoring and causal inference remain weak: graphical manipulation is seldom linked to verified outcomes or exogenous shocks, leaving it unclear whether scrutiny disciplines visual design or merely prompts greenhushing. Moreover, replicable and open figure-level corpora and perception experiments that assess how design choices distort stakeholder judgments remain scarce. Accordingly, future studies should formalize and automate\nchart-forensic feature extraction, analyze visuals at the figure or section-level while linking them to KPIs and materiality, conduct quasi-experimental studies around assurance or regulatory interventions to connect visual-risk scores to verified outcomes, and establish open, replicable figure-level datasets complemented by human perception benchmarks.\n\nEmpirical studies that document actual greenwashing—drawing on enforcement lists, counter-accounts, scandals, or verified violations—have advanced the field beyond purely hypothetical typologies. Nevertheless, several cross-cutting research gaps remain. Research in this area is often event-bound or context-bound, which introduces selection bias and limits external validity. For example, reliance on media-identified cases carries the risk that “hidden” offenders remain unobserved [135]. Other limitations include small sample sizes, sector-specific scopes, and short temporal windows, underscoring the potential to scale counter-account methodologies using artificial intelligence and machine learning, and to extend analyses across more diverse sectors and longer time horizons [9,12]. Causal identification also remains underdeveloped, as most studies document associations rather than mechanisms. There is a growing call for clean empirical settings to test whether mandatory reporting regimes genuinely curb greenwashing rather than merely substituting for voluntary signaling. Quasi-experimental designs and broader contextual applications are needed to determine whether markets discipline actual misconduct or simply respond to disclosure salience [135,143]. Moreover, dynamic post-enforcement adaptations remain insufficiently measured. Regulatory scrutiny may prompt companies to shift from exaggeration to attention deflection or selective disclosure, yet systematic pre-/post-tracking is rare [113]. Finally, there is a pressing need for predictive and preventive tools capable of testing whether linguistic and visual features can anticipate future irresponsible behavior, alongside validated multi-metric pipelines—integrating readability, tone, and visual analysis—anchored to verified violations [113,131].\n\nIt should be noted that some studies exhibit a proxy--construct mismatch, inferring greenwashing merely from the issuance of a sustainability report [138], the adoption of reporting frameworks, or the presence of assurance statements without analyzing the actual report content [139]. Such approaches rely on surface-level or indirect indicators that are not validated against concrete evidence, which may conflate weak sustainability performance or incomplete disclosure with deceptive intent, thereby oversimplifying detection. Moreover, the absence of falsification tests, causal analysis, and cross-validation further undermines the reliability and robustness of these findings. Future research could address these limitations through systematic content analysis that explicitly examines omissions, vagueness, and materiality in disclosures, while refining the greenwashing construct with materiality-aware, section-level measures and triangulating proxies through multimodal evidence.\n\nTable 5 presents avenues for advancing research on strategic typologies and measurement approaches for greenwashing in sustainability reporting.\nSustainability 2026, 18, 17\n\nTable 5. Avenues for Advancing Research on Strategic Typologies and Measurement Approaches for Greenwashing in Sustainability Reporting.\n\n|  Identified Research Gap | Research Questions | Suggested Research Approach  |\n| --- | --- | --- |\n|  Avenue 1: Advancing understanding of strategic typologies and positions of greenwashing in sustainability reporting  |   |   |\n|  Limited understanding of heterogeneous greenwashing strategies in sustainability reporting | How do companies combine, balance, or decouple symbolic and substantive sustainability actions, and what reporting strategies distinguish genuine engagement from façade-based communication? | Text-action alignment analysis; supervised typology classification; case-based process tracing; longitudinal mixed-methods design  |\n|  Connecting sustainability reporting approaches with internal decision-making rules | How do boundary decisions, legal considerations, and assurance scope influence specific reporting approaches, and which actors drive each stage of report development? | Semi-structured interviews; audits of governance KPIs and assurance workpapers; process tracing linking internal dashboards to report edits; tactic-to-signal coding dictionary  |\n|  Limited understanding of greenhushing in sustainability reporting | Under what conditions do companies choose silence over spin, which topics are systematically omitted, and how do these omissions relate to liability risk or organizational capability constraints? | Two-wave anonymous manager surveys; internal-external KPI gap analysis; missing-data analysis and peer-benchmark detection; case studies in controversial industries  |\n|  Limited evidence on greenwashing practices in sustainability reporting among SMEs and companies in emerging markets | How do organizational capability constraints and institutional pressures influence the selection of reporting tactics in companies beyond large publicly listed companies? | Multi-country SME sampling; semi-structured interviews with context-aware content analysis; moderator tests for ownership and enforcement intensity  |\n|  Limited understanding of the causal effects of external assurance on corporate greenwashing approaches and strategies in sustainability reporting | Does transitioning from limited to reasonable assurance reduce the use of specific strategic reporting approaches? | Difference-in-differences analysis leveraging assurance upgrades; blind re-audits on stratified samples; structured auditor checklists as primary data sources; preregistered coding of reporting tactics  |\n|  Scarce exploration of AI's role in amplifying and detecting corporate greenwashing approaches and strategies in sustainability reporting | Does LLM-assisted sustainability report drafting contribute to greater linguistic homogeneity or tone bias, and can hybrid human-AI pipelines reliably detect such approaches? | Stylometric/authorship-signal analysis; LLM-assisted annotation with human adjudication; transparent model cards; Inter-rater reliability reporting and pre-registration  |\n|  Avenue 2: Advancing research on disclosure-performance gaps to detect greenwashing in sustainability reporting  |   |   |\n|  Limited understanding of how ESG performance measurement choices and time-lag structures influence disclosure-performance greenwashing assessments | Under what conditions do alternative ESG performance metrics (registry-based, rating-based, or content-analysis-derived) and talk-to-walk lag specifications lead to materially different disclosure-performance greenwashing assessments? | Triangulated ESG performance datasets; distributed-lag specifications  |\n|  Scarce evidence on cross-pillar comparability in disclosure-performance greenwashing metrics | How consistent are disclosure-performance gaps across ESG pillars, and what contextual factors moderate observed decoupling? | Pillar-level gap decomposition using multi-block PLS; multi-group structural equation modeling (SEM)  |\n|  Insufficient research on the effectiveness of regulatory and audit mechanisms in reducing disclosure-performance greenwashing | Do changes in mandatory ESG reporting and assurance regimes materially reduce disclosure-performance gaps, and through which enforcement mechanisms? | Difference-in-differences analysis using regulatory shocks (e.g., NFRD/TCFD adoption)  |\n|  Limited evidence on the validity and generalizability of text-based ESG disclosure measurement techniques | Which NLP pipelines (dictionary-based, topic modeling, or transformer-based) provide the most reliable and explainable estimates of disclosure-performance decoupling across sectors and time? | Construction of a benchmark ESG corpus with verified performance outcomes; cross-model validation (lexicon/LDA/transformers)  |\n|  Avenue 3: Deepening research on symbolic and substantive ESG disclosure in detecting greenwashing  |   |   |\n|  Limited consistency in operationalizing symbolic versus substantive sustainability disclosures | Under what conditions do symbolic and substantive disclosure classifications remain stable across codebooks, languages, and industry contexts? | Development of unified codebook; multilingual NLP applications; measurement-invariance testing; cross-country replication exercises  |\n|  Limited understanding of stakeholder-specific perceptions of symbolic versus substantive disclosure | Do different stakeholder groups (investors, NGOs, consumers, and regulators) systematically differ in identifying symbolic versus substantive ESG claims? | Stakeholder experiments; conjoint analysis; behavioral designs  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable 5. Cont.\n\n|  Identified Research Gap | Research Questions | Suggested Research Approach  |\n| --- | --- | --- |\n|  Limited evidence on how internationalization and institutional context shape symbolic versus substantive ESG communication | How do company internationalization and institutional environments moderate the balance between symbolic-substantive reporting? | Multilevel modeling; home-vs-host institutional interaction tests; cross-regional comparative content analysis  |\n|  Limited understanding of narrative micro-evidence versus systemic performance alignment | How does reliance on micro-level narrative cues influence the detection of symbolic versus substantive ESG disclosure at the firm level? | Evidence-type coding; narrative-to-KPI density analysis  |\n|  Insufficient empirical evidence on how digital transparency tools influence symbolic disclosure | Do digital transparency mechanisms (e.g., real-time ESG dashboards, blockchain, AI audit trails) reduce symbolic sustainability reporting? | Pre-/post-digitalization comparisons; matched company analysis; pilot evaluations of digital traceability systems  |\n|  Avenue 4: Advancing research on selective disclosure and narrative manipulation for greenwashing detection  |   |   |\n|  Lack of standardization in detecting selective disclosure and narrative manipulation in sustainability reporting | Under what conditions do classifications of selective disclosure and narrative manipulation remain stable across coding protocols, sectors, and languages? | Unified codebook; multilingual NLP; manual audit and transformer-based models cross-checks; cross-industry replication with measurement-invariance tests  |\n|  Limited understanding of institutional investor influence on narrative opacity and selective ESG disclosure (\"disclosure fog\") | Do institutional investors contribute to narrative dilution, obfuscation, and selective ESG highlighting in corporate sustainability reporting? | Mediation and moderation models; narrative-fog indices (hedging density, lexical dilution)  |\n|  Limited understanding of whether and how greenwashing behaviors diffuse across companies within the same industry | To what extent do rival companies shape selective ESG narrative strategies, and how does regulatory oversight moderate these effects? | Network and spatial models; industry similarity matrices; measures of linguistic convergence (NLP)  |\n|  Limited evidence on strategic topic shifting across ESG pillars as a manipulation strategy | Does selective emphasis on less material (E/S/G) pillars indicate narrative manipulation and strategic disclosure avoidance? | Topic allocation analysis; materiality-risk mapping; ESG domain imbalance indices; GRI-based thematic segmentation  |\n|  Avenue 5: Advancing research on tone in sustainability reporting and its implications for detecting greenwashing  |   |   |\n|  Limited adaptation of generic sentiment measures to sustainability-specific language | To what extent, and how frequently, do generic sentiment lexicons misclassify sector-specific sustainability terms as positive or negative? | Development of sustainability-specific lexicons; fine-tuning of transformer-based models on span-level CSR/ESG labels; baseline comparison; topic-level error reporting  |\n|  Limited insight from document-level tone analyses | Do section-level mismatches between tone and KPI performance provide a more accurate indication of greenwashing than document-level averages? | Report segment by section (e.g., CEO letters, KPIs, targets, incidents); computation of tone for each segment; evaluation of section-level tone-KPI gaps against verified performance outcomes  |\n|  Limited multimodal analysis | To what extent does positive tone co-occur with graphical manipulation or topic displacement in sustainability reports? | Integration of text tone with chart forensics and KPI coverage checks; multimodal fusion models with human adjudication  |\n|  Limited research in cross-lingual and non-English sustainability reporting contexts | To what extent do tone detectors trained on English texts generalize to other languages, and do key linguistic markers exhibit similar behavior across languages? | Parallel corpora development and multilingual model transfer; validation through native-speaker adjudication; error analysis across languages and industries  |\n|  Limited scope, short timeframes, and narrow sample breadth in sustainability reporting studies | Do the effects of tone analysis remain stable across industries and over time, or are they primarily driven by specific sectors or years? | Expand to multi-year, multi-industry panel datasets; apply rolling-window stability tests; employ preregistered codebooks and open-labeled text samples for reproducibility  |\n|  Avenue 6: Advancing research on readability in sustainability reporting and its implications for detecting greenwashing  |   |   |\n|  Generic readability formulas require adaptation for ESG-specific content | When do low readability scores indicate genuine technical complexity versus deliberate jargon or obfuscation? | Readability assessment combined with ESG specificity; claim verifiability; domain lexicons; labeling of legitimate vs. obfuscatory complexity for model training  |\n|  Limited understanding of section-level tactics due to reliance on document-level scores | Does section-level readability predict disclosure-performance decoupling more accurately than report-level averages? | Report segmentation; section-level readability-gap analysis; outcome testing  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable 5. Cont.\n\n|  Identified Research Gap | Research Questions | Suggested Research Approach  |\n| --- | --- | --- |\n|  Limited empirical validation and weak linkage to verified outcomes | Do readability-based indicators predict violations, enforcement actions, or restatements more effectively than ratings-based proxies? | Readability-event linkage studies; event studies; predictive validity testing; calibration by industry and technical thresholds  |\n|  Limited understanding of post-event readability shifts; potential emphasis on immaterial topics or omission of material ones | After adverse events, do companies shift complex language toward immaterial topics or omit material ones? | Materiality mapping; topic-wise readability; missing-data diagnostics; pre/post event analysis  |\n|  Limited understanding of cross-lingual, cross-country, cross-sector, and temporal readability effects | Are readability effects consistent across languages, countries, sectors, and time periods? | Multi-country, multi-language, and multi-sector panel analyses; rolling-window tests; robustness checks using alternative performance and assurance metrics  |\n|  Limited understanding of readability-tone-visual interactions | Can multimodal pipelines combining text, tone, and visuals improve the detection of misleading sustainability claims? | Multimodal fusion models integrating readability, tone, and visual indicators; human adjudication with inter-rater reliability reporting  |\n|  Avenue 7: Advancing visual analysis in sustainability reporting to detect greenwashing  |   |   |\n|  Limited availability of a standardized, replicable chart-forensics toolkit for analyzing visual greenwashing | Which specific chart design choices (e.g., non-zero baselines, axis breaks, dual axes, 3-D effects, or selective time windows) systematically inflate perceptions of performance? | Develop a standardized feature schema (baseline, units, window, area/angle); CV/OCR detection; human validation with codebook and inter-rater reliability checks  |\n|  Limited understanding of how local visual reporting tactics are obscured when using document-level | Do figure-level distortions appear in report sections associated with weaker or less material KPIs? | Conduct visual-KPI alignment (visuals, KPIs, periods, targets); compute visual-salience × KPI-weakness index; test section-level decoupling  |\n|  Limited understanding of photos, icons, and color as “sustainable gloss” | Does the use of nature imagery, icons, and green colors increase when sustainability KPIs decline? | Apply image analysis; scene classification, icon detection, and color histograms; linked to KPI trends; attention-deflection test  |\n|  Limited evidence on how selective windows, metric/unit switches, and dual-axis charts distort perceived performance | How frequently do charts omit adverse years, switch from absolute to intensity metrics, or use dual axes and unit swaps to exaggerate trends or correlations? | Assess window integrity (coverage vs. reporting boundary); detect metric swaps and base-year resets; peer-window comparison; dual-axis/unit detection; perceived slopes/ratios; exaggeration index.  |\n|  Limited evidence on the effects of unclear labeling and visual distortions | Do labeling opacity and visual design jointly distort transparency and perceived magnitude in critical disclosure areas? | Perform layout forensics (font, contrast, placement, z-order) for legends/footnotes; link to boundary changes, geometry heuristics for data-ink distortion; perception tests vs. ground truth  |\n|  Avenue 8: Toward a deeper understanding of real greenwashing evidence  |   |   |\n|  Limited ability to generalize findings beyond specific events and contexts | Do results driven by headline cases hold in routine, low-salience settings and other contexts? | Construct multi-country panels of verified cases; implement systematic case verification and peer matching; perform cross-domain re-estimation to test robustness  |\n|  Small samples, narrow sectoral focus, and restricted time frames | To what extent are earlier findings on greenwashing robust when examined across multiple sectors and over longer time horizons? | Apply a machine learning-augmented counter-accounting; use pre-registered codebooks; conduct sector-level stratification; rolling-window effect testing  |\n|  Limited understanding of post-enforcement adaptation by companies | Do enforcement actions prompt companies to reduce explicit claims and shift toward greenhushing or less verifiable environmental narratives? | Employ event studies and hazard modeling of pre/post violations: perform missing-data diagnostics; longitudinal tracking of governance changes  |\n|  Limited predictive detection and early warning of greenwashing | To what extent can textual and visual features predict future instances of irresponsible behavior or verified greenwashing? | Develop labeled corpora of verified cases; train predictive models using textual and visual features; perform stratified error evaluation and out-of-sample validation on new sustainability reports  |\n|  Avenue 9: Advancing research to avoid oversimplified assumptions of greenwashing in sustainability reporting  |   |   |\n|  Proxy-construct mismatch in greenwashing | When do sustainability reports or framework adoptions signal genuine performance rather than greenwashing? | Detailed content analysis; apply omission detection, vagueness assessment, materiality evaluation frameworks  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable 5. Cont.\n\n|  Identified Research Gap | Research Questions | Suggested Research Approach  |\n| --- | --- | --- |\n|  Lack of content-level validation | To what extent do omissions or superficial disclosures on material environmental and social topics correspond to actual corporate performance? | Combine readability analysis; report length and frequency compared with KPIs, targets, and offsets  |\n|  Limited triangulation of greenwashing indicators | How do textual proxies (e.g., readability, tone, specificity/hedging) correspond with multimodal evidence—including visuals, chart forensics, and claim verification—in detecting greenwashing? | Conduct claim verification; multimodal triangulation; supervised machine learning on labeled legitimate vs. obfuscatory disclosures  |\n\n# 5. Conclusions\n\nThis SLR offers a comprehensive synthesis of research on greenwashing in sustainability reporting. The findings reveal that greenwashing is a multifaceted phenomenon, manifesting through both explicit communicative strategies and more subtle reporting practices. Drawing on a rigorous content analysis of 88 studies, we identify strategic typologies of greenwashing and examine the content-analysis-based measurement approaches employed to detect them.\n\nGreenwashing in sustainability reporting, as highlighted by our SLR, is a complex and multidimensional corporate behavior rather than a uniform practice. Companies often navigate a continuum between substantive action and symbolic disclosure, strategically calibrating the two to balance actual performance with desired perception. This challenges binary typologies and highlights the need for more nuanced conceptual frameworks. Equally important is what companies do not disclose—strategic silence or greenhushing—which reveals a covert dimension of impression management that is often overlooked. Stakeholder perceptions also play a pivotal role: the same report may be viewed as credible by one audience but dismissed as greenwashing by another, reflecting differential interpretations shaped by stakeholder expertise, situational expectations, and evaluative heuristics.\n\nOur SLR identifies three principal content-analysis-based approaches to measuring greenwashing: (1) the disclosure-performance gap, which compares reported versus actual ESG performance; (2) the symbolic-substantive approach, which contrasts qualitative statements with verifiable organizational actions; and (3) selective and manipulative disclosure, which examines biased messaging, tone, and visual framing techniques used to influence stakeholder perceptions. We also show that analytical techniques for detecting greenwashing increasingly focus on linguistic and visual cues in sustainability reports—tone (sentiment and narrative framing), readability (traditional readability indices and machine-learning-based textual-complexity measures), and visual elements (selective emphasis, imagery framing, and graphical distortions). Finally, we contrast empirically substantiated cases of greenwashing with studies relying on simplified or untested assumptions.\n\nWe outline several future research directions to deepen our understanding of greenwashing practices pursued by companies and strengthen the detection and deterrence mechanisms available to stakeholders and regulators. Our findings underscore the need for a holistic, multi-theoretic approach to conceptualizing greenwashing, alongside practical and policy interventions that enhance transparency and accountability in sustainability reporting. Of the future research avenues outlined in this paper, we highlight those we consider most urgent. Collectively, these priorities emphasize methodological rigor and empirical validation, guiding future studies to advance greenwashing research, to help companies avoid deceptive reporting, and to equip policymakers with evidence-based strategies for corporate accountability.\n\nThe first priority is aligning corporate disclosures with actual performance. Researchers should link narrative claims to verified ESG metrics using data-driven approaches,\n\nhttps://doi.org/10.3390/su18010017\nincluding supervised machine learning, to detect inconsistencies. Longitudinal case studies can further capture shifts between substantive and symbolic reporting over time. This line of inquiry responds to calls for more systematic alignment of sustainability narratives with performance outcomes, enabling academics to refine existing theories, helping managers identify communication blind spots, and allowing regulators to target audits more effectively where claims diverge from underlying metrics.\n\nClosely related is the need to study “greenhushing”—strategic omissions in sustainability communication. Companies' silence on material issues often escapes conventional analytical techniques. Future research should model disclosure decisions at the margin, identifying what is omitted and why, using methods such as anonymous managerial surveys, KPI-report gap analyses, and sector-specific case studies in high-risk industries. This complements work on overstated claims, reveals the concealed side of impression management, refines theories of decoupling, alerts companies to the risks embedded in nondisclosure, and supports policymakers in closing omission-based loopholes.\n\nAnother underexplored area is expanding greenwashing research on SMEs and emerging-market businesses. Our SLR shows that most empirical evidence is concentrated among large, publicly traded companies in developed countries. It is therefore critical to examine whether greenwashing typologies apply across diverse organizational and institutional contexts. Multi-country studies using context-rich interviews and comparative content analysis could illuminate local disclosure practices, refine theoretical generalizability, provide practitioners with more relevant benchmarks, and help policymakers tailor reporting standards to heterogeneous business environments.\n\nA further priority is evaluating the causal impact of regulations and assurance mechanisms on greenwashing. Although external assurance and mandatory reporting standards are often assumed to deter deceptive communication, robust empirical evidence remains limited. Quasi-experimental designs—such as difference-in-differences around new disclosure mandates or transitions from limited to reasonable assurance—could credibly isolate these effects. Establishing causal relationships would advance legitimacy theory, guide regulators in evaluating policy effectiveness, and help companies understand the true costs and benefits of compliance.\n\nThe rise of generative AI (LLMs) in sustainability reporting constitutes a timely and increasingly consequential research frontier. AI-assisted writing may standardize stylistic features, homogenize tone, and amplify optimism bias in ways that subtly shape stakeholder interpretations. Comparative studies of human and AI-authored excerpts—using stylometric techniques, semantic-shift analyses, and hybrid human-AI annotation—can uncover nuanced linguistic changes introduced by AI tools. Curated and labeled datasets can further support models designed to detect AI-driven alterations in sustainability narratives. Such research becomes particularly urgent in the light of rapid AI adoption, offering insights into emerging forms of impression management, alerting companies to AI-driven biases, and informing regulators as they consider guidelines for the responsible use of AI in reporting.\n\nA cross-cutting priority is the standardization and validation of measurement approaches. Developing unified codebooks, ESG sentiment lexicons, and validated NLP pipelines—tested across languages, industries, and reporting regimes—would enhance construct clarity, methodological comparability, and replicability. A more cohesive analytical framework would facilitate reliable academic comparisons, provide practitioners with dependable benchmarks for assessing reports, and equip regulators with robust indicators to support enforcement and oversight.\n\nFuture research should also advance toward the use of multimodal content analysis. Constructing multimodal pipelines that integrate NLP, readability metrics, and visual\nforensic techniques would enable researchers to capture modes of framing and narrative construction that are overlooked by text-only approaches. This comprehensive perspective can reveal subtler forms of impression management, assist companies in improving the coherence and transparency of report design, and provide regulators with more sophisticated tools to audit sustainability disclosures holistically.\n\nFinally, developing predictive greenwashing models represents a critical step toward proactive oversight. By leveraging both linguistic and visual features, researchers can build labeled repositories of verified cases and train machine-learning classifiers to detect patterns that precede misconduct. Such models would offer academics new insights into the antecedents of greenwashing, provide regulators with data-driven risk scores to guide targeted inspections, and enable companies to use these tools for internal compliance monitoring.\n\nFrom a theoretical standpoint, this study contributes to the consolidation of fragmented conceptualizations of greenwashing by linking them to broader discussions on organizational legitimacy, ethics, and corporate communication. Methodologically, it systematizes the existing tools for identifying greenwashing through content analysis and proposes a comprehensive agenda to advance both methodological rigor and theoretical depth. From a practical perspective, the findings provide actionable guidance for policymakers, sustainability officers, corporate managers, and board members responsible for ESG reporting and communication, helping them enhance the credibility of sustainability reporting. By emphasizing transparency, verifiability, and balanced disclosure, this study encourages organizations to move beyond symbolic compliance toward genuine accountability. Ultimately, this review reinforces the importance of integrating theoretical depth with methodological rigor to better understand, detect, and prevent greenwashing—thereby fostering more credible, trustworthy, and sustainable corporate communication practices.\n\nAlthough this study offers valuable insights for scholars and practitioners, several limitations should be acknowledged. The systematic review relied exclusively on publications indexed in Scopus and Web of Science. While these databases are widely regarded as authoritative sources and are commonly used for literature reviews and bibliometric analyses, this choice may have excluded relevant publications on greenwashing strategies and content-based measurement approaches indexed in other databases (e.g. Google Scholar or EBSCO). Additionally, non-English publications were omitted, which may have limited the diversity of perspectives included in this review. However, incorporating articles in languages other than English would have significantly increased the time and resources required due to translation needs. Given that most reputable, indexed journals publish primarily in English, this trade-off was considered acceptable. The findings are also influenced by the chosen search terms; alternative keyword combinations might yield different results, particularly given the variety of expressions related to “greenwashing” and “sustainability reporting”. However, the selection of search terms was guided by a comprehensive review of prior studies, and Boolean operators were applied to broaden the search strategy. We also undertook extensive reference screening to identify relevant work that might not emerge through keyword-based searches. Although search-term bias cannot be entirely eliminated, these procedures substantially mitigate its effects in our review. Furthermore, while content analysis inevitably entails some degree of subjectivity, this risk was mitigated through independent coding by two researchers.\n\nDespite these constraints, this study provides a structured and integrative synthesis of existing knowledge on greenwashing in sustainability reporting and identifies promising avenues for future theoretical development and empirical exploration.\n\nThe following supporting information can be downloaded at: https://www.mdpi.com/article/10.3390/su18010017/s1, Table S1: PRISMA 2020 Checklist.\nSustainability 2026, 18, 17\n\nAuthor Contributions: Conceptualization, A.J. and A.R.; methodology, A.J. and A.R.; investigation, A.J. and A.R.; data curation, A.J. and A.R.; writing—original draft preparation, A.J. and A.R.; writing—review and editing, A.J. and A.R.; visualization, A.J. and A.R. All authors have read and agreed to the published version of the manuscript.\n\nFunding: This publication was supported by the statutory research project no. 13/030/BK_25/0089, carried out at the Department of Production Engineering, Faculty of Management and Organization, Silesian University of Technology.\n\nInstitutional Review Board Statement: Not applicable.\n\nInformed Consent Statement: Not applicable.\n\nData Availability Statement: Data will be made available on request.\n\nConflicts of Interest: The authors declare no conflicts of interest.\n\n# Appendix A\n\nTable A1. Searching words.\n\n|   | Theme | Searching Words  |\n| --- | --- | --- |\n|  (1) | Greenwashing | \"greenwash*\", \"green wash*\", \"green-wash*\", \"decoupling\", \"cheating\", \"obfuscation\", \"deceptive\". \"sustainability report*/disclosure\", \"sustainable development report*/disclosure\", \"corporate social responsibility report*/disclosure\", \"CSR report*/disclosure\", \"responsib* report*/disclosure\", \"ESG report*/disclosure\", \"corporate citizenship report*/disclosure\", \"triple bottom line report*/disclosure\", \"TBL report*/disclosure\", \"GRI report*/disclosure\", \"Global Reporting Initiative report*/disclosure\", \"sustainable development goal* report*/disclosure\", \"SDG* report*/disclosure\", \"integr* report*/disclosure\", \"non-financ* report*/disclosure\", \"environment* report*/disclosure\", \"green report*/disclosure\", \"GHG report*/disclosure\", \"greenhouse gas report*/disclosure\", \"carbon report*/disclosure\", \"social report*/disclosure\".  |\n\nQuery wording: (1) AND (2).\n\nTable A2. Query string.\n\n|  Database | Query String  |\n| --- | --- |\n|  Scopus | TITLE-ABS-KEY(“greenwash*” OR “green wash*” OR “green-wash*” OR “decoupling” OR “cheating” OR “obfuscation” OR “deceptive”) AND (“sustainability report*” OR “sustainable development report*” OR “ESG report*” OR “corporate social responsibility report*” OR “CSR report*” OR “responsib* report*” OR “corporate citizenship report*” OR “triple bottom line report*” OR “TBL report*” OR “GRI report*” OR “Global Reporting Initiative report*” OR “sustainable development goal* report*” OR “SDG* report*” OR “integr* report*” OR “non-financ* report*” OR “environment* report*” OR “green report*” OR “GHG report*” OR “greenhouse gas report*” OR “social report*” OR “sustainability disclosure” OR “sustainable development disclosure” OR “ESG disclosure” OR “corporate social responsibility disclosure” OR “CSR disclosure” OR “responsib* disclosure” OR “corporate citizenship disclosure” OR “triple bottom line disclosure” OR “TBL disclosure” OR “GRI disclosure” OR “Global Reporting Initiative disclosure” OR “sustainable development goal* disclosure” OR “SDG* disclosure” OR “integr* disclosure” OR “non-financ* disclosure” OR “non-financ* statement” OR “greenhouse gas disclosure” OR “GHG disclosure*” OR “environment* disclosure” OR “green disclosure” OR “carbon report*” OR “carbon disclosure” OR “social report*” OR “social disclosure”))  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A2. Cont.\n\n|  Database | Query String  |\n| --- | --- |\n|  Web of Science | TS=((“greenwash*” OR “green wash*” OR “green-wash*” OR “decoupling” OR “cheating” OR “obfuscation” OR “deceptive”) AND (“sustainability report*” OR “sustainable development report*” OR “ESG report*” OR “corporate social responsibility report*” OR “CSR report*” OR “responsib* report*” OR “corporate citizenship report*” OR “triple bottom line report*” OR “TBL report*” OR “GRI report*” OR “Global Reporting Initiative report*” OR “sustainable development goal* report*” OR “SDG* report*” OR “integr* report*” OR “non-financ* report*” OR “environment* report*” OR “green report*” OR “GHG report*” OR “greenhouse gas report*” OR “sustainability disclosure” OR “sustainable development disclosure” OR “ESG disclosure” OR “corporate social responsibility disclosure” OR “CSR disclosure” OR “responsib* disclosure” OR “corporate citizenship disclosure” OR “triple bottom line disclosure” OR “TBL disclosure” OR “GRI disclosure” OR “Global Reporting Initiative disclosure” OR “sustainable development goal* disclosure” OR “SDG* disclosure” OR “integr* disclosure” OR “non-financ* disclosure” OR “non-financ* statement” OR “greenhouse gas disclosure” OR “GHG disclosure*” OR “environment* disclosure” OR “green disclosure” OR “carbon report*” OR “carbon disclosure” OR “social report*” OR “social disclosure”))  |\n\nTable A3. Inclusion and Exclusion Criteria.\n\n|  Criterion | Inclusion | Exclusion  |\n| --- | --- | --- |\n|  Type of papers | Peer-reviewed papers published in scientific journals and conference papers. | Books, books chapters, editorial materials, meeting abstracts, data papers.  |\n|  Language | Only papers written in English. | Papers not written in English.  |\n|  Relevance: |  |   |\n|  Thematic scope | Greenwashing in sustainability reporting appears as the main topic. | • Greenwashing strategies and measurement methods are addressed only as a side topic. • No link identified between greenwashing and sustainability reporting  |\n|   |  Greenwashing strategies are discussed as a main topic of the paper. | • Greenwashing strategies and measurement methods are addressed only as a side topic.  |\n|  Mainstreams of paper | Content-analysis-based approaches to measuring greenwashing are presented and applied. | • Lack of methods or approaches based on content analysis of sustainability reports or other ESG-related disclosures.  |\n|   |  At least one dimension of greenwashing is operationalized through content analysis of sustainability reports. | • All dimensions of greenwashing are operationalized exclusively through external ESG scores provided by established global financial and nonfinancial data vendors.  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A4. Summary of Studies Addressing Strategic Typologies of Greenwashing in Sustainability Reporting.\n\n|  Authors | Theoretical Framework | Research Sample Characteristics | Characteristics of Strategic Approaches  |\n| --- | --- | --- | --- |\n|  Amores-Salvadó et al. [63] | Stakeholder theory, signaling theory | 505 international and multi-industry companies2016-2019 | Green leaders—exhibit above-average levels of both environmental performance and environmental disclosure compared to industry peers.Green quiets—demonstrate above-average environmental performance but below-average environmental disclosure relative to industry peers.Green parrots—show below-average environmental performance but above-average environmental disclosure compared to industry peers.Blackbirds—perform below the industry average in both environmental performance and environmental disclosure.  |\n|  Cho et al. [80] | Impression management theory | 120 companies from six countries (France, Germany, Italy, Spain, the UK, and the USA)2006 | Enhancement—occurs when a disproportionately large share of graphed items depicts trends in a favorable direction.Obfuscation—refers to the use of graphical distortions that misrepresent underlying trends through inaccurate or misleading visual depictions.  |\n|  Cho et al. [83] | Organized hypocrisy, organizational facades | Two very large U.S.-based multinational oil and gas corporations2004-2006 | Rational façade—employed to portray adherence to rational norms.Progressive façade—used to demonstrate the adoption of innovative approaches in addressing stakeholder concerns.Reputation façade—constructed to display accounting and rhetorical symbols valued by key stakeholders.  |\n|  Cooper and Wang [65] | Institutional and constitutive approaches | 262 CSR reports from 131 companies (Fortune Global 500) representing 28 countries2012-2019 | Reactionary—describes corporations that mention programs in only a single year of data collection, where such programs are decoupled from both policies and impacts.Recurring—refers to corporations that maintain decoupled programming that recurs over multiple years.Relevant—denotes corporations with coupled programs that include detailed descriptions of either policy-program connections or program-impact links.Revelatory—characterizes corporations with coupled programs that include detailed descriptions of policy-program or program-impact connections, consistently maintained across multiple years.  |\n|  Cüre et al. [81] | Impression management theory | 49 corporate reports (35 standalone sustainability reports, 11 annual reports, and 3 integrated reports) published by Turkish companies | Enhancement—occurs when a disproportionately large share of graphed items depicts trends in a favorable direction.Obfuscation—refers to the use of graphical distortions that misrepresent underlying trends through inaccurate or misleading visual depictions.  |\n|  Friedel [79] | Not stated | Four transnational energy companies2005-2007 | Strategic use of images and text to shape perceptions of objectivity and the appearance of detachment from truth or knowledge, thereby creating and sustaining myths that enhance corporate identity and legitimacy.  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A4. Cont.\n\n|  Authors | Theoretical Framework | Research Sample Characteristics | Characteristics of Strategic Approaches  |\n| --- | --- | --- | --- |\n|  García-Sánchez et al. [69] | Legitimacy theory, impression management theory | 69 Spanish companies listed on the Madrid Stock Exchange | Legitimization strategy—involves neutral discourse aimed at legitimizing current practices and signaling future commitment to the Sustainable Development Goals.Proactive impression management strategy—emphasizes congratulatory messaging, self-promotion, and organizational promotion.Defensive impression management strategy—focuses on responding to negative situations through explanations, justifications, or apologies.  |\n|  Gentile and Gupta [78] | Theoretical concept of petroculture | Royal Dutch Shell's sustainability reports2005-2021 | Necessitarianism—framing fossil fuels as essential and irreplaceable.Greenwashing:Claiming sustainability—presenting sustainability as a core value while emphasizing the ongoing necessity of fossil fuels in the energy market.Strategic word use—substituting terms such as \"oil\" with broader, more neutral language like \"energy.\"Overstating commitment—exaggerating renewable energy commitments to obscure continued fossil fuel dependence.Half-truths—selectively presenting or cherry-picking facts to fit the narrative.Net-zero—using net-zero as a marketing label for legitimizing the status quo.Avoiding the elephant in the room—signaling apparent commitment to transition while refusing to phase out fossil fuels, thus undermining its logic.Strategic blame placement—portraying the fossil fuel industry simultaneously as a leader in the energy transition and as a victim, thereby excusing inaction.Techno-optimism—placing blind faith in fossil-fuel-based technologies, with exclusively optimistic and often unrealistic claims.  |\n|  Hahn and LülfS [70] | Voluntary disclosure theory, signaling theory, legitimacy theory | 40 sustainability reports (19 from companies listed on U.S. Dow Jones Industrial Average Index companies and 21 from German DAX Index companies)2010-2011 | Marginalization—portraying negative aspects as non-relevant.Abstraction—generalizing negative aspects as widespread across the entire industry.Indicating facts—acknowledging the existence of a negative aspect without elaboration.Rationalization—Instrumental: emphasizing benefits, functions, or purposes that justify the negative aspect; Theoretical: framing negative aspects as a \"normal fact of life\" or as inevitable occurrences.Authorization—involving authorities to legitimize actions or explanations.Corrective action—Type 1: providing vague or imprecise ideas or measures for addressing negative aspects in the future; Type 2: offering concrete ideas or measures for addressing negative aspects in the future.  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A4. Cont.\n\n|  Authors | Theoretical Framework | Research Sample Characteristics | Characteristics of Strategic Approaches  |\n| --- | --- | --- | --- |\n|  Hejlova et al. [77] | Not stated | • Sustainability reports and annual reports from 69 signatories to the UN Global Compact's Fashion Industry Charter for Climate Action 2022–2023 | • Strategic silence on deadstock/overstock—minimal or absent disclosure of strategies for managing or reducing overproduction, with such vagueness recognized as a sign of greenwashing.  |\n|  Khan et al. [66] | Institutional theory | • 21 semi-structured interviews with executives of 18 banks in Bangladesh and published sources 2011–2014 | • Acquiescence strategy—adoption of CSR practices driven by alignment between firm goals and institutional expectations, motivated primarily by the need to maintain social legitimacy. • Compromise strategy—implementation of CSR practices that balance full compliance with regulations and more flexible approaches, including negotiation and engagement, ranging from superficial compliance to direct confrontation. • Avoidance strategy—treating CSR responses to institutional pressures not merely as compliance issues but as strategic opportunities to meet the expectations of powerful stakeholders, often at the expense of weaker ones; employing decoupling tactics and concealed practices to circumvent CSR regulations. • Defiance strategy—defying CSR regulations. • Manipulation strategy—adopting CSR practices as an active means to influence and reshape institutional pressures.  |\n|  Kurpierz and Smith [64] | Agency theory | • Literature review | • Fraudulent (greenwashing)—claims that are unsupported by factual evidence, resulting in harm due to material misstatement. • “Cheap talk” (greenwashing)—claims that lack factual support but do not result in harm. • Responsible firms—claims that are factually accurate, though firms may remain silent on negative environmental performance due to voluntary disclosure regimes. • Vocal green firms—firms that report accurately and actively engage in environmental sustainability initiatives.  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A4. Cont.\n\n|  Authors | Theoretical Framework | Research Sample Characteristics | Characteristics of Strategic Approaches  |\n| --- | --- | --- | --- |\n|  Laskin and Mikhailovna Nesova [26] | Not stated | Top eight companies leading Corporate Knights' 2020 Global 100 sustainability ranking 2019 | Positively charged linguistic strategies: - Praise—employing affirmations that highlight social, physical, intellectual, entrepreneurial, and moral qualities. - Satisfaction—using language associated with positive affective states, such as joy, pleasurable experiences, moments of triumph, and expressions of care or nurturance. - Inspiration—invoking abstract virtues deserving universal respect, emphasizing desirable moral and personal qualities, as well as social and political ideals. Negatively charged linguistic strategies: - Blame—using terms that indicate inappropriateness, unfortunate circumstances, unplanned misfortunes, or outright denigrations. - Hardship—employing terms that describe natural disasters, hostile actions, censurable human behavior, undesirable political outcomes, and human fears or errors. - Denial—based on the use of negative contractions, negative function words, and null sets.  |\n|  Laufer [76] | Not stated | Literature review | Confusion—generated through careful document control and strict limitations on the information made available to regulators and prosecutors. Fronting—enacted via subordinate scapegoating or reverse whistleblowing. Posturing—achieved through active use of the public affairs department and, when necessary, external public relations firms.  |\n|  Leung and Snell [73] | Legitimacy theory, stakeholder theory | 49 semi-structured interviews and 30 corporate annual reports published by six companies representing Macao's gambling industry 2007–2011 | Pragmatic legitimacy strategy—refers to calculations of self-interested stakeholders. Moral legitimacy strategy—refers to judgments about whether organizational activities are ethically appropriate within a set of accepted social values. Cognitive legitimacy strategy—refers to the extent to which an organization and its activities are seen as necessary or inevitable, aligning with social norms of appropriateness and desirability.  |\n|  Leung and Snell [68] | Impression management theory, camouflage theory, corporate integrity theory | 62 annual reports, 23 stand-alone CSR reports, and corporate webpages from four US-based multinational gambling companies and their four Macao counterparts 2009–2016 | Zero disclosure strategy—complete absence of coverage on the topic. Curtailment strategy—brief mentions or short general statements regarding the topic. Disclamation strategy—Type 1: including a \"health warning\" directed at consumers; Type 2: identifying potential risks for investors. Defensive façade strategy—providing policy descriptions on a topic that imply passive acceptance of ethical responsibility. Assertive façade strategy—highlighting honors received and other achievements.  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A4. Cont.\n\n|  Authors | Theoretical Framework | Research Sample Characteristics | Characteristics of Strategic Approaches  |\n| --- | --- | --- | --- |\n|  Martínez-Ferrero et al. [74] | Legitimacy theory, accountability theory | 273 firm-year observations representing 12 countries (Canada, France, Germany, Hong Kong, Japan, Luxembourg, the Netherlands, Singapore, Spain, Switzerland, the UK, and the USA)2006-2014 | • Obfuscation disclosure strategy—providing low-quality CSR information that obscures actual performance; such information tends to be unbalanced, less accurate, and less clear, often overly optimistic, lengthy, and difficult to read.• Enhancement disclosure strategy—using high-quality CSR reporting to highlight positive organizational outcomes; offering information that is more reliable, transparent, and comparable.  |\n|  Megura and Gunderson [75] | The concept of frame | Eight multinational corporations (3 coal companies and 5 oil and gas companies)2018-2019 | • Techno-optimism—the belief that innovative technologies and alternative fuels alone, without the need for broader social change, can solve climate change; typically emphasizes the benefits of proposed solutions while ignoring potential drawbacks.• Compliance—adherence to established regulations and standards, often highlighted to obscure past harms or ongoing issues, even when regulations are formally met.• Countermeasures—strategies that indirectly address harms by emphasizing positive contributions to society, diverting stakeholder attention from the industry's negative impacts and leading them to overlook the harm caused.• Omissions—certain relevant topics are either omitted or only briefly mentioned:- Risk minimization—downplaying the potential environmental and societal risks of fossil fuels.- Possibility blindness—ignoring potential future scenarios that diverge significantly from the assumption of a growing economy reliant on increased energy output.  |\n|  Nguyen et al. [82] | Not stated | 597 Australian-listed companies (2316 company-year observations) included in the S&P ASX 300 (Australian Securities Exchange)2009-2018 | • Strategic ESG motivation—integrating sustainability initiatives into a company's overall strategic objectives.• Altruistic ESG motivation—undertaking actions aimed at advancing societal interests, even if they come at the expense of the company's own benefit.• Greenwashing ESG motivation—emphasizing ESG disclosures without meaningful engagement in substantive ESG activities.  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A4. Cont.\n\n|  Authors | Theoretical Framework | Research Sample Characteristics | Characteristics of Strategic Approaches  |\n| --- | --- | --- | --- |\n|  Roszkowska-Menkes et al. [9] | Counter-accounting approach, institutional theory | 168 reports published by 31 companies across six industries in which 99 controversies and 333 negative events occurred2008-2019 | Comprehensive disclosure of negative events—providing a detailed account that includes the context of the event, relevant facts, and the organization's response. Selective disclosure—a symbolic disclosure strategy, which may manifest in one of the following forms:- Vague disclosure—providing very general, incomplete, or ambiguous information that limits stakeholders' ability to assess organizational performance.- Avoidance—omitting any reference to the negative event and to the associated KPI.- Hypocrisy—failing to mention the negative event while making a positive statement regarding the KPI in which it occurred.  |\n|  Saber and Weber [71] | Legitimacy theory | Eight German grocery retailers2013-2018 | Marginalization—portraying negative aspects as irrelevant.Abstraction—generalizing negative aspects as widespread across the entire industry.Indicating facts—acknowledging the existence of a negative aspect without further elaboration.Rationalization—Instrumental: emphasizing benefits, functions, or purposes that justify the negative aspect; Theoretical: framing negative aspects as a “normal fact of life” or as inevitable occurrences.Authorization—invoicing authorities to legitimize actions or explanations.Corrective action—Type 1: providing vague or imprecise measures or ideas to address negative aspects in the future; Type 2: offering concrete measures or ideas to address negative aspects in the future.  |\n|  Schons and Steinmeier [10] | Neo-institutional theory, stakeholder theory | 217 observations for symbolic and substantive employee support and 1368 observations for corporate citizenship activities (companies from 37 countries)2002-2010 | Neglectors—companies that do not engage in CSR activities at all, either symbolically or substantively.Greenwashers (“mere talk” strategy)—companies whose efforts are primarily focused on symbolic actions.Silent Saints (“mere walk” strategy)—companies whose efforts are primarily focused on substantive actions.Balanced Engagers (“walk the talk” strategy)—companies demonstrating a high level of both symbolic and substantive actions.  |\n|  Siano et al. [12] | Communicative constitution of organizations perspective, social theory | One German company2012-2014 | Deceptive manipulation—deliberate conduct in which sustainability communication is used to manipulate business practices, creating the appearance of genuine corporate sustainability through intentionally misleading statements.  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A4. Cont.\n\n|  Authors | Theoretical Framework | Research Sample Characteristics | Characteristics of Strategic Approaches  |\n| --- | --- | --- | --- |\n|  Talbot and Barbat [67] | Impression management theory | 58 sustainability reports published by mining companies from different countries2015 | Strategic omission—deliberately omitting information that could negatively affect perceptions of the company's water performance (e.g., presenting incomplete data).Obfuscation—manipulating figures and information to obscure the intended message (e.g., providing non-aggregated data or using new measures to influence stakeholders' perceptions).Minimizing the impact of mining on water resources—emphasizing that the water used is of poor quality and is reused multiple times in production processes.Relativizing poor water performance—contextualizing poor water performance by considering other factors or situating it within a broader temporal and environmental context.  |\n|  Yuan et al. [72] | Signaling theory | A sample of 7427 observations from Chinese listed companies2011–2020 | Exaggerating—overstating environmental efforts, creating a gap between actual performance and disclosed information.Distracting—presenting an appearance of pursuing one path while following a different course, highlighting a gap between perceived strengths and actual concerns.Window-dressing—making superficial adjustments to reports or disclosures to appear favorable, reflecting a gap between material and immaterial aspects.  |\n\nTable A5. Summary of Studies on Approaches and Analytical Techniques for Measuring Greenwashing in Sustainability Reporting Using Content Analysis.\n\n|  Authors | Measurement Approach/Analytical Technique | Research Sample Characteristics | Type of Data |   | Method of Data Acquisition | Sustainability Focus  |   |   |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n|   |   |   |  Content Analysis-Based | Database-Sourced |   | E | S | G  |\n|  Ates [137] | O | 403 firm-year observations of energy and energy-utility companies from the BRIC countries2009–2016 | X | X | Content analysis of ESG reports downloaded from the GRI Sustainability Disclosure Database (SDD),Panel data from Thomson Reuters Datastream Asset4 database (now LSEG Data) | X | X | X  |\n|  Cao et al. [116] | S/M | 350 data samples from 100 enterprises included in the Shanghai Stock Exchange Social Responsibility Index2016 to 2020 | X |  | Content analysis of CSR and sustainability reports | X |  |   |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A5. Cont.\n\n|  Authors | Measurement Approach/Analytical Technique | Research Sample Characteristics | Type of Data |   | Method of Data Acquisition | Sustainability Focus  |   |   |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n|   |   |   |  Content Analysis-Based | Database-Sourced |   | E | S | G  |\n|  Chen et al. [92] | D/P TA | 1053 observations from Chinese listed companies 2010-2019 | X | X | Content analysis of ESG reportsData drawn from Chinese Research Data Services Platform (CNRDS) | X | X | X  |\n|  Chen and Ma [91] | D/P TA | 929 Chinese listed companies 2011-2021 | X | X | Content analysis of ESG-related news reportsPanel data drawn from the Bloomberg database | X | X | X  |\n|  Cho et al. [80] | VA | 120 sustainability reports from companies representing the 20 largest publicly traded companies from six different countries | X |  | Content analysis of CSR reports | X | X | X  |\n|  Coen et al. [84] | D/P | 725 CSR reports published by 30 companies listed on the Dow Jones Industrials 2010-2019 | X | X | Automated content analysis and natural language processing of CSR reportsPanel data drawn from Thomson Reuters Refinitiv platform (now LSEG Data) | X |  |   |\n|  Conrad and Holtbrügge [121] | TA | Eight large multinational companies representing the aircraft and automotive industry 2012-2019 | X |  | Linguistic content analysis of CSR reports | X | X | X  |\n|  Contreras-Pacheco and Claasen [136] | RG | Case study of a North American-based company in the Colombian coal-mining industry 2013-2014 | X |  | Content analysis of sustainability disclosures, press releases, internal communications, professional presentations, governmental proceedings, and media items | X |  |   |\n|  Corciolani et al. [131] | RA RG | 1259 CSR reports from 135 large, publicly listed companies from the Forbes Global 2000 rankings 1995-2014 | X | X | Content analysis of CSR reports or CSR section in the annual reportsData retrieved from the Business and Human Rights Resource Centre | X | X | X  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A5. Cont.\n\n|  Authors | Measurement Approach/Analytical Technique | Research Sample Characteristics | Type of Data |   | Method of Data Acquisition | Sustainability Focus  |   |   |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n|   |   |   |  Content Analysis-Based | Database-Sourced |   | E | S | G  |\n|  Cormier and Gomez-Gutierrez [85] | D/P | 239 Canadian companies, 120 French companies, and 109 German companies2012-2014 | X | X | Content analysis of CSR reports or environmental sections of annual reportsPanel data drawn from Bloomberg database | X |  |   |\n|  Costa et al. [108] | S/S | 376 companies publishing sustainability reports in accordance with the GRI standard2018 | X |  | Content analysis of sustainability reports | X | X | X  |\n|  Cüre et al. [81] | VA | 49 corporate reports (35 standalone sustainability reports, 11 annual reports, and 3 integrated reports)2017 | X |  | Content analysis of CSR reports | X | X | X  |\n|  Du [135] | RG | 561 observations from Chinese companies2011-2012 | X | X | Content analysis of environmental information from annual reports, CSR reports, and other disclosuresPanel data from the South Weekend | X |  |   |\n|  Du et al. [96] | D/P | 1553 companies listed on the Shanghai and Shenzhen stock exchanges2008-2010 | X |  | Content analysis of environmental information from annual reports, CSR reports, and other disclosures | X |  |   |\n|  Esterhuyse and du Toit [120] | TA RA | 154 large international companies2015-2019 | X |  | Computerized narrative analysis of human rights disclosures |  | X |   |\n|  Fabrizio et al. [128] | RA | 5462 firm-year observations from different countries2010-2015 |  | X | Content analysis of CDP's Climate Change SurveyScores drawn from CDP | X |  |   |\n|  Fiandrino et al. [111] | S/M | Five Italian F&B listed companies2017 | X |  | Content analysis of sustainability reports, mandatory non-financial statements, and companies' sustainability-related websites | X | X | X  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A5. Cont.\n\n|  Authors | Measurement Approach/Analytical Technique | Research Sample Characteristics | Type of Data |   | Method of Data Acquisition | Sustainability Focus  |   |   |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n|   |   |   |  Content Analysis-Based | Database-Sourced |   | E | S | G  |\n|  Fisher et al. [119] | TA RA | 34 New Zealand companies from the NZX50 (215 individual texts) and 89 Australian companies from the ASX100 (603 individual texts) 2008-2009 | X |  | Computerized content analysis of standalone CSR reports and annual reports | X | X | X  |\n|  Friedel [79] | VA | Four fossil fuel production companies 2005-2007 | X |  | Visual content analysis | X | X |   |\n|  García-Sánchez [69] | TA | 69 Spanish companies listed on the Madrid Stock Exchange | X |  | Content analysis and descriptive textual analysis of SDG-related reports | X | X | X  |\n|  Gorovaia and Makrominas [113] | S/M TA RA RG | 1120 CSR reports published by 441 companies 2008-2022 | X | X | Content analysis of CSR reports Data drawn from MSCI KLD STATS and LSEG Data | X |  |   |\n|  Hamza and Jarboui [124] | TA | 539 firm-year observations for 77 French companies 2010-2016 | X | X | Content analysis of CSR reports Data drawn from the DataStream database and Asset 4 database published by Thomson Reuters | X | X | X  |\n|  Hrasky [133] | VA | 41 sustainability reports from Australian ASX Top 200 companies 2008-2009 | X |  | Content analysis of sustainability reports | X | X | X  |\n|  Huang and Huang [115] | S/M | 318 A-share listed companies from China 2010-2016 | X |  | Content analysis of environmental reports, CSR or sustainable development reports | X |  |   |\n|  Huang et al. [117] | S/M | 1619 firm-year observations from 318 Chinese A-share listed companies in heavily polluting industry 2010-2016 | X |  | Content analysis of environmental information disclosures in independent reports | X |  |   |\n|  Huq and Carling [30] | S/S | 4459 reports across 82 countries from eight sectors 2007-2017 | X |  | Content analysis of CSR reports using natural language processing (NLP) techniques | X |  |   |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A5. Cont.\n\n|  Authors | Measurement Approach/Analytical Technique | Research Sample Characteristics | Type of Data |   | Method of Data Acquisition | Sustainability Focus  |   |   |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n|   |   |   |  Content Analysis-Based | Database-Sourced |   | E | S | G  |\n|  Khalil and O'Sullivan [24] | S/S | 34 Lebanese banks2014 | X |  | Content analysis of online CSR reports | X | X |   |\n|  Khan et al. [104] | S/S | 300 firm-year observations from 50 New Zealand companies2015-2020 | X |  | Content analysis of sustainability and non-financial reports | X |  |   |\n|  Kim and Lyon [100] | D/P | 837 observations from 98 U.S. investor-owned electric utilities participating in the DOE's voluntary greenhouse gas reporting program1995-2003 | X | X | Content analysis of reports containing self-claimed greenhouse gas emissions reductions data collected from the DOE's Voluntary Reporting of Greenhouse Gases Program websitePanel data drawn from the Federal Energy Regulatory Commission (FERC) | X |  |   |\n|  Kim and Lyon [7] | D/P | 396 firm-year observations from 54 U.S. investor-owned electric utility companies participating in the DOE's voluntary greenhouse gas reporting program1995-2003 | X | X | Content analysis of reports containing self-claimed greenhouse gas emissions reductions data collected from the DOE's Voluntary Reporting of Greenhouse Gases Program websitePanel data drawn from FERC | X |  |   |\n|  Kim et al. [86] | D/P | 46 Korean KOSPI200 companies2021 | X | X | Content analysis of ESG reports and negative ESG-related newsPanel data drawn from KOSPI200 ESG Scope Data | X | X | X  |\n|  Lagasio [87] | D/P | 749 companies listed worldwide2023 | X | X | Content analysis of sustainable reports using NLP techniquesData drawn from Refinitiv Database (now LSEG Data) | X | X | X  |\n|  Lee and Raschke [23] | D/P | 39 multinational companies from three sectors (automotive, technology, and food and beverage)2019 | X | X | Content analysis of ESG reportsData drawn from Refinitiv Financial Markets Database | X | X | X  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A5. Cont.\n\n|  Authors | Measurement Approach/Analytical Technique | Research Sample Characteristics | Type of Data |   | Method of Data Acquisition | Sustainability Focus  |   |   |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n|   |   |   |  Content Analysis-Based | Database-Sourced |   | E | S | G  |\n|  Lewis [141] | O | 25 multinational corporations from the Fortune Global 2502011-2013 | X |  | Content analysis of CSR reports | X |  |   |\n|  Li et al. [101] | S/S | 2132 observations of listed companies on Shenzhen and Shanghai stock exchanges1993 | X | X | Content analysis of CSR/sustainability and annual reportsData drawn from Rankins CSR Ratings (RKS) database | X | X | X  |\n|  Li et al. [96] | D/P | 735 companies listed on the Shanghai and Shenzhen stock exchanges2013-2017 | X |  | Content analysis of CSR reports | X |  |   |\n|  Li et al. [122] | TA | 4624 firm-year observations across 833 Chinese companies with CSR reports2007-2017 | X | X | Content analysis of data extracted from the WinGo Text Data PlatformPanel data drawn from CSMAR database, and WinGo financial text data platform | X | X | X  |\n|  Liang and Wu [126] | TA | 3075 firm-year observations from Chinese listed companies2006-2016 | X | X | Textual analysis of CSR reportsPanel data drawn from the Chinese Research Data Services (CNRDS) database and the CSMAR Database | X | X | X  |\n|  Liao et al. [121] | TA RA | 7332 valid observations from A-share Chinese listed companies2015-2021 | X | X | Content analysis of ESG reports and financial report comment lettersPanel data drawn from the Bloomberg ESG database and CSI ESG database (China Securities Index) | X | X | X  |\n|  Makrenko et al. [118] | S/M | 97 Ukrainian agriculture companies2020 | X |  | Content analysis of sustainability reports | X | X | X  |\n|  Martínez-Ferrero et al. [74] | TA RA | 273 international companies2007-2014 | X | X | Content analysis of CSR reportsPanel data drawn from Thomson Reuters Eikon and Ethical Investment Research Services (EIRIS) | X | X |   |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A5. Cont.\n\n|  Authors | Measurement Approach/Analytical Technique | Research Sample Characteristics | Type of Data |   | Method of Data Acquisition | Sustainability Focus  |   |   |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n|   |   |   |  Content Analysis-Based | Database-Sourced |   | E | S | G  |\n|  Mobus [134] | RG | One multinational energy exploration and development corporation (CSR report and report of the National Commission, 45 articles in 7 newspapers covering the rig disaster)2009-2010 | X |  | Content analysis of the CSR report, the final report of the National Commission on the BP Deepwater Horizon Oil Spill and Offshore Drilling, and related newspaper articles | X | X |   |\n|  Nazari et al. [129] | RA | 1180 firm-year observations from U.S. companies listed on the S&P 500 Index that published voluntary, independent CSR reports.2008-2013 | X | X | Content analysis of CSR reportPanel data drawn from KLD database | X | X | X  |\n|  Nilipour et al. [130] | RA | 264 research observations collected from 37 New Zealand companies that report sustainability information2007-2016 | X |  | Textual analysis of sustainability information disclosed in annual reports and stand-alone reports | X | X | X  |\n|  Noronha and Wang [13] | RG | One Taiwanese multinational electronics manufacturer2010-2011 | X |  | Content analysis of CSR reports and external reports related to the investigated company |  | X |   |\n|  Pan et al. [132] | RA | 901 observations with 190 distinct Chinese SMEs | X |  | Content analysis of CSR reports and machine learning-based analysis | X | X | X  |\n|  Pimonenko et al. [109] | S/M | Three large Ukrainian manufacturing companies2014-2017 | X |  | Content analysis of financial and non-financial reports and websites | X |  |   |\n|  Roszkowska-Menkes et al. [9] | RG | 168 reports published by 31 companies across six industries in which 99 controversies and 333 negative events occurred2008-2019 | X | X | Content analysis of sustainability, CSR, and integrated reports or the sustainability/CSR sections within annual reportsData derived from the MSCI ESG Controversies database | X | X | X  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A5. Cont.\n\n|  Authors | Measurement Approach/Analytical Technique | Research Sample Characteristics | Type of Data |   | Method of Data Acquisition | Sustainability Focus  |   |   |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n|   |   |   |  Content Analysis-Based | Database-Sourced |   | E | S | G  |\n|  Ruiz-Blanco et al. [1] | D/P | 100 largest US-listed companies2013-2016 | X | X | Content analysis of sustainability disclosures in the sustainability reports and annual reportsPanel data drawn from the Bloomberg ESG database | X | X |   |\n|  Sauerwald and Su [93] | D/P TA | 1003 observations from companies listed on the Standard & Poor's (S&P) 500 index2006-2014 | X | X | Content analysis of CSR reportsPanel data drawn from Compustat ExecuComp and Institutional Shareholder Services and KLD STATS | X | X | X  |\n|  Siano et al. [12] | RG | One German company (3 CSR reports and 1151 headlines of the top 25 U.S. daily newspapers)2012-2014 | X |  | Content analysis of CSR reports and newspaper headlinesSemi-structured interviews with former managers | X |  |   |\n|  Song and Chen [88] | D/P | 20,875 firm-year observations from Chinese listed companies2010 to 2022 | X | X | Content analysis of CSR reportsPanel data drawn from the ESG rating scores from CNRDS | X |  |   |\n|  Tashman et al. [11] | D/P | 333 firm-year observations for 93 emerging market multinational enterprises (EM-MNEs)2005-2012 | X | X | Content analysis of ESG reportsPanel data drawn from the Morgan Stanley Capital International (MSCI) IVA (Intangible Value Assessment) database | X | X | X  |\n|  Van Der Ploeg and Vanclay [6] | S/S | One demonstration case of an international natural gas trading company2010-2011 | X |  | Content analysis of annual report and sustainability report | X | X | X  |\n|  Wang et al. [25] | RA | 331 CSR reports issued by 168 US-based large companies2009-2012 | X | X | Content analysis of CSR reportsPanel data drawn from the Bloomberg ESG database and the KLD social rating database | X | X | X  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A5. Cont.\n\n|  Authors | Measurement Approach/Analytical Technique | Research Sample Characteristics | Type of Data |   | Method of Data Acquisition | Sustainability Focus  |   |   |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n|   |   |   |  Content Analysis-Based | Database-Sourced |   | E | S | G  |\n|  Wedari et al. [89] | D/P | 150 Australian company-year observations2016-2017 | X | X | Content analysis of climate-related information in stand-alone sustainability reports, annual reports, and corporate websitesPanel data on carbon emissions drawn from Clean Energy Regulator websitePanel data drawn from the Refinitiv ASSET4 Environmental Pillar (now LSEG Data) | X |  |   |\n|  Xing et al. [102] | S/S | 9711 observations from 1086 manufacturing enterprises listed on the Shanghai and Shenzhen Stock Exchanges2007-2017 | X | X | Content analysis of corporate CSR reports and annual reportsPanel data on green innovation drawn from the CSMAR (China Stock Market and Accounting Research) database (manually selected based on the general patent data) | X |  |   |\n|  Xu et al. [103] | S/S | 8304 observations from 1241 Chinese listed companies2010-2021 | X |  | Content analysis of sustainability reports, ESG reports, social responsibility reports | X | X | X  |\n|  Yu et al. [114] | S/M | 553 Chinese A-share heavy-polluting listed companies2013-2020 | X | X | Content analysis of CSR reportsPanel data drawn from the WinGo database (financial data) | X | X | X  |\n|  Zahid et al. [90] | D/P | 14,344 firm-year observations for 2657 Chinese A-share companies listed on the Shanghai and Shenzhen stock exchanges2010-2019 | X | X | Content analysis of ESG reportsPanel data drawn from HEXUN-RKS database | X | X | X  |\n|  Zhang [90] | D/P TA | 4757 firm-year observations from Chinese listed companies2010-2019 | X | X | Content analysis of CSR reportsPanel data drawn from the Hexun website (CSR performance rating data) | X | X | X  |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A5. Cont.\n\n|  Authors | Measurement Approach/Analytical Technique | Research Sample Characteristics | Type of Data |   | Method of Data Acquisition | Sustainability Focus  |   |   |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n|   |   |   |  Content Analysis-Based | Database-Sourced |   | E | S | G  |\n|  Zhang et al. [105] | S/S | 454 Chinese A-share listed companies2007-2018 | X |  | Content analysis of sustainable development reports, green development reports, CSR reports, and environment-related information in corporate official websites | X |  |   |\n|  Zhang et al. [106] | S/S | 244 Chinese A-share listed companies2010-2018 | X |  | Content analysis of sustainable development reports, green development reports, CSR reports, and environment-related information in corporate official websites | X |  |   |\n|  Zhang et al. [107] | S/S | 6510 observations from Chinese A-share listed companies2010-2018 | X |  | Content analysis of sustainable development reports, green development reports, and CSR reports | X |  |   |\n|  Zharfpeykan [110] | S/M TA | 12 Australian financial services companies(107 reports) and 16 mining and metals companies(122 reports)2011-2019 | X |  | Content analysis of sustainability reports | X | X |   |\n|  Zharfpeykan and Akroyd [142] | O | 12 mining and metals companies(108 reports) and 12 financial services companies(105 reports)2011-2019187 top managers responsible for sustainability reporting in Australian companies | X |  | Content analysis of the sustainability reportsSurvey conducted among top managers responsible for sustainability reporting | X | X | X  |\n|  Zhou and Chen [97] | D/P | Chinese A-share listed companies2012-2021 | X |  | Content analysis of annual reports(\"Management Discussion and Analysis\" section covering corporate activities, strategies, challenges and future plans regarding environmental aspects) | X |  |   |\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\nTable A5. Cont.\n\n|  Authors | Measurement Approach/Analytical Technique | Research Sample Characteristics | Type of Data |   | Method of Data Acquisition | Sustainability Focus  |   |   |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- |\n|   |   |   |  Content Analysis-Based | Database-Sourced |   | E | S | G  |\n|  Zhou et al. [98] Zhou et al. [99] | D/P | Chinese A-share listed companies 2012-2021 | X |  | Content analysis of annual reports (\"Management Discussion and Analysis\" section covering corporate activities, strategies, challenges and future plans regarding environmental aspects) | X |  |   |\n|  Zhu et al. [112] | S/M | 182 listed heavily polluting companies in China that have published CSR report 2012-2021 | X |  | Content analysis of CRS report | X | X | X  |\n\nNotes: D/P—Disclosure-Performance Gap Approach; S/S—Symbolic-Substantive Disclosure Approach; S/M—Selective and Manipulative Disclosure Approach; TA—Tone Analysis; RA—Readability Analysis; VA—Visual Imagery Analysis; RG—Real Greenwashing; O—Oversimplified Assumptions of Greenwashing.\n\n# References\n\n1. Ruiz-Blanco, S.; Romero, S.; Fernandez-Feijoo, B. Green, blue or black, but washing-What company characteristics determine greenwashing? Environ. Dev. Sustain. 2022, 24, 4024-4045. [CrossRef]\n2. Seele, P.; Gatti, L. Greenwashing revisited: In search of a typology and accusation-based definition incorporating legitimacy strategies. Bus. Strategy Environ. 2017, 26, 239-252. [CrossRef]\n3. Delmas, M.A.; Burbano, V.C. The drivers of greenwashing. Calif. Manag. Rev. 2011, 54, 64-87. [CrossRef]\n4. Bowen, F. After Greenwashing: Symbolic Corporate Environmentalism and Society; Cambridge University Press: Cambridge, UK, 2014; 295p. [CrossRef]\n5. Lyon, T.P.; Maxwell, J.W. Greenwash: Corporate environmental disclosure under threat of audit. J. Econ. Manag. Strategy 2011, 20, 3-41. [CrossRef]\n6. Van Der Ploeg, L.; Vanclay, F. Credible claim or corporate spin? A checklist to evaluate corporate sustainability reports. J. Environ. Assess. Policy Manag. 2013, 15, 1350012. [CrossRef]\n7. Kim, E.-H.; Lyon, T.P. Greenwash vs. Brownwash: Exaggeration and undue modesty in corporate sustainability disclosure. Organ. Sci. 2015, 26, 633-940. [CrossRef]\n8. Walker, K.; Wan, F. The Harm of Symbolic Actions and Green-Washing: Corporate Actions and Communications on Environmental Performance and Their Financial Implications. J. Bus. Ethics 2012, 109, 227-242. [CrossRef]\n9. Roszkowska-Menkes, M.; Aluchna, M.; Kamiński, B. True transparency or mere decoupling? The study of selective disclosure in sustainability reporting. Crit. Perspect. Account. 2024, 98, 102700. [CrossRef]\n10. Schons, L.; Steinmeier, M. Walk the Talk? How Symbolic and Substantive CSR Actions Affect Firm Performance Depending on Stakeholder Proximity. Corp. Soc. Respon. Environ. Manag. 2016, 23, 358-372. [CrossRef]\n11. Tashman, P.; Marano, V.; Kostova, T. Walking the walk or talking the talk? Corporate social responsibility decoupling in emerging market multinationals. J. Int. Bus. Stud. 2019, 50, 153-171. [CrossRef]\n12. Siano, A.; Vollero, A.; Conte, F.; Amabile, S. \"More than words\": Expanding the taxonomy of greenwashing after the Volkswagen scandal. J. Bus. Res. 2017, 71, 27-37. [CrossRef]\n13. Noronha, C.; Wang, S.X. Corporate social disclosure and performance gap: Greenwashing Foxconn's Shenzhen factories. In Corporate Social Disclosure: Critical Perspectives in China and Japan; Noronha, C., Ed.; Palgrave Macmillan: London, UK, 2015; pp. 59-86. [CrossRef]\n14. Ramus, C.; Montiel, I. When are corporate environmental policies a form of greenwashing? Bus. Soc. 2005, 44, 377-414. [CrossRef]\n15. Bromley, P.; Powell, W.W. From smoke and mirrors to walking the talk: Decoupling in the contemporary world. Acad. Manag. Ann. 2012, 6, 483-530. [CrossRef]\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\n16. TerraChoice. The \"Six Sins of Greenwashing TM\" A Study of Environmental Claims in North American Consumer Markets; TerraChoice Environmental Marketing Inc.: Ottawa, ON, Canada, 2007. Available online: https://sustainability.usask.ca/documents/Six_Sins_of_Greenwashing_nov2007.pdf (accessed on 15 January 2025).\n17. Merkl-Davies, D.M.; Brennan, N.M.; McLeay, S.J. Impression management and retrospective sense-making in corporate narratives: A social psychology perspective. Account. Audit. Account. J. 2011, 24, 315-344. [CrossRef]\n18. TerraChoice. The Sins of Greenwashing, Home and Family Edition 2010: Report on Environmental Claims Made in the North American Consumer Market, 2010. Available online: https://www.twosides.info/wp-content/uploads/2018/05/Terrachoice_The_Sins_of_Greenwashing_-_Home_and_Family_Edition_2010.pdf (accessed on 15 January 2025).\n19. Cliath, A.G. Seeing shades: Ecological and socially just labeling. Organ. Environ. 2007, 20, 413-439. [CrossRef]\n20. Snyder, R. Misleading characteristics of implied-superiority claims. J. Advert. 1989, 18, 54-61. [CrossRef]\n21. Capelle-Blancard, G.; Petit, A. Every little helps? ESG news and stock market reaction. J. Bus. Ethics 2019, 157, 543-565. [CrossRef]\n22. Xia, F.; Chen, J.; Yang, X.; Li, X.; Zhang, B. Financial constraints and corporate greenwashing strategies in China. Corp. Soc. Resp. Environ. Manag. 2023, 30, 1770-1781. [CrossRef]\n23. Lee, M.T.; Raschke, R.L. Stakeholder legitimacy in firm greening and financial performance: What about greenwashing temptations? J. Bus. Res. 2023, 155, 113393. [CrossRef]\n24. Khalil, S.; O'Sullivan, P. Corporate social responsibility: Internet social and environmental reporting by banks. *Meditari Account. Res.* 2017, 25, 414-446. [CrossRef]\n25. Wang, Z.; Hsieh, T.S.; Sarkis, J. CSR performance and the readability of CSR reports: Too good to be true? Corp. Soc. Responsib. Environ. Manag. 2018, 25, 66-79. [CrossRef]\n26. Laskin, A.V.; Mikhailovna Nesova, N. The Language of Optimism in Corporate Sustainability Reports: A Computerized Content Analysis. Bus. Prof. Commun. Q. 2022, 85, 80-98. [CrossRef]\n27. Blome, C.; Kai, F.; Schleper, M.C. Antecedents of green supplier championing and greenwashing: An empirical study on leadership and ethical incentives. J. Clean. Prod. 2017, 152, 339-350. [CrossRef]\n28. Bernini, F.; Giuliani, M.; Rosa, F.L. Measuring greenwashing: A systematic methodological literature review. Bus. Ethics Environ. Responsib. 2024, 33, 649-667. [CrossRef]\n29. Hummel, K.; Schlick, C. The relationship between sustainability performance and sustainability disclosure—Reconciling voluntary disclosure theory and legitimacy theory. J. Account. Public Policy 2016, 35, 455–476. [CrossRef]\n30. Huq, A.M.; Carling, K. Measuring accountable information in CSR reports: A new operationalization and analysis applied to greenhouse gas disclosures. J. Emerg. Technol. Account. 2024, 21, 59-88. [CrossRef]\n31. Li, J.; Wu, D.A. Do corporate social responsibility engagements lead to real environment, social, and governance impact? Manag. Sci. 2020, 66, 2564-2588. [CrossRef]\n32. Bernini, F.; La Rosa, F. Research in the greenwashing field: Concepts, theories, and potential impacts on economic and social value. J. Manag. Gov. 2024, 28, 405-444. [CrossRef]\n33. De Freitas Netto, S.V.; Sobral, M.F.F.; Ribeiro, A.R.B.; Soares, G.R.L. Concepts and forms of greenwashing: A systematic review. Environ. Sci. Eur. 2020, 32, 19. [CrossRef]\n34. Gatti, L.; Seele, P.; Rademacher, L. Grey Zone in—Greenwash Out. A Review of Greenwashing Research and Implications for the Voluntary-Mandatory Transition of CSR. Int. J. Corp. Soc. Responsib. 2019, 4, 6. [CrossRef]\n35. Liu, Y.; Li, W.; Wang, L.; Meng, Q. Why greenwashing occurs and what happens afterwards? A systematic literature review and future research agenda. *Environ. Sci. Pollut. Res.* 2023, 30, 118102-118116. [CrossRef] [PubMed]\n36. Lyon, T.P.; Montgomery, A.W. The means and end of greenwashing. Organ. Environ. 2015, 28, 223-249. [CrossRef]\n37. Montgomery, A.W.; Lyon, T.P.; Barg, J. No End in Sight? A Greenwash Review and Research Agenda. Organ. Environ. 2024, 37, 221-256. [CrossRef] [PubMed]\n38. Santos, C.; Coelho, A.; Marques, A. A systematic literature review on greenwashing and its relationship to stakeholders: State of art and future research agenda. Manag. Rev. Q. 2024, 74, 1397-1421. [CrossRef]\n39. Velte, P. Determinants and consequences of corporate social responsibility decoupling—Status quo and limitations of recent empirical quantitative research. Corp. Soc. Responsib. Environ. Manag. 2023, 30, 2695–2717. [CrossRef]\n40. Cepeda, C.; Monteiro, A.P.; Aibar-Guzman, B. Decoupling in Sustainability Reporting: A Systematic Literature Review. Corp. Soc. Responsib. Environ. Manag. 2025, 32, 2988-3007. [CrossRef]\n41. Sneideriene, A.; Legenzova, R. Greenwashing prevention in environmental, social, and governance (ESG) disclosures: A bibliometric analysis. Res. Int. Bus. Financ. 2025, 74, 102720. [CrossRef]\n42. Sundarasen, S.; Zyznarska-Dworczak, B.; Goel, S. Sustainability reporting and greenwashing: A bibliometrics assessment in G7 and non-G7 nations. Cogent Bus. Manag. 2024, 11, 2320812. [CrossRef]\n43. Zioło, M.; Bak, I.; Spoz, A. Literature review of greenwashing research: State of the art. Corp. Soc. Responsib. Environ. Manag. 2024, 31, 5343-5356. [CrossRef]\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\n44. Lublóy, Á.; Keresztúri, J.L.; Berlinger, E. Quantifying firm-level greenwashing: A systematic literature review. J. Environ. Manag. 2025, 373, 123399. [CrossRef]\n45. Moodaley, W.; Telukdarie, A. Greenwashing, Sustainability Reporting, and Artificial Intelligence: A Systematic Literature Review. Sustainability 2023, 15, 1481. [CrossRef]\n46. Tranfield, D.; Denyer, D.; Smart, P. Towards a methodology for developing evidence—Informed management knowledge by means of systematic review. Br. J. Manag. 2003, 14, 207–222. [CrossRef]\n47. Denyer, D.; Tranfield, D. Producing a systematic review. In The Sage Handbook of Organizational Research Methods; Buchanan, D.A., Bryman, A., Eds.; SAGE Publications Ltd.: Thousand Oaks, CA, USA, 2009; pp. 671-689.\n48. Page, M.J.; McKenzie, J.E.; Bossuyt, P.M.; Boutron, I.; Hoffmann, T.C.; Mulrow, C.D.; Shamseer, L.; Tetzlaff, J.M.; Akl, E.A.; Brennan, S.U.; et al. The PRISMA 2020 statement: An updated guideline for reporting systematic reviews. BMJ 2021, 372, 71. [CrossRef]\n49. Jambor, A.; Zanócz, A. The Diversity of Environmental, Social, and Governance Aspects in Sustainability: A Systematic Literature Review. Sustainability 2023, 15, 13958. [CrossRef]\n50. Chistov, V.; Aramburu, N.; Carrillo-Hermosilla, J. Open eco-innovation: A bibliometric review of emerging research. J. Clean. Prod. 2021, 311, 127627. [CrossRef]\n51. Rosili, N.A.K.; Zakaria, N.H.; Hassan, R.; Kasim, S.; Rose, F.Z.C.; Sutikno, T. A systematic literature review of machine learning methods in predicting court decisions. IAES Int. J. Artif. Intell. 2021, 10, 1091. [CrossRef]\n52. Ali, W.; Frynas, J.G.; Mahmood, Z. Determinants of corporate social responsibility (CSR) disclosure in developed and developing countries: A literature review. Corp. Soc. Responsib. Environ. Manag. 2017, 24, 273-294. [CrossRef]\n53. Christensen, H.B.; Hail, L.; Leuz, C. Mandatory CSR and sustainability reporting: Economic analysis and literature review. Rev. Account. Stud. 2021, 26, 1176-1248. [CrossRef]\n54. Dienes, D.; Sassen, R.; Fischer, J. What are the drivers of sustainability reporting? A systematic review. Sustain. Account. Manag. Policy J. 2016, 7, 154-189. [CrossRef]\n55. Hahn, R.; Kühnen, M. Determinants of sustainability reporting: A review of results, trends, theory, and opportunities in an expanding field of research. J. Clean. Prod. 2013, 59, 5-21. [CrossRef]\n56. López-Fernández, M.C.; Serrano-Bedia, A.M.; Pérez-Pérez, M. Entrepreneurship and family firm research: A bibliometric analysis of an emerging field. J. Small Bus. Manag. 2015, 1, 18. [CrossRef]\n57. Thomas, G.; Lynch, M.; Spencer, L.H. A Systematic Review to Examine the Evidence in Developing Social Prescribing Interventions That Apply a Co-Productive, Co-Designed Approach to Improve Well-Being Outcomes in a Community Setting. Int. J. Environ. Res. Public Health 2021, 18, 3896. [CrossRef]\n58. Pham, D.D.T.; Paillé, P.; Halilem, N. Systematic review on environmental innovativeness: A knowledge-based resource view. J. Clean. Prod. 2019, 211, 1088-1099. [CrossRef]\n59. Landis, J.R.; Koch, G.G. The measurement of observer agreement for categorical data. Biometrics 1977, 33, 159-174. [CrossRef] [PubMed]\n60. McHugh, M.L. Interrater reliability: The kappa statistic. Biochem. Medica 2012, 22, 276-282. Available online: https://hrcak.srce.hr/89395 (accessed on 15 January 2025). [CrossRef]\n61. Barnett-Page, E.; Thomas, J. Methods for the synthesis of qualitative research: A critical review. BMC Med. Res. Methodol. 2009, 9, 59. [CrossRef]\n62. Raith, L.; Bignill, J.; Stavropoulos, V.; Millear, P.; Allen, A.; Stallman, H.M.; Mason, J.; De Regt, T.; Wood, A.; Kannis-Dymand, L. Massively Multiplayer Online Games and Well-Being: A Systematic Literature Review. Front. Psychol. 2021, 12, 698799. [CrossRef]\n63. Amores-Salvado, J.; Martin-de Castro, G.; Albertini, E. Walking the talk, but above all, talking the walk: Looking green for market stakeholder engagement. Corp. Soc. Responsib. Environ. Manag. 2022, 30, 431-442. [CrossRef]\n64. Kurpierz, J.R.; Smith, K. The greenwashing triangle: Adapting tools from fraud to improve CSR reporting. Sustain. Account. Manag. Policy 2020, 11, 1075-1093. [CrossRef]\n65. Cooper, K.R.; Wang, R. From Reactionary to Revelatory: CSR Reporting in Response to the Global Refugee Crisis. Bus. Soc. 2024, 63, 185-212. [CrossRef]\n66. Khan, H.Z.; Bose, S.; Johns, R. Regulatory influences on CSR practices within banks in an emerging economy: Do banks merely comply? Crit. Perspect. Account. 2020, 71, 102096. [CrossRef]\n67. Talbot, D.; Barbat, G. Water disclosure in the mining sector: An assessment of the credibility of sustainability reports. Corp. Soc. Responsib. Environ. Manag. 2020, 27, 1241-1251. [CrossRef]\n68. Leung, T.C.-H.; Snell, R.S. Strategies for Social and Environmental Disclosure: The Case of Multinational Gambling Companies. J. Bus. Ethics 2021, 168, 447-467. [CrossRef]\n69. García-Sánchez, I.-M.; Amor-Esteban, V.; Galindo-Álvarez, D. Communication Strategies for the 2030 Agenda Commitments: A Multivariate Approach. Sustainability 2020, 12, 10554. [CrossRef]\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\n70. Hahn, R.; Lülfs, R. Legitimizing negative aspects in GRI-oriented sustainability reporting: A qualitative analysis of corporate disclosure strategies. J. Bus. Ethics 2014, 123, 401-420. [CrossRef]\n71. Saber, M.; Weber, A. Sustainable grocery retailing: Myth or reality?-A content analysis. Bus. Soc. Rev. 2019, 124, 479-496. [CrossRef]\n72. Yuan, X.; Xu, J.; Shang, L. Exaggerating, distracting, or window-dressing? An empirical study on firm greenwashing recognition. Financ. Res. Lett. 2024, 67, 105845. [CrossRef]\n73. Leung, T.C.-H.; Snell, R.S. Attraction or Distraction? Corporate Social Responsibility in Macao's Gambling Industry. J. Bus. Ethics 2017, 145, 637-658. [CrossRef]\n74. Martínez-Ferrero, J.; Suárez-Fernández, O.; García-Sánchez, I.-M. Obfuscation versus enhancement as corporate social responsibility disclosure strategies. Corp. Soc. Responsib. Environ. Manag. 2019, 26, 468-480. [CrossRef]\n75. Megura, M.; Gunderson, R. Better poison is the cure? Critically examining fossil fuel companies, climate change framing, and corporate sustainability reports. Energy Res. Soc. Sci. 2022, 85, 102388. [CrossRef]\n76. Laufer, W.S. Social accountability and corporate greenwashing. J. Bus. Ethics 2003, 43, 253-261. [CrossRef]\n77. Hejlova, D.; Ariestya, A.; Koudelkova, P.; Schneiderova, S. Strategic silence in corporate communication concerning deadstock and overstock in the fashion industry. Corp. Commun. 2025, 30, 294-312. [CrossRef]\n78. Gentile, G.; Gupta, J. Orchestrating the narrative: The role of fossil fuel companies in delaying the energy transition. Renew. Sustain. Energy Rev. 2025, 212, 115359. [CrossRef]\n79. Friedel, T.L. (Not so) crude text and images: Staging Native in 'big oil' advertising. Vis. Stud. 2008, 23, 238-254. [CrossRef]\n80. Cho, C.H.; Michelon, G.; Patten, D.M. Enhancement and obfuscation through the use of graphs in sustainability reports: An international comparison. Sustain. Account. Manag. Policy J. 2012, 3, 4-88. [CrossRef]\n81. Cure, T.; Esen, E.; Çalşkan, A.O. Impression Management in Graphical Representation of Economic, Social, and Environmental Issues: An Empirical Study. Sustainability 2020, 12, 379. [CrossRef]\n82. Nguyen, P.M.; Jubb, C.; Dias, R. Motives for environmental and social engagement and stock liquidity: The moderating role of sustainability committees. *Pac. Basin Financ.* J. 2024, 87, 102501. [CrossRef]\n83. Cho, C.H.; Laine, M.; Roberts, R.W.; Rodrigue, M. Organized hypocrisy, organizational facades, and sustainability reporting. Account. Org. Soc. 2015, 40, 78-94. [CrossRef]\n84. Coen, D.; Herman, K.; Pegram, T. Are corporate climate efforts genuine? An empirical analysis of the climate 'talk-walk' hypothesis. Bus. Strategy Environ. 2022, 31, 3040-3059. [CrossRef]\n85. Cormier, D.; Gomez-Gutierrez, L. On the search for mimetic patterns in environmental disclosure: An international perspective. Int. J. Sustain. Dev. World Ecol. 2018, 25, 655-671. [CrossRef]\n86. Kim, S.; Shin, Y.; Park, S.; Joel, S.; Kim, S.T.; Oh, J.H. Detecting greenwashing in sustainability disclosures: A prediction model for KOSPI 200 enterprises using ESG-BERT. In Proceedings of the IEEE International Conference on Big Data (BigData), Sorrento, Italy, 15-18 December 2023; pp. 6198-6200. [CrossRef]\n87. Lagasio, V. ESG-washing detection in corporate sustainability reports. Int. Rev. Financ. Anal. 2024, 96, 103742. [CrossRef]\n88. Song, J.; Chen, S. Is liability of foreignness always bad for firms? A study of the influence of top management team foreignness on corporate greenwashing. Bus. Strategy Environ. 2025, 34, 3360-3384. [CrossRef]\n89. Wedari, L.K.; Jubb, C.; Moradi-Motlagh, A. Corporate climate-related voluntary disclosures: Does potential greenwash exist among Australian high emitters reports? Bus. Strategy Environ. 2021, 30, 3721-3739. [CrossRef]\n90. Zahid, R.A.; Maqsood, U.S.; Irshad, S.; Khan, M.K. The role of women on board in combatting greenwashing: A new perspective on environmental performance. Bus. Ethics Environ. Responsib. 2025, 34, 121-136. [CrossRef]\n91. Chen, Y.; Ma, D. Detection of greenwashing in ESG reports of Chinese listed companies based on Word2vec and TF-IDF. In Proceedings of the 2024 International Conference on Innovation in Artificial Intelligence, Tokyo, Japan, 16–18 March 2024; pp. 159–164. [CrossRef]\n92. Chen, X.; Wan, P.; Wang, Q. Does ESG decoupling reduce customer stability? Evidence from China. Appl. Econ. 2024, 57, 6593-6611. [CrossRef]\n93. Sauerwald, S.; Su, W. CEO Overconfidence and CSR Decoupling. Corp. Gov. Int. Rev. 2019, 27, 283-300. [CrossRef]\n94. Zhang, Y. Analyst coverage and corporate social responsibility decoupling: Evidence from China. Corp. Soc. Resp. Environ. Manag. 2021, 29, 620-634. [CrossRef]\n95. Du, X.; Jian, W.; Zeng, Q.; Chang, Y. Do auditors applaud corporate environmental performance? Evidence from China. J. Bus. Ethics 2018, 151, 1049-1080. [CrossRef]\n96. Li, W.; Li, W.; Seppänen, V.; Koivumäki, T. Effects of greenwashing on financial performance: Moderation through local environmental regulation and media coverage. Bus. Strategy Environ. 2023, 32, 820-841. [CrossRef]\n97. Zhou, Y.; Chen, L. Public attention and \"Environmental Disclosure Greenwashing\": Pressure from oversight or incentive from legitimacy. China Financ. Rev. Int. 2024. [CrossRef]\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\n98. Zhou, Y.; Chen, L.; Peng, X.; Li, W. Impact of \"environmental disclosure greenwashing\": A study from the perspective of heterogeneous environmental policies. Environ. Dev. Sustain. 2024, 1-34. [CrossRef]\n99. Zhou, Y.; Chen, L.; Zhang, Y.; Li, W. \"Environmental disclosure greenwashing\" and corporate value: The premium effect and premium devalue of environmental information. Corp. Soc. Responsib. Environ. Manag. 2024, 31, 2424-2438. [CrossRef]\n100. Kim, E.H.; Lyon, T.P. Strategic environmental disclosure: Evidence from the DOE's voluntary greenhouse gas registry. J. Environ. Econ. Manag. 2011, 61, 311-326. [CrossRef]\n101. Li, W.; Lu, Y.; Li, W. Does CSR action provide insurance-like protection to tax-avoiding firms? Evidence from China. Sustainability 2019, 11, 5297. [CrossRef]\n102. Xing, C.; Zhang, Y.; Tripe, D. Green credit policy and corporate access to bank loans in China: The role of environmental disclosure and green innovation. Int. Rev. Financ. Anal. 2021, 77, 101838. [CrossRef]\n103. Xu, W.; Li, M.; Xu, S. Unveiling the \"Veil\" of information disclosure: Sustainability reporting \"greenwashing\" and \"shared value\". PLoS ONE 2023, 18, e0279904. [CrossRef] [PubMed]\n104. Khan, H.Z.; Houque, M.N.; Ielemia, I.K. Organic versus cosmetic efforts of the quality of carbon reporting by top New Zealand firms. Does market reward or penalise? Bus. Strategy Environ. 2023, 32, 686-703. [CrossRef]\n105. Zhang, K.; Pan, Z.; Janardhanan, M. Relationship between the Degree of Internationalization and Greenwashing of Environmental Responsibilities in China-Based on the Legitimacy Perspective. Sustainability 2022, 14, 2794. [CrossRef]\n106. Zhang, K.; Pan, Z.; Janardhanan, M. Relationship analysis between greenwashing and environmental performance. Environ. Dev. Sustain. 2023, 25, 7927-7957. [CrossRef]\n107. Zhang, K.; Pan, Z.; Zhang, K.; Ji, F. The effect of digitalization transformation on greenwashing of Chinese listed companies: An analysis from the dual perspectives of resource-based view and legitimacy. Front. Environ. Sci. 2023, 11, 1179419. [CrossRef]\n108. Costa, R.; Tiburzi, L.; Morales-Alonso, G.; Calabrese, A.; Rosati, F. SDG walking or washing? A cross-sectoral analysis of business contribution to the SDGs. Bus. Strat Environ. 2025, 34, 3561-3576. [CrossRef]\n109. Pimonenko, T.; Bilan, Y.; Horák, J.; Starchenko, L.; Gajda, W. Green Brand of Companies and Greenwashing under Sustainable Development Goals. Sustainability 2020, 12, 1679. [CrossRef]\n110. Zharfpeykan, R. Representative account or greenwashing? Voluntary sustainability reports in Australia's mining/metals and financial services industries. Bus. Strategy Environ. 2021, 30, 2209-2223. [CrossRef]\n111. Fiandrino, S.; Busso, D.; Vrontis, D. Sustainable responsible conduct beyond the boundaries of compliance: Lessons from Italian listed food and beverage companies. Br. Food J. 2019, 121, 1035-1049. [CrossRef]\n112. Zhu, F.; Fan, H.; Zheng, Z. The disclosure fog: Institutional investors and corporate greenwashing. Int. J. Financ. Econ. 2025, 30, 3856-3874. [CrossRef]\n113. Gorovaia, N.; Makrominas, M. Identifying greenwashing in corporate-social responsibility reports using natural-language processing. Eur. Financ. Manag. 2025, 31, 427-462. [CrossRef]\n114. Yu, Z.; Li, Y.; Li, X.; Yu, L. Can green finance policy curb corporate ESG report \"green washing\"?—Experiential evidence from Chinese listed companies. Appl. Econ. Lett. 2024, 32, 3069-3073. [CrossRef]\n115. Huang, R.; Huang, Y. Does internal control contribute to a firm's green information disclosure? Evidence from China. Sustainability 2020, 12, 3197. [CrossRef]\n116. Cao, Q.; Zhou, Y.; Du, H.; Ren, M.; Zhen, W. Carbon information disclosure quality, greenwashing behavior, and enterprise value. Front. Psychol. 2022, 13, 892415. [CrossRef] [PubMed]\n117. Huang, R.; Xie, X.; Zhou, H. 'Isomorphic' behavior of corporate greenwashing. Chin. J. Popul. Resour. Environ. 2022, 20, 29-39. [CrossRef]\n118. Makrenko, I.; Makarenko, S.; Rubanov, P. Greenwashing detection and impact on responsible business and investment: Case of Ukrainian companies (agriculture leaders), NILBEC 2022. In Leadership, Entrepreneurship and Sustainable Development Post COVID-19, Springer Proceedings in Business and Economics; Springer: Cham, Switzerland, 2023. [CrossRef]\n119. Fisher, R.; van Staden, C.J.; Richards, G. Watch that tone: An investigation of the use and stylistic consequences of tone in corporate accountability disclosures. Account. Audit. Account. J. 2020, 33, 77-105. [CrossRef]\n120. Esterhuyse, L.; Du Toit, E. Reporting on human rights by large corporates: Interplay between comprehensiveness and narrative manipulation. In Developments in Corporate Governance and Responsibility, Corporate Resilience; Seifi, S., Crowther, D., Eds.; Emerald Publishing Limited: Leeds, UK, 2023; Volume 21, pp. 219-242. [CrossRef]\n121. Conrad, M.; Holtbrügge, D. Antecedents of corporate misconduct: A linguistic content analysis of decoupling tendencies in sustainability reporting. Bus. Ethics Environ. Responsib. 2021, 30, 538-550. [CrossRef]\n122. Li, W.; Yan, T.; Li, Y.; Yan, Z. Earnings management and CSR report tone: Evidence from China. Corp. Soc. Responsib. Environ. Manag. 2023, 30, 1883-1902. [CrossRef]\n123. Huang, X.; Teoh, S.H.; Zhang, Y. Tone management. Account. Rev. 2014, 89, 1083-1113. [CrossRef]\n124. Hamza, S.; Jarboui, A. CSR or social impression management? Tone management in CSR reports. J. Financ. Report. Account. 2022, 20, 599-617. [CrossRef]\n\nhttps://doi.org/10.3390/su18010017\nSustainability 2026, 18, 17\n\n125. Liao, F.; Sun, Y.; Xu, S. Financial Report Comment Letters and Greenwashing in Environmental, Social and Governance Disclosures: Evidence from China. Energy Econ. 2023, 127, 107122. [CrossRef]\n126. Liang, X.; Wu, H. Does the Tone in Corporate Social Responsibility Reports Misdirect Analysts' Forecasts in China? Sustainability 2022, 14, 16631. [CrossRef]\n127. Hu, P.; Li, X.; Li, N.; Wang, Y.; Wang, D.D. Peeking into corporate greenwashing through the readability of ESG disclosures. Sustainability 2024, 16, 2571. [CrossRef]\n128. Fabrizio, K.R.; Kim, E.-H. Reluctant Disclosure and Transparency: Evidence from Environmental Disclosures. Organ. Sci. 2019, 30, 1207-1231. [CrossRef]\n129. Nazari, J.A.; Hrazdil, K.; Mahmoudian, F. Assessing social and environmental performance through narrative complexity in CSR reports. J. Contemp. Account. Econ. 2017, 13, 166-178. [CrossRef]\n130. Nilipour, A.; De Silva, T.A.; Li, X. The readability of sustainability reporting in New Zealand over time. Australas. Account. Bus. Financ. J. 2020, 14, 86-107. [CrossRef]\n131. Corciolani, M.; Nieri, F.; Tuan, A. Does involvement in corporate social irresponsibility affect the linguistic features of corporate social responsibility reports? Corp. Soc. Responsib. Environ. Manag. 2020, 27, 670-680. [CrossRef]\n132. Pan, X.; Chen, X.; Sinha, P. Navigating the haze: Environmental performance feedback and CSR report readability. J. Bus. Res. 2023, 166, 114116. [CrossRef]\n133. Hrasky, S. Visual disclosure strategies adopted by more and less sustainability-driven companies. Account. Forum 2012, 36, 154-165. [CrossRef]\n134. Mobus, J.L. Corporate social responsibility (CSR) reporting by BP: Revealing or obscuring risks? J. Leg. Ethical Regul. Issues 2012, 15, 35-52.\n135. Du, X. How the Market Values Greenwashing? Evidence from China. J. Bus. Ethics 2015, 128, 547-574. [CrossRef]\n136. Contreras-Pacheco, O.E.; Claasen, C. Fuzzy reporting as a way for a company to greenwash: Perspectives from the Colombian reality. Probl. Perspect. Manag. 2017, 15, 525-535. [CrossRef]\n137. Ates, S. The credibility of corporate social responsibility reports: Evidence from the energy sector in emerging markets. Soc. Responsib. J. 2023, 19, 756-773. [CrossRef]\n138. Karaman, A.S.; Orazalin, N.; Uyar, A.; Shahbaz, M. CSR achievement, reporting, and assurance in the energy sector: Does economic development matter? Energy Policy 2021, 149, 112007. [CrossRef]\n139. Koseoglu, M.A.; Uyar, A.; Kilic, M.; Kuzey, C.; Karaman, A.S. Exploring the connections among CSR performance, reporting, and external assurance: Evidence from the hospitality and tourism industry. Int. J. Hosp. Manag. 2021, 94, 102819. [CrossRef]\n140. Mahoney, L.S.; Thorne, L.; Cecil, L.; LaGore, W. A research note on standalone corporate social responsibility reports: Signaling or greenwashing? Crit. Perspect. Account. 2013, 24, 350-359. [CrossRef]\n141. Lewis, J.K. Corporate Social Responsibility/Sustainability Reporting Among the Fortune Global 250: Greenwashing or Green Supply Chain? Entrep. Bus. Econ. 2016, 1, 347-362. [CrossRef]\n142. Zharfpeykan, R.; Akroyd, C. Evaluating the outcome effectiveness of the global reporting initiative transitions. Sustain. Account. Manag. Policy J. 2023, 14, 1101-1125. [CrossRef]\n143. Reitmaier, C.; Schultze, W.; Vollmer, J. Corporate responsibility and corporate misbehavior: Are CSR reporting firms indeed responsible? Rev. Account. Stud. 2024, 30, 1804-1872. [CrossRef]\n\nDisclaimer/Publisher's Note: The statements, opinions and data contained in all publications are solely those of the individual author(s) and contributor(s) and not of MDPI and/or the editor(s). MDPI and/or the editor(s) disclaim responsibility for any injury to people or property resulting from any ideas, methods, instructions or products referred to in the content.\n\nhttps://doi.org/10.3390/su18010017"
    ]
}