[
    {
        "journal_name": "Corp Soc Responsibility Env - 2025 - Braam - CSR Decoupling and Assurance of CSR Reports  Do Combinations of Level  Scope _pdf",
        "abstract": "# ABSTRACT\n\nIn response to growing concerns about the credibility of corporate social responsibility (CSR) reports, this study examines the relationship between external assurance on CSR reports and CSR decoupling. Specifically, we explore how combinations of the level and scope of assurance, and the type of assurance provider are associated with a reduction in CSR decoupling. Using an international sample of publicly listed firms, we find that CSR decoupling is significantly reduced when firms obtain reasonable assurance together with either a broad assurance scope or an assurance provider from the auditing profession. These results suggest that reasonable assurance provides a necessary foundation for reducing CSR decoupling, but its effectiveness is contingent on its combination with either a broad assurance scope or an assurance provider from the auditing profession. This highlights the importance of comprehensive CSR assurance practices in meaningfully addressing the gap between CSR disclosure and performance, whereas CSR assurance practices that meet only the minimum standards primarily serve a symbolic role, enhancing legitimacy. We discuss the implications of these findings for policymakers and investors.",
        "introduction": "# 1 | Introduction\n\nThis study examines the relationship between external assurance on corporate social responsibility (CSR) reports and CSR decoupling. In response to growing pressures from investors and other stakeholders to become more accountable for the impacts of their activities on the environment and society, companies are expected—or even legally obliged—to enhance transparency. Although they increasingly disclose information on CSR performance (Lin et al. 2024), stakeholders remain concerned about CSR decoupling. Prior literature defines CSR decoupling as “a symbolic strategy whereby firms overstate their CSR performance in their disclosures to strengthen their legitimacy” (Tashman et al. 2019, 154; see also García-Sánchez et al. 2022;\n\nSauerwald and Su 2019). Companies may use CSR decoupling as a strategic tool to shape stakeholders' perceptions by communicating CSR actions that are not matched by substantive efforts (Hawn and Ioannou 2016; Marquis et al. 2016; Cho and Patten 2007).\n\nTo address increasing concerns from investors and other stakeholders about the credibility and reliability of the CSR information presented in CSR reports, CSR assurance serves as an external monitoring mechanism to enhance stakeholders' confidence in the credibility of the CSR information disclosed (Adams and Evans 2004; Brown-Liburd and Zamora 2015; Du and Wu 2019). For companies, obtaining external assurance signals that their reported CSR performance is fairly presented\n\nThis is an open access article under the terms of the Creative Commons Attribution License, which permits use, distribution and reproduction in any medium, provided the original work is properly cited.\n\n© 2025 The Author(s). Corporate Social Responsibility and Environmental Management published by ERP Environment and John Wiley &amp; Sons Ltd.\n\nCorporate Social Responsibility and Environmental Management, 2025; 32:8065-8081 https://doi.org/10.1002/csr.70120\nand free from material misstatements, thereby aiming to reduce CSR decoupling and enhance the overall quality of CSR reporting (Christensen et al. 2021; Ballou et al. 2018; Sethi et al. 2017). In parallel, policymakers have increasingly integrated assurance requirements into CSR disclosure regulations to improve the credibility of reported information at a systemic level. For instance, the EU has adopted the Corporate Sustainability Reporting Directive (CSRD), which initially mandates limited assurance for CSR disclosures. Similarly, other jurisdictions, such as South Africa, have introduced assurance obligations for CSR information (Ackers and Eccles 2015). However, both in voluntary and mandatory settings, CSR assurance may vary considerably in terms of the level and scope of assurance, and the choice of the assurance provider. The level of assurance ranges from reasonable assurance to limited assurance, and the scope of assurance may cover the entire report or be limited to specific sections. For an independent assurance provider, companies can choose assurance providers from either the auditing profession or non-auditing professions.\n\nIn voluntary settings, managers from companies with poor CSR performance facing public pressures and legitimacy threats may strategically benefit from less comprehensive assurance practices (i.e. limited instead of reasonable assurance and a narrower scope of assurance) to proactively shape stakeholders' perceptions of the credibility of the CSR information disclosed, while deflecting attention from poor CSR performance (Unerman 2008; O'Dwyer et al. 2011; Perego and Kolk 2012). They may exercise their managerial discretion to primarily use CSR assurance as a self-serving risk management tool to enhance external legitimacy and corporate reputation through symbolic communication about their CSR actions in CSR reports, without being adequately supported by substantive CSR actions (Bothello et al. 2023; García-Sánchez et al. 2022; Bromley and Powell 2012; Marquis et al. 2016; Velte 2021). Such practices raise doubts about the actual effectiveness of CSR assurance in reducing CSR decoupling and in enhancing the transparency and decision-usefulness of CSR reports for investors and other stakeholders (Boiral et al. 2019; Talbot and Boiral 2018; Michelon et al. 2015).\n\nIn mandatory settings, policymakers face important cost--benefit trade-offs when determining the appropriate level and scope of assurance in disclosure regulations (Leuz and Wysocki 2016; Christensen et al. 2021). These trade-offs have recently become evident in the EU Omnibus discussions (European Commission 2025), which ultimately led to the abandonment of the initially ambitious goal of requiring reasonable assurance for CSR disclosures aimed at elevating their quality to the level of financial reporting for all firms subject to the CSRD. To assess and evaluate the effectiveness of disclosure regulations in enhancing CSR reporting quality and credibility, it is important to develop a deeper understanding of how variations in CSR assurance choices may relate to variations in CSR decoupling. Specifically, the influence of combinations of CSR assurance choices on CSR decoupling remains underexplored (Aboud et al. 2024).\n\nIn this study, we aim to enhance understanding of the relationship between CSR assurance and CSR decoupling. To this end, we examine how combinations of assurance level, assurance scope, and the type of assurance provider are associated with reductions in CSR decoupling. Using a unique international panel dataset of publicly listed firms from 2010 to 2022, the results show that reductions in CSR decoupling are significantly negatively associated with the combination of reasonable assurance and a broad scope of assurance, as well as with reasonable assurance and providers from the auditing profession. This highlights the importance of comprehensive assurance practices in meaningfully addressing the gap between CSR disclosure and performance.\n\nOur study contributes to ongoing research on the effectiveness of CSR assurance in enhancing CSR reporting quality by being among the first to systematically examine how combinations of CSR assurance choices relate to CSR decoupling (García-Sánchez et al. 2022; Braam and Peeters 2018; Hodge et al. 2009). The findings indicate that the CSR assurance process can help reduce CSR decoupling when reasonable assurance is combined with a broad scope or when reasonable assurance is provided by an assurance provider from the auditing profession. They suggest that adopting a CSR assurance approach that exceeds the minimum standards, particularly through combinations involving reasonable assurance, can have synergistic effects in mitigating CSR decoupling.\n\nHowever, the findings show no significant relationships between reductions in CSR decoupling and combinations of limited assurance and other assurance-related choices, indicating that limited assurance is not effective in mitigating CSR decoupling. Instead, our findings suggest that limited assurance primarily serves a symbolic function, enhancing perceived legitimacy, stakeholder trust, and corporate reputation while having little effect on reducing CSR decoupling, and may even contribute to its increase. These findings have important implications for policymakers, investors, and other stakeholders. From a cost--benefit perspective, the findings are policy-relevant as they inform policymakers about the potential benefits of a comprehensive assurance approach to improving the quality of CSR reporting. Additionally, they help investors and other stakeholders better understand the role of CSR assurance in enhancing the credibility of CSR reports.",
        "literature_review": ""
    },
    {
        "journal_name": "jrfm-17-00526_pdf",
        "abstract": "",
        "introduction": "# 1. Introduction\n\nA 2022 Harris Poll, surveying 1491 executives, revealed that a striking 80% rated their organizations' environmental initiatives as above average. However, 58% conceded that green hypocrisy is prevalent, acknowledging that their companies have exaggerated their sustainability efforts (Google Cloud 2022).\n\nThe term greenwashing was first used by environmentalist Jay Westervelt in a 1986 essay promoting towel reuse in the hospitality industry (Pearson 2010; Wolniak and Håbek 2015; Guo et al. 2018). There is no generally accepted definition of the term greenwashing. The concept remains ambiguous (Seele and Gatti 2017).\n\nMany researchers (Ramus and Montiel 2005; Gillespie 2008; Stamoulakis and Bridwell 2009; Vos 2009; Furlow 2010; Mitchell and Ramey 2011) use the Oxford English Dictionary definition: \"disinformation disseminated by an organization so as to present an environmentally responsible public image\". Others use the definition of the organization Greenpeace: \"the act of misleading consumers regarding the environmental practices of a company or the environmental benefits of a product or service\" (Fliegelman 2009; Parguel et al. 2009, 2011; Gallicano 2011; Delmas and Cuerel Burbano 2011; Chen and Chang 2013).\n\nde Freitas Netto et al. (2020) identify types of greenwashing based on a systemic review from 2010 to 2020. Selective disclosure is when firms do not disclose negative environmental information and promote positive information. Decoupling behavior is when the firm uses symbolic actions to deflect attention to minor issues or issues it can control. The signaling of corporate pragmatic legitimacy is when corporations signal that they are meeting environmental goals they have failed to meet.\n\nIn this paper, I adopt a view where the level of effort of a firm in advertising and reporting its ESG activities is at variance with its level of effort in actual ESG activities as\n\nJ. Risk Financial Manag. 2024, 17, 526. https://doi.org/10.3390/jrfm17110526\n\nhttps://www.mdpi.com/journal/jrfm\na measure of greenwashing. This is a broad measure of greenwashing, as it ignores that a firm may not have to put as much effort as another firm to be ESG compliant. It also, unfortunately, mixes several previous definitions of greenwashing into one measure as well as captures legitimate information that may be helpful to consumers and investors. Thus, it is a noisy measure.\n\nGreenwashing of course presents a host of problems to the market. For investors, it hides risks that the company is exposed to, thus leading them to undercharge capital and subsequently leading to inefficient allocation of capital. For consumers, it leads to misallocation of consumption and misallocation of personal investment.\n\nDespite the voluminous literature on greenwashing, there have previously been few attempts at estimating the effects of greenwashing on the financial aspects of firms. The previous research has concentrated primarily on the effect of greenwashing on the market value of the firm's shares. Walker and Wan (2012), Du (2015), Testa et al. (2018a), and Ghitti et al. (2020) all find that greenwashing decreases the value of a greenwashing firm's stock shares. The reason for this is not clear. Zhang (2022a) finds that greenwashing activities by firms are associated with the firms being financially constrained. Kim and Lyon (2015) find that greenwashing is associated with higher profits and increased regulation. Marquis and Toffel (2011, 2012) propose that greenwashing is associated with increased firm size. Gregory (2023) finds that greenwashing is promoted by low stock price volatility, high costs of capital, and high information asymmetry between managers and shareholders.\n\nThe previous research has been limited in exploring the effects of greenwashing on financial metrics because the greenwashing measure used is an endogenous variable. I use a methodology that addresses this based on the errors-in-variables technique proposed by Griliches and Hausman (1986). By treating the Greenwash score used here as an endogenous variable, and realizing it is negatively correlated with the error term, this reveals a much richer and accurate set of results.\n\nIn this research, I examine the financial outcomes of greenwashing by constructing a greenwashing index using Refinitiv ESG component scores. I find that overall, the results suggest that greenwashing is a complex phenomenon with both positive and negative consequences. While it can improve a firm's public image and potentially enhance its financial performance, it may also lead to increased risk and misallocation of resources. Greenwashing firms have a lower weighted average cost of capital due to a higher debt-to-capital ratio. They are larger, have higher institutional ownership, and lower dividend yields. On the other hand, greenwashing firms have more ESG-related controversies that can hurt firm revenues and market value, they have higher unsystematic risk, and return on equity. I also find evidence that there is a feedback relationship between ESG ratings and greenwashing.\n\nSection 2 details the previous literature. Section 3 describes the materials and methods used in this research. Section 4 presents the results. Section 5 discusses the results. Section 6 presents the conclusion.",
        "literature_review": "## 2. Literature Review"
    },
    {
        "journal_name": "aaaj_2025_accepted_version_pdf",
        "abstract": "",
        "introduction": "# 1. Introduction\n\nSustainability reporting (SR)¹ is used as a communication tool providing information on companies’ sustainability-related activities to address the societal call for sustainable business and to build, enhance or repair organizational legitimacy. As the demand for transparency and accountability regarding corporate sustainability has been increasing among stakeholders, SR has become a standard corporate practice. Many studies, however, have demonstrated false claims, unmet promises or omitted performance outcomes in SR, which cause concerns that organizations “talk but do not walk the sustainability”. Consequently, the credibility and the quality of sustainability-related disclosures are often debated in the interdisciplinary accounting literature, suggesting that SR is prone to impression management (IM) strategies. While the literature offers extensive empirical evidence of IM in SR, its antecedents are not fully understood. In our study, we contribute to filling this research gap by focusing on linguistic style features of CEO narratives in SR as indicators of rhetorical IM.\n\nNarrative sections in SR contain personalized messages and business tales, addressing key corporate events, achievements and future prospects as presented by the corporate leader (Fuoli, 2018). We explore corporate visibility as a driver and/or constraint of IM practices in CEO letters, in line with Leary and Kowalski (1990). Our investigation distinguishes between general (related to industry membership) and issue visibility (driven by sustainability controversies reflecting unethical and irresponsible business behavior), both of which hold particular relevance in sustainability research (Dawkins and Fraas, 2010). While several authors argue that increased visibility and related scrutiny, make companies less prone to IM (e.g., Marquis et al., 2016), others suggest that companies with higher environmental exposure and institutional pressure - and consequently, greater public visibility - are more inclined to engage in IM practices to legitimize their environmentally unfriendly operations (e.g., Stacchezzini et al., 2016). We address these contradictions in the literature in three ways.\n\nFirst, drawing upon legitimacy theory, we argue that general and issue visibility relate to different legitimacy-related motives, i.e., maintaining legitimacy versus repairing legitimacy, which promote distinct IM strategies to match legitimacy-related requirements. The level of scrutiny for overt IM is clearly higher for companies operating in sustainability-sensitive industries² (hereafter referred to as sensitive industries), where the institutional environment is characterized by stringent regulations and governance structures due to their higher business exposure (Aerts and Cormier, 2009). For companies operating in sensitive industries, using formal and analytical language strategically in concert with institutionalized reporting formats and avoiding explicit self-serving IM are expected to foster perceived accountability and transparency and, thus, maintain legitimacy. Issue visibility driven by sustainability controversies, on the other hand, creates a gap between the desired and current image of companies through media and news and disrupts the legitimacy status-quo (Kuruppu et al., 2019). In such cases, managers are forced to respond to this disruption to repair damaged legitimacy by applying reactive IM strategies (Arvidsson, 2010). As the relationship between general visibility and the use of IM strategies is context-dependent and is likely to be affected\n\n---\n\n¹ In the literature, different terms have been used for SR, including corporate social responsibility (CSR) reporting; social/environmental reporting; environmental, social and governance (ESG) reporting; corporate social disclosures, etc. In this paper, we systematically use “sustainability reporting”, following the inclusive definition of sustainability in the Brundtland Report (1987).\n\n² Following prior literature (Garcia et al., 2017; Passetti et al., 2018), we define sustainability-sensitive industries as those having a major socio-environmental impact and being subject to social taboos, moral debates and political pressures. These industries include materials (chemicals, metals &amp; mining, forestry-paper &amp; wood products), electric utilities, and oil and gas producers.\nby the company's business exposure, we also assess the effect of the interaction of industry and controversies on the use of IM.\n\nSecond, prior SR studies have predominantly focused on content-based IM, including selective disclosure (e.g., Marquis et al., 2016, Roszkowska-Menkes et al., 2024) and imagery (e.g., Boiral, 2013), while little attention has been paid to style-related IM, i.e., managers' use of language. The discretionary nature of corporate narratives can be exploited opportunistically by managers by crafting linguistic style to guide readers on how content is to be appreciated along a preferred mindset (Talbot and Boiral, 2018). Style-based IM can take a variety of forms using affective tone, personalization or cognitive devices (e.g., causal language, certainty expressions, etc.). While the limited prior research in this area has primarily examined readability manipulation as an obfuscation strategy (e.g., Li et al., 2023; Smeuninx et al., 2020; Wang et al., 2018), our study offers a more nuanced analysis of linguistic style in SR.\n\nFinally, we focus on the CEO letter as a distinct genre within SR, offering the highest degree of freedom in editorial and linguistic choice and not directly burdened by institutionalized reporting frameworks. Research on the actual talk of sustainability in the CEO letter is currently rather limited (Arvidsson, 2023). We need to acknowledge, however, that the CEO letter is not a comprehensive nor an independent SR vehicle. It is rather a somewhat superimposed piece in the SR repertoire that provides the CEO the opportunity to put a personal stamp on how to position the corporate sustainability challenge, but with the main report as the bottom line. Editorial choice may materialize in summarizing highlights of the main report, introducing the general setting or providing closure of the issues involved. Whatever the chosen editorial perspective, it can be assumed that the level of transparency of the main report will affect the language use in the CEO report. By disregarding the specific status and interdependency of the CEO letter, previous studies might have overlooked the nuanced ways in which CEOs' editorializing complements the main report responding to stakeholders' legitimacy concerns. By controlling for the overall transparency level of SR, we investigate how CEOs engage with the information presented therein.\n\nTo this end, we employ a sample of 2,139 CEO letters from 384 companies from the EU, the UK and the US that published a stand-alone SR between 2010 and 2019. We utilize the three summary variables and the cognitive processes variable of the Linguistic Inquiry and Word Count (LIWC) software, which reveal the functional, affective and cognitive linguistic elements encompassed within SR CEO letters. Through factor analysis, we identify rhetorical profiles in SR CEO letters. This approach yields three rhetorical profiles: (1) formal-analytical; (2) assertive; and (3) defensive. Formal-analytical relates to formal, rational and hierarchical language use (Pennebaker et al., 2015), while assertive and defensive relate to narrative styles that are less technical and less factual but imply purposeful sense-giving (Arvidsson and Johansson, 2019, Caliskan et al., 2021). Using the three profiles, we test our hypotheses using multivariate regression analyses. In doing so, our analysis goes beyond the limited body of research on rhetorical IM in SR, which predominantly relies on qualitative methodologies with a small sample size.\n\nOur findings document that CEOs in more visible industries show a lower propensity to use assertive rhetorical IM refraining from outward-facing and authoritative communication. These companies tend to use more formal-analytical language in CEO letters. It reflects a risk-averse and personally detached CEO stance, aimed at maintaining legitimacy under greater scrutiny and governance pressure by fostering an aura of accountability and objectivity. This would imply that general visibility is not a motivator for explicit IM but rather acts as a constraint. However, when companies in sensitive industries are faced with company-specific sustainability challenges, CEOs step in to actively explain or contextualize the issues in a reactive manner to repair/restore threatened legitimacy. Our results suggest that the CEO's\n\n3\nreactive cognitive framing in response to controversies is mainly prompted by general visibility. Interestingly, we find that identified explicit IM styles are both positively correlated with readability, shedding new light on the use of low readability as a proxy for IM in prior studies. With respect to the interdependency between the CEO letter and the main part of the report, our results indicate that, in general, higher disclosure transparency tends to promote more formal-analytical language and less rhetorical IM by the CEO. This suggests that CEO letters are, indeed, not independent documents separate from the main report and that CEOs appear to consider the company's general disclosure transparency when constructing their narrative. Overall, our results offer valuable insights into the interconnections among visibility, scrutiny and concerns about legitimacy, enriching the scholarly discourse within the field of corporate sustainability.\n\nThe remainder of the paper proceeds as follows: The second part provides a brief literature review of SR and IM. In the third part, we introduce visibility notions and develop our hypotheses. The methodology used is presented in part four. The fifth part presents our research findings (including robustness checks). Finally, in part six, we discuss our findings and conclude.",
        "literature_review": "## 2. Literature review"
    },
    {
        "journal_name": "Does ESG report greenwashing increase stock price crash risk _pdf",
        "abstract": "## ABSTRACT\n\nFrom the perspective of non-financial information greenwashing, this paper investigates the impact mechanism of environmental, social and governance (ESG) report greenwashing on stock price crash risk. The results indicate that ESG report greenwashing increases the stock price crash risk. In high earnings management companies, ESG report greenwashing is positively correlated with stock price crash risk, and ESG report greenwashing and earnings management are complementary. Further analysis shows that better internal and external corporate governance can suppress the impact of ESG greenwashing. In addition, in the voluntary disclosure and private enterprise samples, ESG report greenwashing has a greater impact on the stock price crash risk. Mechanism analysis found that the greenwashing of ESG reports intensified the information asymmetry, which increased the stock price crash risk. Overall, our evidence is consistent with the masking effect of socially responsible information, and that ESG greenwashing increases the stock price crash risk.",
        "introduction": "# 1. Introduction\n\nClimate change risks and COVID-19 impact the sustainable development of the global economy. As the social responsibility information for evaluating the sustainable development of companies, the environmental, social and governance (ESG) report plays an increasingly important role in the capital market. For example, on 18 September 2015, the US Environmental Protection Agency found that Volkswagen installed special software on the engine controller to avoid the official inspection of exhaust emissions. After the exposure of the behaviour that the emission of exhaust gas went from 10 to 40 times beyond the standard to greenwashing to high environmental protection standards, its share price fell by 40% in 1 month. After Chinese 'dual carbon' goal was put forward, the asset management scale of domestic ESG public funds increased by more than 100 billion, and the number of A-share listed companies that disclosed CSR/ESG reports in 2021 has\n\nCONTACT Yong Shi shiyong1027@126.com School of Accounting, Zhongnan University of Economics and Law, 182",
        "literature_review": "## Institutional background, literature review and research hypothesis"
    },
    {
        "journal_name": "sustainability-18-00017-v2_pdf",
        "abstract": "# Abstract\n\nThis paper presents a systematic literature review (SLR) of research on strategic positioning of companies and the measurement of greenwashing in sustainability reporting. Its main aim is to synthesize and organize the existing literature, identify key research gaps, and outline directions for future studies. Drawing on a rigorous content analysis of 88 studies, we delineate strategic typologies of greenwashing in sustainability reporting and examine content-analysis-based measurement approaches used to detect it. Our SLR shows that most strategic typologies draw on theories such as legitimacy theory, impression management theory, signaling theory, and stakeholder theory. Several studies adopt a four-quadrant matrix with varying conceptual dimensions, while others classify strategic responses to institutional pressures along a passive-active continuum. However, the evidence suggests that to assume that companies uniformly pursue sustainability reporting strategies is a major oversimplification. The findings also indicate that the literature proposes a variety of innovative, content-analysis-based approaches aimed at capturing divergences between communicative claims and organizational realities—most notably, discrepancies between disclosure and measurable performance, and between symbolic and substantive sustainability actions, as well as the identification of selective or manipulative communication practices that may signal greenwashing. Analytical techniques commonly focus on linguistic and visual cues in sustainability reports, including tone (sentiment and narrative framing), readability (both traditional readability indices and machine learning-based textual complexity measures), and visual content (selective emphasis, imagery framing, and graphic distortions). We also synthesize studies that document empirically verified instances of greenwashing and contrast them with research that, in our view, relies on overly simplified or untested assumptions. Based on this SLR, we identify central theoretical and methodological priorities for advancing the study of greenwashing in sustainability reporting and propose a research agenda to guide future research.\n\nKeywords: sustainability reporting; corporate greenwashing; greenwashing measurement; measurement approaches; strategic typologies; systematic literature review",
        "introduction": "# 1. Introduction\n\nThe concept of greenwashing began to gain wider attention in the late 1990s, with scholarly and public interest in the issue continuing to grow over the following decades [1]. Although research on this phenomenon has expanded significantly, the concept still lacks a\n\nCheck for updates\n\nAcademic Editor: Silvia Angeloni\n\nReceived: 6 November 2025\n\nRevised: 4 December 2025\n\nAccepted: 12 December 2025\n\nPublished: 19 December 2025\n\nCopyright: © 2025 by the authors.\n\nLicensee MDPI, Basel, Switzerland.\n\nThis article is an open access article\n\ndistributed under the terms and\n\nconditions of the Creative Commons\n\nAttribution (CC BY) license.\n\nSustainability 2026, 18, 17\n\nhttps://doi.org/10.3390/su18010017\nsingle, universally accepted definition, and its interpretation remains open to debate [2]. It was originally applied to environmental issues and defined as “the intersection of two firm behaviors: poor environmental performance and positive communication about environmental performance” [3]. It was also referred to as “symbolic corporate environmentalism” [4]. Subsequently, the concept evolved into a broader interpretation, described as the “selective disclosure of positive information about a company's environmental or social performance without full disclosure of negative information on these dimensions, so as to create an overly positive corporate image” [5] or the “act of presenting a company's environmental and/or social performance in a misleading way” [6]. Following the triple-bottom-line approach to sustainability and the principles of environmental integrity, social equity, and economic prosperity, addressing environmental, social, and economic issues has become essential to discussions of greenwashing [2].\n\nGreenwashing has been analyzed from various perspectives, with the literature presenting different conceptualizations of its relationship to similar notions. Some authors interpret it as a form of decoupling [7], highlighting the discrepancy between dissemination of symbolic statements (“talk”) and actual actions (“walk”) [8]. Others view greenwashing as a concept that describes decoupling processes within the context of sustainability, treating greenwashing and decoupling as synonyms [9,10,11]. Yet, Siano et al. [12] distinguish between two primary types of greenwashing: decoupling and attention deflection. In this context, decoupling refers to the gap between disclosure and performance [13] or between policy statements and actual corporate commitment [14], as well as the disconnection between means and ends [15]. It also includes impression management practices that involve “empty green claims and policies” and “sin of fibbing”, in which companies make claims that are outright false [16]. Impression management encompasses emphasizing positive organizational outcomes (enhancement) or obfuscating negative organizational outcomes (concealment) [17].\n\nAttention deflection, as the act of concealing unethical business practices, encompasses various deceptive communication tactics, such as selective and inaccurate disclosure [5], including incomplete comparisons and vague or irrelevant statements [18]. It also involves misleading written texts and visual imagery [19] as well as unverifiable claims, such as implied superiority and the “sin of no proof”, where assertions lack substantiating evidence or accessible supporting information [20].\n\nGreenwashing involves both the overstatement of positive performance and the concealment of negative information [21,22]. It encompasses a broad range of practices commonly characterized by the dissemination of misleading information [23], including various forms of false claims rooted in hypocrisy and/or deception [24]. Some authors connect greenwashing with the obfuscation of negative sustainability information, suggesting that companies with inferior sustainability performance use complex, ambiguous language to produce intentionally opaque or confusing reports [25]. This means that greenwashing can be identified through linguistic patterns, which often rely on overly optimistic terms that emphasize positive aspects. Accordingly, the literature on greenwashing is closely related to research on selective disclosure, in which favorable information is emphasized while unfavorable details are minimized or omitted [26].\n\nIn this paper, we refer to greenwashing in sustainability reporting as the deliberate or unintended dissemination of misleading, incomplete, or overly favorable sustainability-related disclosures. It is manifested through the selective presentation of positive information, the concealment or obfuscation of negative performance, or the decoupling of reported claims from underlying organizational practices. This process constructs an unjustifiably positive impression of corporate sustainability by overstating positive actions and concealing negative ones.\nThe complex and often ambiguous nature of greenwashing presents substantial methodological challenges for researchers attempting to identify and measure it. At the same time, these challenges offer valuable opportunities for future inquiry [27]. However, there remains a limited understanding regarding the strategic typologies of greenwashing in sustainability reporting and the approaches used to measure it, including their operationalization, methodologies, and data sources applied in this field [28]. In particular, approaches based on content analysis are especially valuable and offer significant conceptual and empirical insights, given that much of the existing research on greenwashing relies on indicators derived from secondary sources such as dedicated databases and specific ratings, which are not always transparent, are often binary, and may be arbitrary or highly autocorrelated. In fact, using composite ESG indicators derived from secondary sources typically provides only aggregated scores, obscuring which aspect of greenwashing is measured, reducing comparability across heterogeneous providers, and limiting replicability where access to commercial ESG databases is restricted [29,30,31].\n\nGrowing scholarly interest in greenwashing has resulted in the publication of several systematic literature reviews [32,33,34,35,36,37,38,39] and bibliometric analyses that characterize the structure and trends in this scientific field [40,41,42,43]. Nonetheless, systematic literature reviews focusing specifically on the measurement of greenwashing [32] and greenwashing in sustainability reporting [44,45] remain scarce. This scarcity is particularly evident in relation to strategic typologies of greenwashing in sustainability reporting and to measurement approaches grounded in content-analysis studies.\n\nGiven these challenges and the rapidly expanding research on greenwashing in sustainability reporting, it is crucial to build on existing analyses to address persistent gaps and explore under-researched areas.\n\nThe main aim of this paper, therefore, is to systematically organize and synthesize the current literature, identify key research gaps, and outline directions for future studies in this field. We offer, to the best of our knowledge, one of the most comprehensive syntheses to date of strategic typologies of greenwashing in sustainability reporting and provide an integrated, conceptually grounded overview of existing approaches and analytical techniques used to measure and detect greenwashing through content analysis. In particular, our systematic literature review aims to address the following research questions, which have not been sufficiently explored in existing research:What strategic typologies of greenwashing in sustainability reporting have been identified in the literature?What content analysis--based measurement approaches are used to detect greenwashing in sustainability reporting?\n\nThe remainder of the paper is organized as follows. Section 2 details the research methodology. In Section 3, the results are presented and discussed. Section 4 identifies areas for future research and Section 5 provides concluding remarks and acknowledges the study's limitations.",
        "literature_review": "# Greenwashing in Sustainability Reporting: A Systematic Literature Review of Strategic Typologies and Content-Analysis-Based Measurement Approaches\n\nAgnieszka Janik and Adam Ryszko\n\nFaculty of Organization and Management, Silesian University of Technology, 41-800 Zabrze, Poland; agnieszka.janik@polsl.pl\n\n* Correspondence: adam.ryszko@polsl.pl"
    },
    {
        "journal_name": "Business Ethics Env   Resp - 2023 - Boiral - What you see is what you get  Building confidence in ESG disclosures for_pdf",
        "abstract": "## Abstract\n\nThe main objective of this study is to understand the value of environmental, social, and governance (ESG) disclosure assurance in the context of the development of sustainable finance standards and laws. This study is based on an analysis of 188 comment letters submitted by such actors in the context of public consultations on the development of three new sustainable finance initiatives (the CFA Institute, the Financial Conduct Authority in the UK, and the New Zealand parliament). The study shows these actors' nuanced and often quite critical perceptions of the effectiveness of external assurance in preventing greenwashing and their reservations about its mandatory nature. These actors have raised various criticisms, including concerns about the vagueness surrounding verification practices; the lack of expertise available to conduct assurance in a new, specialized, and complex field; the costs of the assurance process, particularly for small players; and the lack of control over the reliability of the ESG data used. This article contributes to several emerging trends in the literature—in particular, research on governance practices to prevent greenwashing, on the institutionalization of sustainable finance standards and laws, and on the role of rational myths in the assurance process for ESG disclosures.",
        "introduction": "# 1 | INTRODUCTION\n\nSustainable finance, which is based on the integration of ESG issues into investment decisions, has experienced unprecedented growth in recent years (Migliorelli, 2021; Popescu et al., 2021). In 2020, ESG assets were estimated to exceed $35 trillion worldwide and are expected to represent nearly a third of all financial assets by 2025 (Bloomberg, 2021). The development of sustainable finance responds to the need to reduce ESG risks—including those related to climate change and the reputational impacts of lack of commitment in this area—and to support the financing of economic\n\nactivities that take these issues into account in a meaningful way (CFA Institute, 2022; Chiu, 2022; Cunha et al., 2021; Myers &amp; Czarnezki, 2021). However, greenwashing trends are increasingly criticized and raise fundamental questions about the transparency of ESG investment products (Baldi &amp; Pandimiglio, 2022; CFA Institute, 2022; Hetzner, 2022; Popescu et al., 2021). These criticisms are reinforced by the proliferation of these products and the virtual absence of regulation for practitioners in the field, who are raising increasing amounts of capital to finance supposedly sustainable activities (Chiu, 2022; Krasodomska et al., 2021; Migliorelli, 2021; Myers &amp; Czarnezki, 2021).\n\nThis is an open access article under the terms of the Creative Commons Attribution-NonCommercial-NoDerivs License, which permits use and distribution in any medium, provided the original work is properly cited, the use is non-commercial and no modifications or adaptations are made.\n\n© 2023 The Authors. Business Ethics, the Environment &amp; Responsibility published by John Wiley &amp; Sons Ltd.\n\nBusiness Ethics, Env &amp; Resp. 2024;33:617-632.\n\nwileyonlinelibrary.com/journal/beer\nIn response to the need to regulate players in the field, various standard‐setting agencies, governments, and professional associations have begun to develop and adopt standards and laws on ESG disclosure for investment products, especially since 2019. These sustainable finance initiatives are very recent and, in some cases, still in draft form; in addition, the willingness and ability of practitioners in the field to adopt them seems, at best, uncertain. To reassure stakeholders on this issue, several initiatives have planned assurance processes that aim to use external audits to verify that sustainable investment products are in compliance with the ESG requirements they are supposed to meet. However, stakeholders' perceptions of this verification process remain unclear, as does the manner in which the processes will be concretely applied to the specific context of ESG disclosure for investment products.\n\nThe main objective of this paper is to understand the value and identify the challenges of ESG disclosure assurance in the process of institutionalizing sustainable finance standards and laws. More specifically, this paper addresses the following research question: Among people who have submitted contributions to consultations for the development of sustainable finance standards and laws, what is the perception about the assurance of ESG disclosures used for investment products? To explore this question, we used QDA Miner software to conduct a qualitative content analysis of 188 comment letters received during the consultation processes for three distinct sustainable finance initiatives, namely from the CFA Institute (an international group), the Financial Conduct Authority (FCA) in the UK, and the New Zealand parliament.\n\nThe research objective is important for at least four reasons. First, initiatives that aim to improve the quality of ESG disclosures for responsible investments address critical needs. Indeed, the lack of reliable information in this area and the risk of greenwashing are considered to be the main obstacles to the promotion and sound use of this type of investment (Benson, 2021; La Torre & Chiappini, 2021; Myers & Czarnezki, 2021; Popescu et al. 2021). Although sustainable finance standards and laws should in principle improve the confidence of investors and other stakeholders, it remains unclear how these instruments will be applied in practical terms. In the absence of an independent verification mechanism, it is reasonable to assume that the adoption of a self‐proclaimed sustainable finance standard will have little credibility and may add little value in the eyes of investors. This article therefore contributes to the literature on how to limit greenwashing in a new and still under‐researched area.\n\nSecond, the article contributes to the literature on the institutionalization process of sustainable finance, which currently includes very few studies on voluntary standards as regulation mechanisms (Chiu, 2022; Myers & Czarnezki, 2021; Popescu et al. 2021). Moreover, the focus on the assurance process makes it possible to highlight the challenges related to implementing and monitoring standards rather than examining their general objectives or particular design. The results of the study thus allow us to anticipate problems that have not necessarily manifested yet but that are likely to appear in the short or medium term.\n\nThird, the article explores the possible rational myth surrounding, on the one hand, sustainable finance standards' appearance of being rigorous, rational, and legitimate and, on the other hand, the reality of practices related to ESG investment products. It provides a better understanding of how normative pressures to introduce new standards have led to the emergence of a counter‐discourse on the effectiveness and relevance of assurance processes. Rational myths are often observed in sustainability management, due in particular to practices that, on the surface, aim to respond to institutional pressures in this area (Boiral, 2007; Gibassier et al. 2018; Perego & Kolk, 2012). The article thus contributes to the literature on rational myths and how they arise around activities that are central to the promotion of sustainability but that have not yet been the subject of extensive empirical investigation. In addition, this article demonstrates the relevance of neo‐institutional theory for studying the implementation of new standards in auditing and assurance (Haapamäki, 2022).\n\nFourth, the article contributes to the literature on the external assurance of ESG disclosures. Stakeholders' views on the value and effectiveness of such assurance are largely neglected in the research on this issue (Krasodomska et al. 2021; Manetti & Toccafondi, 2012; Wong & Millington, 2014). Therefore, analyzing the submissions to the public consultations set up by the developers of sustainable finance standards to understand the contributors' perceptions sheds new light on the effectiveness of and problems with the assurance process.\n\nThe remainder of the paper is structured as follows. Section 2 provides a literature review about the public's confidence in ESG disclosures for sustainable finance, notably by highlighting the rational myths surrounding the assurance of ESG disclosures in the context of sustainable finance. Section 3 presents the qualitative content analysis approach used in this research. Section 4 describes the results obtained from the content analysis. Section 5 includes the discussion of these results, their contributions to the literature, their managerial implications, and the limitations of the study as well as avenues for future research.",
        "literature_review": ""
    },
    {
        "journal_name": "Global Comparability in Financial Reporting  What  Why  How  and When _pdf",
        "abstract": "",
        "introduction": "",
        "literature_review": ""
    }
]